SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
  __IOM uint32_t PATRIM2_SET;                   /**< PATRIM2                                            */
  __IOM uint32_t PATRIM3_SET;                   /**< PATRIM3                                            */
  __IOM uint32_t PATRIM4_SET;                   /**< PATRIM4                                            */
  __IOM uint32_t PATRIM5_SET;                   /**< PATRIM5                                            */
  __IOM uint32_t PADEBUG0_SET;                  /**< PADEBUG0                                           */
  __IOM uint32_t TXPOWER_SET;                   /**< TXPOWER                                            */
  __IOM uint32_t TXRAMP_SET;                    /**< TXRAMP                                             */
  uint32_t       RESERVED30[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PGATRIM_SET;                   /**< PGATRIM                                            */
  __IOM uint32_t PGACAL_SET;                    /**< PGACAL                                             */
  __IOM uint32_t PGACTRL_SET;                   /**< PGACTRL                                            */
  __IOM uint32_t RFBIASCAL_SET;                 /**< RFBIASCAL                                          */
  __IOM uint32_t RFBIASCTRL_SET;                /**< RFBIASCTRL                                         */
  __IOM uint32_t RADIOEN_SET;                   /**< RADIOEN                                            */
  __IOM uint32_t RFPATHEN0_SET;                 /**< RFPATHEN0                                          */
  __IOM uint32_t RFPATHEN1_SET;                 /**< RFPATHEN1                                          */
  __IOM uint32_t RX_SET;                        /**< RX                                                 */
  __IOM uint32_t TX_SET;                        /**< TX                                                 */
  uint32_t       RESERVED31[1U];                /**< Reserved for future use                            */
  __IOM uint32_t SYTRIM0_SET;                   /**< SYTRIM0                                            */
  __IOM uint32_t SYTRIM1_SET;                   /**< SYTRIM1                                            */
  __IOM uint32_t SYCAL_SET;                     /**< SYCAL                                              */
  __IOM uint32_t SYEN_SET;                      /**< SYEN                                               */
  __IOM uint32_t SYLOEN_SET;                    /**< SYLOEN                                             */
  __IOM uint32_t SYMMDCTRL_SET;                 /**< SYMMDCTRL                                          */
  __IOM uint32_t SYDIVCTRL_SET;                 /**< SYDIVCTRL                                          */
  __IOM uint32_t DIGCLKRETIMECTRL_SET;          /**< DIGCLKRETIMECTRL                                   */
  __IM uint32_t  DIGCLKRETIMESTATUS_SET;        /**< DIGCLKRETIMESTATUS                                 */
  __IOM uint32_t XORETIMECTRL_SET;              /**< XORETIMECTRL                                       */
  __IM uint32_t  XORETIMESTATUS_SET;            /**< XORETIMESTATUS                                     */
  __IOM uint32_t AGCOVERWRITE0_SET;             /**< OVERWRITE AGC                                      */
  __IOM uint32_t AGCOVERWRITE1_SET;             /**< OVERWRITE AGC                                      */
  uint32_t       RESERVED32[5U];                /**< Reserved for future use                            */
  __IOM uint32_t TXOGNDPKD_SET;                 /**< TXOGNDPKD                                          */
  __IM uint32_t  TXOGNDPKDSTATUS_SET;           /**< TXOGNDPKDSTATUS                                    */
  uint32_t       RESERVED33[4U];                /**< Reserved for future use                            */
  __IOM uint32_t GPPLLCLKRETIMECTRL_SET;        /**< GPPLLCLKRETIMECTRL                                 */
  __IM uint32_t  GPPLLCLKRETIMESTATUS_SET;      /**< GPPLLCLKRETIMESTATUS                               */
  uint32_t       RESERVED34[2U];                /**< Reserved for future use                            */
  __IOM uint32_t PATRIM6_SET;                   /**< PATRIM6                                            */
  __IOM uint32_t PATRIM7_SET;                   /**< PATRIM7                                            */
  __IOM uint32_t PATRIM8_SET;                   /**< PATRIM8                                            */
  __IOM uint32_t PATRIM9_SET;                   /**< PATRIM9                                            */
  __IOM uint32_t PATRIM10_SET;                  /**< PATRIM10                                           */
  uint32_t       RESERVED35[1U];                /**< Reserved for future use                            */
  __IOM uint32_t TXRFPKD_SET;                   /**< TXRFPKD                                            */
  uint32_t       RESERVED36[1U];                /**< Reserved for future use                            */
  __IM uint32_t  TXSTATUS_SET;                  /**< TXSTATUS                                           */
  __IOM uint32_t TXOFDM_SET;                    /**< TXOFDM                                             */
  uint32_t       RESERVED37[1U];                /**< Reserved for future use                            */
  __IOM uint32_t TXMIX_SET;                     /**< TXMIX                                              */
  __IOM uint32_t TXITC_SET;                     /**< TXITC                                              */
  __IOM uint32_t TXCALITC_SET;                  /**< TXCALITC                                           */
  uint32_t       RESERVED38[57U];               /**< Reserved for future use                            */
  __IOM uint32_t TXPKDCTRL_SET;                 /**< Control Register                                   */
  __IOM uint32_t TXPKDCMD_SET;                  /**< CMD Register                                       */
  __IM uint32_t  TXPKDSTATUS_SET;               /**< Status Register                                    */
  uint32_t       RESERVED39[49U];               /**< Reserved for future use                            */
  __IOM uint32_t RADIOCLKCTRL_SET;              /**< New Register                                       */
  uint32_t       RESERVED40[3U];                /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0_SET;                  /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1_SET;                  /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2_SET;                  /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3_SET;                  /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4_SET;                  /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5_SET;                  /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6_SET;                  /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7_SET;                  /**< SCRATCH7                                           */
  __IOM uint32_t SOFTMCTRL_SET;                 /**< Soft Modem Control                                 */
  __IOM uint32_t SFMIF_SET;                     /**< Soft Modem Interrupt Flags                         */
  __IOM uint32_t SFMIEN_SET;                    /**< Soft Modem Interrupt Enables                       */
  uint32_t       RESERVED41[247U];              /**< Reserved for future use                            */
  __IOM uint32_t THMSW_SET;                     /**< Thermister control                                 */
  uint32_t       RESERVED42[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED43[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED44[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED45[513U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version                                         */
  __IOM uint32_t EN_CLR;                        /**< Enable peripheral clock to this module             */
  __IOM uint32_t RXENSRCEN_CLR;                 /**< RXEN Source Enable                                 */
  __IM uint32_t  STATUS_CLR;                    /**< Radio State Machine Status                         */
  __IOM uint32_t CMD_CLR;                       /**< Radio Commands                                     */
  __IOM uint32_t CTRL_CLR;                      /**< Radio Control Register                             */
  __IOM uint32_t FORCESTATE_CLR;                /**< Force state transition                             */
  __IOM uint32_t IF_CLR;                        /**< Radio Controller Interrupt Flags                   */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable Register                          */
  __IOM uint32_t TESTCTRL_CLR;                  /**< Test Control Register                              */
  __IOM uint32_t SEQIF_CLR;                     /**< SEQ Interrupt Flags                                */
  __IOM uint32_t SEQIEN_CLR;                    /**< SEQ Interrupt Enable Register                      */
  __IM uint32_t  STATUS1_CLR;                   /**< Radio State Machine Status                         */
  __IOM uint32_t FEMCTRL_CLR;                   /**< FEM Control                                        */
  __IOM uint32_t FEMDATA_CLR;                   /**< FEM Data                                           */
  uint32_t       RESERVED46[5U];                /**< Reserved for future use                            */
  __IM uint32_t  STIMER_CLR;                    /**< Sequencer Timer Value                              */
  __IOM uint32_t STIMERCOMP_CLR;                /**< Sequencer Timer Compare Value                      */
  __IOM uint32_t SEQCTRL_CLR;                   /**< Sequencer Control Register                         */
  __IOM uint32_t PRESC_CLR;                     /**< Sequencer prescaler Register                       */
  __IOM uint32_t SR0_CLR;                       /**< Storage Register 0                                 */
  __IOM uint32_t SR1_CLR;                       /**< Storage Register 1                                 */
  __IOM uint32_t SR2_CLR;                       /**< Storage Register 2                                 */
  __IOM uint32_t SR3_CLR;                       /**< Storage Register 3                                 */
  __IOM uint32_t STCTRL_CLR;                    /**< Sys tick timer Control Register                    */
  __IOM uint32_t FRCTXWORD_CLR;                 /**< FRC wordbuffer write                               */
  __IM uint32_t  FRCRXWORD_CLR;                 /**< FRC wordbuffer read                                */
  __IOM uint32_t EM1PCSR_CLR;                   /**< Radio EM1P Control and Status Register             */
  uint32_t       RESERVED47[6U];                /**< Reserved for future use                            */
  __IOM uint32_t SYNTHENCTRL_CLR;               /**< Synthesizer Enable Control Register                */
  __IOM uint32_t SYNTHREGCTRL_CLR;              /**< Synthesizer Regulator Enable Control               */
  __IOM uint32_t VCOCTRL_CLR;                   /**< VCO Control Register                               */
  uint32_t       RESERVED48[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED49[1U];                /**< Reserved for future use                            */
  __IM uint32_t  STATUS2_CLR;                   /**< Radio State Machine Status 2                       */
  __IOM uint32_t IFPGACTRL_CLR;                 /**< IF PGA Control Register                            */
  __IOM uint32_t PAENCTRL_CLR;                  /**< PA Enable Control Register                         */
  __IOM uint32_t APC_CLR;                       /**< Automatic Power Control Register                   */
  __IOM uint32_t ANTDIV_CLR;                    /**< ANTDIV                                             */
  __IOM uint32_t AUXADCTRIM_CLR;                /**< AUXADCTRIM                                         */
  __IOM uint32_t AUXADCEN_CLR;                  /**< AUXADCEN                                           */
  __IOM uint32_t AUXADCCTRL0_CLR;               /**< Auxiliary ADC register control                     */
  __IOM uint32_t AUXADCCTRL1_CLR;               /**< AUXADCCTRL1                                        */
  __IM uint32_t  AUXADCOUT_CLR;                 /**< Auxiliary ADC digital output                       */
  __IOM uint32_t CLKMULTEN0_CLR;                /**< CLKMULTEN0                                         */
  __IOM uint32_t CLKMULTEN1_CLR;                /**< CLKMULTEN1                                         */
  __IOM uint32_t CLKMULTCTRL_CLR;               /**< CLKMULTCTRL                                        */
  __IM uint32_t  CLKMULTSTATUS_CLR;             /**< CLKMULTSTATUS                                      */
  uint32_t       RESERVED50[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IFADCTRIM0_CLR;                /**< IFADCTRIM0                                         */
  __IOM uint32_t IFADCTRIM1_CLR;                /**< IFADCTRIM1                                         */
  __IOM uint32_t IFADCCAL_CLR;                  /**< IFADCCAL                                           */
  __IM uint32_t  IFADCSTATUS_CLR;               /**< IFADCSTATUS                                        */
  uint32_t       RESERVED51[1U];                /**< Reserved for future use                            */
  __IOM uint32_t LNAMIXTRIM0_CLR;               /**< LNAMIXTRIM0                                        */
  __IOM uint32_t LNAMIXTRIM1_CLR;               /**< LNAMIXTRIM1                                        */
  __IOM uint32_t LNAMIXTRIM2_CLR;               /**< LNAMIXTRIM2                                        */
  __IOM uint32_t LNAMIXTRIM3_CLR;               /**< LNAMIXTRIM3                                        */
  __IOM uint32_t LNAMIXTRIM4_CLR;               /**< LNAMIXTRIM4                                        */
  __IOM uint32_t LNAMIXCAL_CLR;                 /**< LNAMIXCAL                                          */
  __IOM uint32_t LNAMIXEN_CLR;                  /**< LNAMIXEN                                           */
  __IOM uint32_t PRECTRL_CLR;                   /**< PRECTRL                                            */
  uint32_t       RESERVED52[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PATRIM1_CLR;                   /**< PATRIM1                                            */
  __IOM uint32_t PATRIM2_CLR;                   /**< PATRIM2                                            */
  __IOM uint32_t PATRIM3_CLR;                   /**< PATRIM3                                            */
  __IOM uint32_t PATRIM4_CLR;                   /**< PATRIM4                                            */
  __IOM uint32_t PATRIM5_CLR;                   /**< PATRIM5                                            */
  __IOM uint32_t PADEBUG0_CLR;                  /**< PADEBUG0                                           */
  __IOM uint32_t TXPOWER_CLR;                   /**< TXPOWER                                            */
  __IOM uint32_t TXRAMP_CLR;                    /**< TXRAMP                                             */
  uint32_t       RESERVED53[1U];                /**< Reserved for future use                            */
  __IOM uint32_t PGATRIM_CLR;                   /**< PGATRIM                                            */
  __IOM uint32_t PGACAL_CLR;                    /**< PGACAL                                             */
  __IOM uint32_t PGACTRL_CLR;                   /**< PGACTRL                                            */
  __IOM uint32_t RFBIASCAL_CLR;                 /**< RFBIASCAL                                          */
  __IOM uint32_t RFBIASCTRL_CLR;                /**< RFBIASCTRL                                         */
  __IOM uint32_t RADIOEN_CLR;                   /**< RADIOEN                                            */
  __IOM uint32_t RFPATHEN0_CLR;                 /**< RFPATHEN0                                          */
  __IOM uint32_t RFPATHEN1_CLR;                 /**< RFPATHEN1                                          */
  __IOM uint32_t RX_CLR;                        /**< RX                                                 */
  __IOM uint32_t TX_CLR;                        /**< TX                                                 */
  uint32_t       RESERVED54[1U];                /**< Reserved for future use                            */
  __IOM uint32_t SYTRIM0_CLR;                   /**< SYTRIM0                                            */
  __IOM uint32_t SYTRIM1_CLR;                   /**< SYTRIM1                                            */
  __IOM uint32_t SYCAL_CLR;                     /**< SYCAL                                              */
  __IOM uint32_t SYEN_CLR;                      /**< SYEN                                               */
  __IOM uint32_t SYLOEN_CLR;                    /**< SYLOEN                                             */
  __IOM uint32_t SYMMDCTRL_CLR;                 /**< SYMMDCTRL                                          */
  __IOM uint32_t SYDIVCTRL_CLR;                 /**< SYDIVCTRL                                          */
  __IOM uint32_t DIGCLKRETIMECTRL_CLR;          /**< DIGCLKRETIMECTRL                                   */
  __IM uint32_t  DIGCLKRETIMESTATUS_CLR;        /**< DIGCLKRETIMESTATUS                                 */
  __IOM uint32_t XORETIMECTRL_CLR;              /**< XORETIMECTRL                                       */
  __IM uint32_t  XORETIMESTATUS_CLR;            /**< XORETIMESTATUS                                     */
  __IOM uint32_t AGCOVERWRITE0_CLR;             /**< OVERWRITE AGC                                      */
  __IOM uint32_t AGCOVERWRITE1_CLR;             /**< OVERWRITE AGC                                      */
  uint32_t       RESERVED55[5U];                /**< Reserved for future use                            */
  __IOM uint32_t TXOGNDPKD_CLR;                 /**< TXOGNDPKD                                          */
  __IM uint32_t  TXOGNDPKDSTATUS_CLR;           /**< TXOGNDPKDSTATUS                                    */
  uint32_t       RESERVED56[4U];                /**< Reserved for future use                            */
  __IOM uint32_t GPPLLCLKRETIMECTRL_CLR;        /**< GPPLLCLKRETIMECTRL                                 */
  __IM uint32_t  GPPLLCLKRETIMESTATUS_CLR;      /**< GPPLLCLKRETIMESTATUS                               */
  uint32_t       RESERVED57[2U];                /**< Reserved for future use                            */
  __IOM uint32_t PATRIM6_CLR;                   /**< PATRIM6                                            */
  __IOM uint32_t PATRIM7_CLR;                   /**< PATRIM7                                            */
  __IOM uint32_t PATRIM8_CLR;                   /**< PATRIM8                                            */
  __IOM uint32_t PATRIM9_CLR;                   /**< PATRIM9                                            */
  __IOM uint32_t PATRIM10_CLR;                  /**< PATRIM10                                           */
  uint32_t       RESERVED58[1U];                /**< Reserved for future use                            */
  __IOM uint32_t TXRFPKD_CLR;                   /**< TXRFPKD                                            */
  uint32_t       RESERVED59[1U];                /**< Reserved for future use                            */
  __IM uint32_t  TXSTATUS_CLR;                  /**< TXSTATUS                                           */
  __IOM uint32_t TXOFDM_CLR;                    /**< TXOFDM                                             */
  uint32_t       RESERVED60[1U];                /**< Reserved for future use                            */
  __IOM uint32_t TXMIX_CLR;                     /**< TXMIX                                              */
  __IOM uint32_t TXITC_CLR;                     /**< TXITC                                              */
  __IOM uint32_t TXCALITC_CLR;                  /**< TXCALITC                                           */
  uint32_t       RESERVED61[57U];               /**< Reserved for future use                            */
  __IOM uint32_t TXPKDCTRL_CLR;                 /**< Control Register                                   */
  __IOM uint32_t TXPKDCMD_CLR;                  /**< CMD Register                                       */
  __IM uint32_t  TXPKDSTATUS_CLR;               /**< Status Register                                    */
  uint32_t       RESERVED62[49U];               /**< Reserved for future use                            */
  __IOM uint32_t RADIOCLKCTRL_CLR;              /**< New Register                                       */
  uint32_t       RESERVED63[3U];                /**< Reserved for future use                            */
  __IOM uint32_t SCRATCH0_CLR;                  /**< SCRATCH0                                           */
  __IOM uint32_t SCRATCH1_CLR;                  /**< SCRATCH1                                           */
  __IOM uint32_t SCRATCH2_CLR;                  /**< SCRATCH2                                           */
  __IOM uint32_t SCRATCH3_CLR;                  /**< SCRATCH3                                           */
  __IOM uint32_t SCRATCH4_CLR;                  /**< SCRATCH4                                           */
  __IOM uint32_t SCRATCH5_CLR;                  /**< SCRATCH5                                           */
  __IOM uint32_t SCRATCH6_CLR;                  /**< SCRATCH6                                           */
  __IOM uint32_t SCRATCH7_CLR;                  /**< SCRATCH7                                           */
  __IOM uint32_t SOFTMCTRL_CLR;                 /**< Soft Modem Control                                 */
  __IOM uint32_t SFMIF_CLR;                     /**< Soft Modem Interrupt Flags                         */
  __IOM uint32_t SFMIEN_CLR;                    /**< Soft Modem Interrupt Enables                       */
  uint32_t       RESERVED64[247U];              /**< Reserved for future use                            */
  __IOM uint32_t THMSW_CLR;                     /**< Thermister control                                 */
  uint32_t       RESERVED65[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED66[2U];                /**< Reserved for future use                            */
  uint32_t       RESERVED67[1U];                /**< Reserved for future use                            */
  uint32_t       RESERVED68[513U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version                                         */
  __IOM uint32_t EN_TGL;                        /**< Enable peripheral clock to this module             */
  __IOM uint32_t RXENSRCEN_TGL;                 /**< RXEN Source Enable                                 */
  __IM uint32_t  STATUS_TGL;                    /**< Radio State Machine Status                         */
  __IOM uint32_t CMD_TGL;                       /**< Radio Commands                                     */
  __IOM uint32_t CTRL_TGL;                      /**< Radio Control Register                             */
