SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC IFADCTRIM1 */
#define _RAC_IFADCTRIM1_RESETVALUE                                        0x00000123UL                                           /**< Default value for RAC_IFADCTRIM1            */
#define _RAC_IFADCTRIM1_MASK                                              0x00003FFFUL                                           /**< Mask for RAC_IFADCTRIM1                     */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_SHIFT                                 0                                                      /**< Shift value for RAC_IFADCVCMLVL             */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_MASK                                  0x7UL                                                  /**< Bit mask for RAC_IFADCVCMLVL                */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_DEFAULT                               0x00000003UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_475mV                             0x00000000UL                                           /**< Mode vcm_475mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_500mV                             0x00000001UL                                           /**< Mode vcm_500mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_525mV                             0x00000002UL                                           /**< Mode vcm_525mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_550mV                             0x00000003UL                                           /**< Mode vcm_550mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_575mV                             0x00000004UL                                           /**< Mode vcm_575mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_600mV                             0x00000005UL                                           /**< Mode vcm_600mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_vcm_625mV                             0x00000006UL                                           /**< Mode vcm_625mV for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCVCMLVL_cm_650mV                              0x00000007UL                                           /**< Mode cm_650mV for RAC_IFADCTRIM1            */
#define RAC_IFADCTRIM1_IFADCVCMLVL_DEFAULT                                (_RAC_IFADCTRIM1_IFADCVCMLVL_DEFAULT << 0)             /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_475mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_475mV << 0)           /**< Shifted mode vcm_475mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_500mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_500mV << 0)           /**< Shifted mode vcm_500mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_525mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_525mV << 0)           /**< Shifted mode vcm_525mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_550mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_550mV << 0)           /**< Shifted mode vcm_550mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_575mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_575mV << 0)           /**< Shifted mode vcm_575mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_600mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_600mV << 0)           /**< Shifted mode vcm_600mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_vcm_625mV                              (_RAC_IFADCTRIM1_IFADCVCMLVL_vcm_625mV << 0)           /**< Shifted mode vcm_625mV for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCVCMLVL_cm_650mV                               (_RAC_IFADCTRIM1_IFADCVCMLVL_cm_650mV << 0)            /**< Shifted mode cm_650mV for RAC_IFADCTRIM1    */
#define RAC_IFADCTRIM1_IFADCENNEGRES                                      (0x1UL << 3)                                           /**< IFADCENNEGRES                               */
#define _RAC_IFADCTRIM1_IFADCENNEGRES_SHIFT                               3                                                      /**< Shift value for RAC_IFADCENNEGRES           */
#define _RAC_IFADCTRIM1_IFADCENNEGRES_MASK                                0x8UL                                                  /**< Bit mask for RAC_IFADCENNEGRES              */
#define _RAC_IFADCTRIM1_IFADCENNEGRES_DEFAULT                             0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCENNEGRES_disable                             0x00000000UL                                           /**< Mode disable for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCENNEGRES_enable                              0x00000001UL                                           /**< Mode enable for RAC_IFADCTRIM1              */
#define RAC_IFADCTRIM1_IFADCENNEGRES_DEFAULT                              (_RAC_IFADCTRIM1_IFADCENNEGRES_DEFAULT << 3)           /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCENNEGRES_disable                              (_RAC_IFADCTRIM1_IFADCENNEGRES_disable << 3)           /**< Shifted mode disable for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCENNEGRES_enable                               (_RAC_IFADCTRIM1_IFADCENNEGRES_enable << 3)            /**< Shifted mode enable for RAC_IFADCTRIM1      */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_SHIFT                          4                                                      /**< Shift value for RAC_IFADCNEGRESCURRENT      */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_MASK                           0x70UL                                                 /**< Bit mask for RAC_IFADCNEGRESCURRENT         */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_DEFAULT                        0x00000002UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p0u                          0x00000000UL                                           /**< Mode i1p0u for RAC_IFADCTRIM1               */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p5u                          0x00000001UL                                           /**< Mode i1p5u for RAC_IFADCTRIM1               */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u                          0x00000002UL                                           /**< Mode i2p0u for RAC_IFADCTRIM1               */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u                          0x00000003UL                                           /**< Mode i2p5u for RAC_IFADCTRIM1               */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u2                         0x00000004UL                                           /**< Mode i2p0u2 for RAC_IFADCTRIM1              */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u2                         0x00000005UL                                           /**< Mode i2p5u2 for RAC_IFADCTRIM1              */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p0u                          0x00000006UL                                           /**< Mode i3p0u for RAC_IFADCTRIM1               */
#define _RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p5u                          0x00000007UL                                           /**< Mode i3p5u for RAC_IFADCTRIM1               */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_DEFAULT                         (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_DEFAULT << 4)      /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p0u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p0u << 4)        /**< Shifted mode i1p0u for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p5u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i1p5u << 4)        /**< Shifted mode i1p5u for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u << 4)        /**< Shifted mode i2p0u for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u << 4)        /**< Shifted mode i2p5u for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u2                          (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p0u2 << 4)       /**< Shifted mode i2p0u2 for RAC_IFADCTRIM1      */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u2                          (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i2p5u2 << 4)       /**< Shifted mode i2p5u2 for RAC_IFADCTRIM1      */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p0u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p0u << 4)        /**< Shifted mode i3p0u for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p5u                           (_RAC_IFADCTRIM1_IFADCNEGRESCURRENT_i3p5u << 4)        /**< Shifted mode i3p5u for RAC_IFADCTRIM1       */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_SHIFT                              7                                                      /**< Shift value for RAC_IFADCNEGRESVCM          */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_MASK                               0x180UL                                                /**< Bit mask for RAC_IFADCNEGRESVCM             */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_DEFAULT                            0x00000002UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA                        0x00000000UL                                           /**< Mode r210k_x_1uA for RAC_IFADCTRIM1         */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA2                       0x00000001UL                                           /**< Mode r210k_x_1uA2 for RAC_IFADCTRIM1        */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_r100k_x_2uA                        0x00000002UL                                           /**< Mode r100k_x_2uA for RAC_IFADCTRIM1         */
#define _RAC_IFADCTRIM1_IFADCNEGRESVCM_r50k_x_3uA                         0x00000003UL                                           /**< Mode r50k_x_3uA for RAC_IFADCTRIM1          */
#define RAC_IFADCTRIM1_IFADCNEGRESVCM_DEFAULT                             (_RAC_IFADCTRIM1_IFADCNEGRESVCM_DEFAULT << 7)          /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA                         (_RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA << 7)      /**< Shifted mode r210k_x_1uA for RAC_IFADCTRIM1 */
#define RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA2                        (_RAC_IFADCTRIM1_IFADCNEGRESVCM_r210k_x_1uA2 << 7)     /**< Shifted mode r210k_x_1uA2 for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCNEGRESVCM_r100k_x_2uA                         (_RAC_IFADCTRIM1_IFADCNEGRESVCM_r100k_x_2uA << 7)      /**< Shifted mode r100k_x_2uA for RAC_IFADCTRIM1 */
#define RAC_IFADCTRIM1_IFADCNEGRESVCM_r50k_x_3uA                          (_RAC_IFADCTRIM1_IFADCNEGRESVCM_r50k_x_3uA << 7)       /**< Shifted mode r50k_x_3uA for RAC_IFADCTRIM1  */
#define RAC_IFADCTRIM1_IFADCENSUBGMODE                                    (0x1UL << 9)                                           /**< IFADCENSUBGMODELV                           */
#define _RAC_IFADCTRIM1_IFADCENSUBGMODE_SHIFT                             9                                                      /**< Shift value for RAC_IFADCENSUBGMODE         */
#define _RAC_IFADCTRIM1_IFADCENSUBGMODE_MASK                              0x200UL                                                /**< Bit mask for RAC_IFADCENSUBGMODE            */
#define _RAC_IFADCTRIM1_IFADCENSUBGMODE_DEFAULT                           0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCENSUBGMODE_fullspeed_mode                    0x00000000UL                                           /**< Mode fullspeed_mode for RAC_IFADCTRIM1      */
#define _RAC_IFADCTRIM1_IFADCENSUBGMODE_subg_mode                         0x00000001UL                                           /**< Mode subg_mode for RAC_IFADCTRIM1           */
#define RAC_IFADCTRIM1_IFADCENSUBGMODE_DEFAULT                            (_RAC_IFADCTRIM1_IFADCENSUBGMODE_DEFAULT << 9)         /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCENSUBGMODE_fullspeed_mode                     (_RAC_IFADCTRIM1_IFADCENSUBGMODE_fullspeed_mode << 9)  /**< Shifted mode fullspeed_mode for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCENSUBGMODE_subg_mode                          (_RAC_IFADCTRIM1_IFADCENSUBGMODE_subg_mode << 9)       /**< Shifted mode subg_mode for RAC_IFADCTRIM1   */
#define _RAC_IFADCTRIM1_IFADCTZ_SHIFT                                     10                                                     /**< Shift value for RAC_IFADCTZ                 */
#define _RAC_IFADCTRIM1_IFADCTZ_MASK                                      0x1C00UL                                               /**< Bit mask for RAC_IFADCTZ                    */
#define _RAC_IFADCTRIM1_IFADCTZ_DEFAULT                                   0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCTZ_default_zero                              0x00000000UL                                           /**< Mode default_zero for RAC_IFADCTRIM1        */
#define _RAC_IFADCTRIM1_IFADCTZ_illegal_mode                              0x00000001UL                                           /**< Mode illegal_mode for RAC_IFADCTRIM1        */
#define _RAC_IFADCTRIM1_IFADCTZ_half_zero                                 0x00000002UL                                           /**< Mode half_zero for RAC_IFADCTRIM1           */
#define _RAC_IFADCTRIM1_IFADCTZ_illegal_mode2                             0x00000003UL                                           /**< Mode illegal_mode2 for RAC_IFADCTRIM1       */
#define _RAC_IFADCTRIM1_IFADCTZ_quarter_zero                              0x00000004UL                                           /**< Mode quarter_zero for RAC_IFADCTRIM1        */
#define _RAC_IFADCTRIM1_IFADCTZ_illegal_mode3                             0x00000005UL                                           /**< Mode illegal_mode3 for RAC_IFADCTRIM1       */
#define _RAC_IFADCTRIM1_IFADCTZ_illegal_mode4                             0x00000006UL                                           /**< Mode illegal_mode4 for RAC_IFADCTRIM1       */
#define _RAC_IFADCTRIM1_IFADCTZ_illegal_mode5                             0x00000007UL                                           /**< Mode illegal_mode5 for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCTZ_DEFAULT                                    (_RAC_IFADCTRIM1_IFADCTZ_DEFAULT << 10)                /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCTZ_default_zero                               (_RAC_IFADCTRIM1_IFADCTZ_default_zero << 10)           /**< Shifted mode default_zero for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_illegal_mode                               (_RAC_IFADCTRIM1_IFADCTZ_illegal_mode << 10)           /**< Shifted mode illegal_mode for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_half_zero                                  (_RAC_IFADCTRIM1_IFADCTZ_half_zero << 10)              /**< Shifted mode half_zero for RAC_IFADCTRIM1   */
#define RAC_IFADCTRIM1_IFADCTZ_illegal_mode2                              (_RAC_IFADCTRIM1_IFADCTZ_illegal_mode2 << 10)          /**< Shifted mode illegal_mode2 for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_quarter_zero                               (_RAC_IFADCTRIM1_IFADCTZ_quarter_zero << 10)           /**< Shifted mode quarter_zero for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_illegal_mode3                              (_RAC_IFADCTRIM1_IFADCTZ_illegal_mode3 << 10)          /**< Shifted mode illegal_mode3 for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_illegal_mode4                              (_RAC_IFADCTRIM1_IFADCTZ_illegal_mode4 << 10)          /**< Shifted mode illegal_mode4 for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCTZ_illegal_mode5                              (_RAC_IFADCTRIM1_IFADCTZ_illegal_mode5 << 10)          /**< Shifted mode illegal_mode5 for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCENXOBYPASS                                    (0x1UL << 13)                                          /**< IFADCENXOBYPASS                             */
#define _RAC_IFADCTRIM1_IFADCENXOBYPASS_SHIFT                             13                                                     /**< Shift value for RAC_IFADCENXOBYPASS         */
#define _RAC_IFADCTRIM1_IFADCENXOBYPASS_MASK                              0x2000UL                                               /**< Bit mask for RAC_IFADCENXOBYPASS            */
#define _RAC_IFADCTRIM1_IFADCENXOBYPASS_DEFAULT                           0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCTRIM1             */
#define _RAC_IFADCTRIM1_IFADCENXOBYPASS_disable_bypass                    0x00000000UL                                           /**< Mode disable_bypass for RAC_IFADCTRIM1      */
#define _RAC_IFADCTRIM1_IFADCENXOBYPASS_enable_bypass                     0x00000001UL                                           /**< Mode enable_bypass for RAC_IFADCTRIM1       */
#define RAC_IFADCTRIM1_IFADCENXOBYPASS_DEFAULT                            (_RAC_IFADCTRIM1_IFADCENXOBYPASS_DEFAULT << 13)        /**< Shifted mode DEFAULT for RAC_IFADCTRIM1     */
#define RAC_IFADCTRIM1_IFADCENXOBYPASS_disable_bypass                     (_RAC_IFADCTRIM1_IFADCENXOBYPASS_disable_bypass << 13) /**< Shifted mode disable_bypass for RAC_IFADCTRIM1*/
#define RAC_IFADCTRIM1_IFADCENXOBYPASS_enable_bypass                      (_RAC_IFADCTRIM1_IFADCENXOBYPASS_enable_bypass << 13)  /**< Shifted mode enable_bypass for RAC_IFADCTRIM1*/

/* Bit fields for RAC IFADCCAL */
#define _RAC_IFADCCAL_RESETVALUE                                          0x00000C00UL                                            /**< Default value for RAC_IFADCCAL              */
#define _RAC_IFADCCAL_MASK                                                0x00FF1F03UL                                            /**< Mask for RAC_IFADCCAL                       */
#define RAC_IFADCCAL_IFADCENRCCAL                                         (0x1UL << 0)                                            /**< IFADCENRCCAL                                */
#define _RAC_IFADCCAL_IFADCENRCCAL_SHIFT                                  0                                                       /**< Shift value for RAC_IFADCENRCCAL            */
#define _RAC_IFADCCAL_IFADCENRCCAL_MASK                                   0x1UL                                                   /**< Bit mask for RAC_IFADCENRCCAL               */
#define _RAC_IFADCCAL_IFADCENRCCAL_DEFAULT                                0x00000000UL                                            /**< Mode DEFAULT for RAC_IFADCCAL               */
#define _RAC_IFADCCAL_IFADCENRCCAL_rccal_disable                          0x00000000UL                                            /**< Mode rccal_disable for RAC_IFADCCAL         */
#define _RAC_IFADCCAL_IFADCENRCCAL_rccal_enable                           0x00000001UL                                            /**< Mode rccal_enable for RAC_IFADCCAL          */
#define RAC_IFADCCAL_IFADCENRCCAL_DEFAULT                                 (_RAC_IFADCCAL_IFADCENRCCAL_DEFAULT << 0)               /**< Shifted mode DEFAULT for RAC_IFADCCAL       */
#define RAC_IFADCCAL_IFADCENRCCAL_rccal_disable                           (_RAC_IFADCCAL_IFADCENRCCAL_rccal_disable << 0)         /**< Shifted mode rccal_disable for RAC_IFADCCAL */
#define RAC_IFADCCAL_IFADCENRCCAL_rccal_enable                            (_RAC_IFADCCAL_IFADCENRCCAL_rccal_enable << 0)          /**< Shifted mode rccal_enable for RAC_IFADCCAL  */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE                                   (0x1UL << 1)                                            /**< IFADCTUNERCCALMODE                          */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_SHIFT                            1                                                       /**< Shift value for RAC_IFADCTUNERCCALMODE      */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_MASK                             0x2UL                                                   /**< Bit mask for RAC_IFADCTUNERCCALMODE         */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT                          0x00000000UL                                            /**< Mode DEFAULT for RAC_IFADCCAL               */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode                           0x00000000UL                                            /**< Mode SYmode for RAC_IFADCCAL                */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode                          0x00000001UL                                            /**< Mode ADCmode for RAC_IFADCCAL               */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT                           (_RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_IFADCCAL       */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode                            (_RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode << 1)          /**< Shifted mode SYmode for RAC_IFADCCAL        */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode                           (_RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode << 1)         /**< Shifted mode ADCmode for RAC_IFADCCAL       */
#define _RAC_IFADCCAL_IFADCTUNERC_SHIFT                                   8                                                       /**< Shift value for RAC_IFADCTUNERC             */
#define _RAC_IFADCCAL_IFADCTUNERC_MASK                                    0x1F00UL                                                /**< Bit mask for RAC_IFADCTUNERC                */
#define _RAC_IFADCCAL_IFADCTUNERC_DEFAULT                                 0x0000000CUL                                            /**< Mode DEFAULT for RAC_IFADCCAL               */
#define RAC_IFADCCAL_IFADCTUNERC_DEFAULT                                  (_RAC_IFADCCAL_IFADCTUNERC_DEFAULT << 8)                /**< Shifted mode DEFAULT for RAC_IFADCCAL       */
#define _RAC_IFADCCAL_IFADCRCCALCOUNTERSTARTVAL_SHIFT                     16                                                      /**< Shift value for RAC_IFADCRCCALCOUNTERSTARTVAL*/
#define _RAC_IFADCCAL_IFADCRCCALCOUNTERSTARTVAL_MASK                      0xFF0000UL                                              /**< Bit mask for RAC_IFADCRCCALCOUNTERSTARTVAL  */
#define _RAC_IFADCCAL_IFADCRCCALCOUNTERSTARTVAL_DEFAULT                   0x00000000UL                                            /**< Mode DEFAULT for RAC_IFADCCAL               */
#define RAC_IFADCCAL_IFADCRCCALCOUNTERSTARTVAL_DEFAULT                    (_RAC_IFADCCAL_IFADCRCCALCOUNTERSTARTVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_IFADCCAL       */

