SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC LNAMIXTRIM4 */
#define _RAC_LNAMIXTRIM4_RESETVALUE                                       0x52082002UL                                                /**< Default value for RAC_LNAMIXTRIM4           */
#define _RAC_LNAMIXTRIM4_MASK                                             0xFF0FFF03UL                                                /**< Mask for RAC_LNAMIXTRIM4                    */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDBWSEL_SHIFT                           0                                                           /**< Shift value for RAC_LNAMIXRFPKDBWSEL        */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDBWSEL_MASK                            0x3UL                                                       /**< Bit mask for RAC_LNAMIXRFPKDBWSEL           */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDBWSEL_DEFAULT                         0x00000002UL                                                /**< Mode DEFAULT for RAC_LNAMIXTRIM4            */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDBWSEL_DEFAULT                          (_RAC_LNAMIXTRIM4_LNAMIXRFPKDBWSEL_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM4    */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMLO_SHIFT                         8                                                           /**< Shift value for RAC_LNAMIXRFPKDCALCMLO      */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMLO_MASK                          0x3F00UL                                                    /**< Bit mask for RAC_LNAMIXRFPKDCALCMLO         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMLO_DEFAULT                       0x00000020UL                                                /**< Mode DEFAULT for RAC_LNAMIXTRIM4            */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMLO_DEFAULT                        (_RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMLO_DEFAULT << 8)          /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM4    */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMHI_SHIFT                         14                                                          /**< Shift value for RAC_LNAMIXRFPKDCALCMHI      */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMHI_MASK                          0xFC000UL                                                   /**< Bit mask for RAC_LNAMIXRFPKDCALCMHI         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMHI_DEFAULT                       0x00000020UL                                                /**< Mode DEFAULT for RAC_LNAMIXTRIM4            */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMHI_DEFAULT                        (_RAC_LNAMIXTRIM4_LNAMIXRFPKDCALCMHI_DEFAULT << 14)         /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM4    */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_SHIFT                     24                                                          /**< Shift value for RAC_LNAMIXRFPKDTHRESHSELLO  */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_MASK                      0xF000000UL                                                 /**< Bit mask for RAC_LNAMIXRFPKDTHRESHSELLO     */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_DEFAULT                   0x00000002UL                                                /**< Mode DEFAULT for RAC_LNAMIXTRIM4            */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_0                  0x00000000UL                                                /**< Mode thresh_0 for RAC_LNAMIXTRIM4           */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_20m                0x00000001UL                                                /**< Mode thresh_20m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_30m                0x00000002UL                                                /**< Mode thresh_30m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_40m                0x00000003UL                                                /**< Mode thresh_40m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_50m                0x00000004UL                                                /**< Mode thresh_50m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_60m                0x00000005UL                                                /**< Mode thresh_60m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_70m                0x00000006UL                                                /**< Mode thresh_70m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_80m                0x00000007UL                                                /**< Mode thresh_80m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_90m                0x00000008UL                                                /**< Mode thresh_90m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_100m               0x00000009UL                                                /**< Mode thresh_100m for RAC_LNAMIXTRIM4        */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_DEFAULT                    (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_DEFAULT << 24)     /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM4    */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_0                   (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_0 << 24)    /**< Shifted mode thresh_0 for RAC_LNAMIXTRIM4   */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_20m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_20m << 24)  /**< Shifted mode thresh_20m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_30m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_30m << 24)  /**< Shifted mode thresh_30m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_40m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_40m << 24)  /**< Shifted mode thresh_40m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_50m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_50m << 24)  /**< Shifted mode thresh_50m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_60m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_60m << 24)  /**< Shifted mode thresh_60m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_70m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_70m << 24)  /**< Shifted mode thresh_70m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_80m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_80m << 24)  /**< Shifted mode thresh_80m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_90m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_90m << 24)  /**< Shifted mode thresh_90m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_100m                (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELLO_thresh_100m << 24) /**< Shifted mode thresh_100m for RAC_LNAMIXTRIM4*/
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_SHIFT                     28                                                          /**< Shift value for RAC_LNAMIXRFPKDTHRESHSELHI  */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_MASK                      0xF0000000UL                                                /**< Bit mask for RAC_LNAMIXRFPKDTHRESHSELHI     */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_DEFAULT                   0x00000005UL                                                /**< Mode DEFAULT for RAC_LNAMIXTRIM4            */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_0                  0x00000000UL                                                /**< Mode thresh_0 for RAC_LNAMIXTRIM4           */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_20m                0x00000001UL                                                /**< Mode thresh_20m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_30m                0x00000002UL                                                /**< Mode thresh_30m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_40m                0x00000003UL                                                /**< Mode thresh_40m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_50m                0x00000004UL                                                /**< Mode thresh_50m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_60m                0x00000005UL                                                /**< Mode thresh_60m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_70m                0x00000006UL                                                /**< Mode thresh_70m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_80m                0x00000007UL                                                /**< Mode thresh_80m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_90m                0x00000008UL                                                /**< Mode thresh_90m for RAC_LNAMIXTRIM4         */
#define _RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_100m               0x00000009UL                                                /**< Mode thresh_100m for RAC_LNAMIXTRIM4        */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_DEFAULT                    (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_DEFAULT << 28)     /**< Shifted mode DEFAULT for RAC_LNAMIXTRIM4    */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_0                   (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_0 << 28)    /**< Shifted mode thresh_0 for RAC_LNAMIXTRIM4   */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_20m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_20m << 28)  /**< Shifted mode thresh_20m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_30m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_30m << 28)  /**< Shifted mode thresh_30m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_40m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_40m << 28)  /**< Shifted mode thresh_40m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_50m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_50m << 28)  /**< Shifted mode thresh_50m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_60m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_60m << 28)  /**< Shifted mode thresh_60m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_70m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_70m << 28)  /**< Shifted mode thresh_70m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_80m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_80m << 28)  /**< Shifted mode thresh_80m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_90m                 (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_90m << 28)  /**< Shifted mode thresh_90m for RAC_LNAMIXTRIM4 */
#define RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_100m                (_RAC_LNAMIXTRIM4_LNAMIXRFPKDTHRESHSELHI_thresh_100m << 28) /**< Shifted mode thresh_100m for RAC_LNAMIXTRIM4*/

/* Bit fields for RAC LNAMIXCAL */
#define _RAC_LNAMIXCAL_RESETVALUE                                         0x000007E0UL                                      /**< Default value for RAC_LNAMIXCAL             */
#define _RAC_LNAMIXCAL_MASK                                               0x000007FFUL                                      /**< Mask for RAC_LNAMIXCAL                      */
#define RAC_LNAMIXCAL_LNAMIXCALPMOSEN                                     (0x1UL << 0)                                      /**< LNAMIXCALPMOSEN                             */
#define _RAC_LNAMIXCAL_LNAMIXCALPMOSEN_SHIFT                              0                                                 /**< Shift value for RAC_LNAMIXCALPMOSEN         */
#define _RAC_LNAMIXCAL_LNAMIXCALPMOSEN_MASK                               0x1UL                                             /**< Bit mask for RAC_LNAMIXCALPMOSEN            */
#define _RAC_LNAMIXCAL_LNAMIXCALPMOSEN_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_disable                        0x00000000UL                                      /**< Mode cal_disable for RAC_LNAMIXCAL          */
#define _RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_enable                         0x00000001UL                                      /**< Mode cal_enable for RAC_LNAMIXCAL           */
#define RAC_LNAMIXCAL_LNAMIXCALPMOSEN_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXCALPMOSEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_disable                         (_RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_disable << 0) /**< Shifted mode cal_disable for RAC_LNAMIXCAL  */
#define RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_enable                          (_RAC_LNAMIXCAL_LNAMIXCALPMOSEN_cal_enable << 0)  /**< Shifted mode cal_enable for RAC_LNAMIXCAL   */
#define RAC_LNAMIXCAL_LNAMIXCALNMOSEN                                     (0x1UL << 1)                                      /**< LNAMIXCALNMOSEN                             */
#define _RAC_LNAMIXCAL_LNAMIXCALNMOSEN_SHIFT                              1                                                 /**< Shift value for RAC_LNAMIXCALNMOSEN         */
#define _RAC_LNAMIXCAL_LNAMIXCALNMOSEN_MASK                               0x2UL                                             /**< Bit mask for RAC_LNAMIXCALNMOSEN            */
#define _RAC_LNAMIXCAL_LNAMIXCALNMOSEN_DEFAULT                            0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_disable                        0x00000000UL                                      /**< Mode cal_disable for RAC_LNAMIXCAL          */
#define _RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_enable                         0x00000001UL                                      /**< Mode cal_enable for RAC_LNAMIXCAL           */
#define RAC_LNAMIXCAL_LNAMIXCALNMOSEN_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXCALNMOSEN_DEFAULT << 1)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_disable                         (_RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_disable << 1) /**< Shifted mode cal_disable for RAC_LNAMIXCAL  */
#define RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_enable                          (_RAC_LNAMIXCAL_LNAMIXCALNMOSEN_cal_enable << 1)  /**< Shifted mode cal_enable for RAC_LNAMIXCAL   */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE                                      (0x1UL << 2)                                      /**< LNAMIXCALVMODE                              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_SHIFT                               2                                                 /**< Shift value for RAC_LNAMIXCALVMODE          */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_MASK                                0x4UL                                             /**< Bit mask for RAC_LNAMIXCALVMODE             */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                        0x00000000UL                                      /**< Mode current_mode for RAC_LNAMIXCAL         */
#define _RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                        0x00000001UL                                      /**< Mode voltage_mode for RAC_LNAMIXCAL         */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT                              (_RAC_LNAMIXCAL_LNAMIXCALVMODE_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode                         (_RAC_LNAMIXCAL_LNAMIXCALVMODE_current_mode << 2) /**< Shifted mode current_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode                         (_RAC_LNAMIXCAL_LNAMIXCALVMODE_voltage_mode << 2) /**< Shifted mode voltage_mode for RAC_LNAMIXCAL */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL0                                      (0x1UL << 3)                                      /**< LNAMIXENIRCAL0                              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL0_SHIFT                               3                                                 /**< Shift value for RAC_LNAMIXENIRCAL0          */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL0_MASK                                0x8UL                                             /**< Bit mask for RAC_LNAMIXENIRCAL0             */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL0_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL0_disable                             0x00000000UL                                      /**< Mode disable for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL0_enable                              0x00000001UL                                      /**< Mode enable for RAC_LNAMIXCAL               */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL0_DEFAULT                              (_RAC_LNAMIXCAL_LNAMIXENIRCAL0_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL0_disable                              (_RAC_LNAMIXCAL_LNAMIXENIRCAL0_disable << 3)      /**< Shifted mode disable for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL0_enable                               (_RAC_LNAMIXCAL_LNAMIXENIRCAL0_enable << 3)       /**< Shifted mode enable for RAC_LNAMIXCAL       */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1                                      (0x1UL << 4)                                      /**< LNAMIXENIRCAL1                              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_SHIFT                               4                                                 /**< Shift value for RAC_LNAMIXENIRCAL1          */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_MASK                                0x10UL                                            /**< Bit mask for RAC_LNAMIXENIRCAL1             */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable                             0x00000000UL                                      /**< Mode disable for RAC_LNAMIXCAL              */
#define _RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable                              0x00000001UL                                      /**< Mode enable for RAC_LNAMIXCAL               */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT                              (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_DEFAULT << 4)      /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable                              (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_disable << 4)      /**< Shifted mode disable for RAC_LNAMIXCAL      */
#define RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable                               (_RAC_LNAMIXCAL_LNAMIXENIRCAL1_enable << 4)       /**< Shifted mode enable for RAC_LNAMIXCAL       */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL0AMP_SHIFT                              5                                                 /**< Shift value for RAC_LNAMIXIRCAL0AMP         */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL0AMP_MASK                               0xE0UL                                            /**< Bit mask for RAC_LNAMIXIRCAL0AMP            */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL0AMP_DEFAULT                            0x00000007UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define RAC_LNAMIXCAL_LNAMIXIRCAL0AMP_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXIRCAL0AMP_DEFAULT << 5)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_SHIFT                              8                                                 /**< Shift value for RAC_LNAMIXIRCAL1AMP         */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_MASK                               0x700UL                                           /**< Bit mask for RAC_LNAMIXIRCAL1AMP            */
#define _RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT                            0x00000007UL                                      /**< Mode DEFAULT for RAC_LNAMIXCAL              */
#define RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT                             (_RAC_LNAMIXCAL_LNAMIXIRCAL1AMP_DEFAULT << 8)     /**< Shifted mode DEFAULT for RAC_LNAMIXCAL      */

