SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC PATRIM1 */
#define _RAC_PATRIM1_RESETVALUE                                           0x00234387UL                                       /**< Default value for RAC_PATRIM1               */
#define _RAC_PATRIM1_MASK                                                 0x00FFC78FUL                                       /**< Mask for RAC_PATRIM1                        */
#define _RAC_PATRIM1_TXTRIMXPAVNB_SHIFT                                   0                                                  /**< Shift value for RAC_TXTRIMXPAVNB            */
#define _RAC_PATRIM1_TXTRIMXPAVNB_MASK                                    0xFUL                                              /**< Bit mask for RAC_TXTRIMXPAVNB               */
#define _RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT                                 0x00000007UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p425                               0x00000000UL                                       /**< Mode ognd0p425 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p450                               0x00000001UL                                       /**< Mode ognd0p450 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p475                               0x00000002UL                                       /**< Mode ognd0p475 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p500                               0x00000003UL                                       /**< Mode ognd0p500 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p525                               0x00000004UL                                       /**< Mode ognd0p525 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p550                               0x00000005UL                                       /**< Mode ognd0p550 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p575                               0x00000006UL                                       /**< Mode ognd0p575 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p600                               0x00000007UL                                       /**< Mode ognd0p600 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p625                               0x00000008UL                                       /**< Mode ognd0p625 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p650                               0x00000009UL                                       /**< Mode ognd0p650 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p675                               0x0000000AUL                                       /**< Mode ognd0p675 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p700                               0x0000000BUL                                       /**< Mode ognd0p700 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p725                               0x0000000CUL                                       /**< Mode ognd0p725 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p750                               0x0000000DUL                                       /**< Mode ognd0p750 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p775                               0x0000000EUL                                       /**< Mode ognd0p775 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVNB_ognd0p800                               0x0000000FUL                                       /**< Mode ognd0p800 for RAC_PATRIM1              */
#define RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT                                  (_RAC_PATRIM1_TXTRIMXPAVNB_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p425                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p425 << 0)         /**< Shifted mode ognd0p425 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p450                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p450 << 0)         /**< Shifted mode ognd0p450 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p475                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p475 << 0)         /**< Shifted mode ognd0p475 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p500                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p500 << 0)         /**< Shifted mode ognd0p500 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p525                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p525 << 0)         /**< Shifted mode ognd0p525 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p550                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p550 << 0)         /**< Shifted mode ognd0p550 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p575                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p575 << 0)         /**< Shifted mode ognd0p575 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p600                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p600 << 0)         /**< Shifted mode ognd0p600 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p625                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p625 << 0)         /**< Shifted mode ognd0p625 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p650                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p650 << 0)         /**< Shifted mode ognd0p650 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p675                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p675 << 0)         /**< Shifted mode ognd0p675 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p700                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p700 << 0)         /**< Shifted mode ognd0p700 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p725                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p725 << 0)         /**< Shifted mode ognd0p725 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p750                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p750 << 0)         /**< Shifted mode ognd0p750 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p775                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p775 << 0)         /**< Shifted mode ognd0p775 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVNB_ognd0p800                                (_RAC_PATRIM1_TXTRIMXPAVNB_ognd0p800 << 0)         /**< Shifted mode ognd0p800 for RAC_PATRIM1      */
#define _RAC_PATRIM1_TXTRIMXPAVPB_SHIFT                                   7                                                  /**< Shift value for RAC_TXTRIMXPAVPB            */
#define _RAC_PATRIM1_TXTRIMXPAVPB_MASK                                    0x780UL                                            /**< Bit mask for RAC_TXTRIMXPAVPB               */
#define _RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT                                 0x00000007UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p425                               0x00000000UL                                       /**< Mode ovdd0p425 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p450                               0x00000001UL                                       /**< Mode ovdd0p450 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p475                               0x00000002UL                                       /**< Mode ovdd0p475 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p500                               0x00000003UL                                       /**< Mode ovdd0p500 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p525                               0x00000004UL                                       /**< Mode ovdd0p525 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p550                               0x00000005UL                                       /**< Mode ovdd0p550 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p575                               0x00000006UL                                       /**< Mode ovdd0p575 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p600                               0x00000007UL                                       /**< Mode ovdd0p600 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p625                               0x00000008UL                                       /**< Mode ovdd0p625 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p650                               0x00000009UL                                       /**< Mode ovdd0p650 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p675                               0x0000000AUL                                       /**< Mode ovdd0p675 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p700                               0x0000000BUL                                       /**< Mode ovdd0p700 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p725                               0x0000000CUL                                       /**< Mode ovdd0p725 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p750                               0x0000000DUL                                       /**< Mode ovdd0p750 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p775                               0x0000000EUL                                       /**< Mode ovdd0p775 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p800                               0x0000000FUL                                       /**< Mode ovdd0p800 for RAC_PATRIM1              */
#define RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT                                  (_RAC_PATRIM1_TXTRIMXPAVPB_DEFAULT << 7)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p425                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p425 << 7)         /**< Shifted mode ovdd0p425 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p450                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p450 << 7)         /**< Shifted mode ovdd0p450 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p475                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p475 << 7)         /**< Shifted mode ovdd0p475 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p500                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p500 << 7)         /**< Shifted mode ovdd0p500 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p525                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p525 << 7)         /**< Shifted mode ovdd0p525 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p550                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p550 << 7)         /**< Shifted mode ovdd0p550 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p575                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p575 << 7)         /**< Shifted mode ovdd0p575 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p600                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p600 << 7)         /**< Shifted mode ovdd0p600 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p625                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p625 << 7)         /**< Shifted mode ovdd0p625 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p650                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p650 << 7)         /**< Shifted mode ovdd0p650 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p675                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p675 << 7)         /**< Shifted mode ovdd0p675 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p700                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p700 << 7)         /**< Shifted mode ovdd0p700 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p725                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p725 << 7)         /**< Shifted mode ovdd0p725 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p750                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p750 << 7)         /**< Shifted mode ovdd0p750 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p775                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p775 << 7)         /**< Shifted mode ovdd0p775 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p800                                (_RAC_PATRIM1_TXTRIMXPAVPB_ovdd0p800 << 7)         /**< Shifted mode ovdd0p800 for RAC_PATRIM1      */
#define _RAC_PATRIM1_TXTRIMHPAVMID_SHIFT                                  14                                                 /**< Shift value for RAC_TXTRIMHPAVMID           */
#define _RAC_PATRIM1_TXTRIMHPAVMID_MASK                                   0xC000UL                                           /**< Bit mask for RAC_TXTRIMHPAVMID              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT                                0x00000001UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect0                              0x00000000UL                                       /**< Mode noeffect0 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect1                              0x00000001UL                                       /**< Mode noeffect1 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect2                              0x00000002UL                                       /**< Mode noeffect2 for RAC_PATRIM1              */
#define _RAC_PATRIM1_TXTRIMHPAVMID_noeffect3                              0x00000003UL                                       /**< Mode noeffect3 for RAC_PATRIM1              */
#define RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT                                 (_RAC_PATRIM1_TXTRIMHPAVMID_DEFAULT << 14)         /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect0                               (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect0 << 14)       /**< Shifted mode noeffect0 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect1                               (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect1 << 14)       /**< Shifted mode noeffect1 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect2                               (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect2 << 14)       /**< Shifted mode noeffect2 for RAC_PATRIM1      */
#define RAC_PATRIM1_TXTRIMHPAVMID_noeffect3                               (_RAC_PATRIM1_TXTRIMHPAVMID_noeffect3 << 14)       /**< Shifted mode noeffect3 for RAC_PATRIM1      */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_SHIFT                                 16                                                 /**< Shift value for RAC_TXTRIMHPAVNCAS          */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_MASK                                  0x70000UL                                          /**< Bit mask for RAC_TXTRIMHPAVNCAS             */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT                               0x00000003UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50                              0x00000000UL                                       /**< Mode ognd1p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55                              0x00000001UL                                       /**< Mode ognd1p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60                              0x00000002UL                                       /**< Mode ognd1p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65                              0x00000003UL                                       /**< Mode ognd1p65 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70                              0x00000004UL                                       /**< Mode ognd1p70 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75                              0x00000005UL                                       /**< Mode ognd1p75 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80                              0x00000006UL                                       /**< Mode ognd1p80 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85                              0x00000007UL                                       /**< Mode ognd1p85 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT                                (_RAC_PATRIM1_TXTRIMHPAVNCAS_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p50 << 16)       /**< Shifted mode ognd1p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p55 << 16)       /**< Shifted mode ognd1p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p60 << 16)       /**< Shifted mode ognd1p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p65 << 16)       /**< Shifted mode ognd1p65 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p70 << 16)       /**< Shifted mode ognd1p70 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p75 << 16)       /**< Shifted mode ognd1p75 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p80 << 16)       /**< Shifted mode ognd1p80 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85                               (_RAC_PATRIM1_TXTRIMHPAVNCAS_ognd1p85 << 16)       /**< Shifted mode ognd1p85 for RAC_PATRIM1       */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_SHIFT                                 19                                                 /**< Shift value for RAC_TXTRIMHPAVPCAS          */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_MASK                                  0x380000UL                                         /**< Bit mask for RAC_TXTRIMHPAVPCAS             */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT                               0x00000004UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30                              0x00000000UL                                       /**< Mode ovdd1p30 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35                              0x00000001UL                                       /**< Mode ovdd1p35 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40                              0x00000002UL                                       /**< Mode ovdd1p40 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45                              0x00000003UL                                       /**< Mode ovdd1p45 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50                              0x00000004UL                                       /**< Mode ovdd1p50 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55                              0x00000005UL                                       /**< Mode ovdd1p55 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60                              0x00000006UL                                       /**< Mode ovdd1p60 for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65                              0x00000007UL                                       /**< Mode ovdd1p65 for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT                                (_RAC_PATRIM1_TXTRIMHPAVPCAS_DEFAULT << 19)        /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p30 << 19)       /**< Shifted mode ovdd1p30 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p35 << 19)       /**< Shifted mode ovdd1p35 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p40 << 19)       /**< Shifted mode ovdd1p40 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p45 << 19)       /**< Shifted mode ovdd1p45 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p50 << 19)       /**< Shifted mode ovdd1p50 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p55 << 19)       /**< Shifted mode ovdd1p55 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p60 << 19)       /**< Shifted mode ovdd1p60 for RAC_PATRIM1       */
#define RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65                               (_RAC_PATRIM1_TXTRIMHPAVPCAS_ovdd1p65 << 19)       /**< Shifted mode ovdd1p65 for RAC_PATRIM1       */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_SHIFT                           22                                                 /**< Shift value for RAC_TXTRIMHPAVMIDCURRENT    */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_MASK                            0xC00000UL                                         /**< Bit mask for RAC_TXTRIMHPAVMIDCURRENT       */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_0p75mA                        0x00000000UL                                       /**< Mode I_0p75mA for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_1p50mA                        0x00000001UL                                       /**< Mode I_1p50mA for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_2p25mA                        0x00000002UL                                       /**< Mode I_2p25mA for RAC_PATRIM1               */
#define _RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_3p00mA                        0x00000003UL                                       /**< Mode I_3p00mA for RAC_PATRIM1               */
#define RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_DEFAULT                          (_RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_DEFAULT << 22)  /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_0p75mA                         (_RAC_PATRIM1_TXTRIMHPAVMIDCURRENT_I_0p75mA << 22) /**< Shifted mode I_0p75mA for RAC_PATRIM1       */
