SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXPOWER */
#define _RAC_TXPOWER_RESETVALUE                                           0x007FE000UL                                /**< Default value for RAC_TXPOWER               */
#define _RAC_TXPOWER_MASK                                                 0x007FEEFFUL                                /**< Mask for RAC_TXPOWER                        */
#define _RAC_TXPOWER_TXSTRIPE_SHIFT                                       0                                           /**< Shift value for RAC_TXSTRIPE                */
#define _RAC_TXPOWER_TXSTRIPE_MASK                                        0x1FUL                                      /**< Bit mask for RAC_TXSTRIPE                   */
#define _RAC_TXPOWER_TXSTRIPE_DEFAULT                                     0x00000000UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TXSTRIPE_tbd_0                                       0x00000000UL                                /**< Mode tbd_0 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_1                                       0x00000001UL                                /**< Mode tbd_1 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_2                                       0x00000002UL                                /**< Mode tbd_2 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_3                                       0x00000003UL                                /**< Mode tbd_3 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_4                                       0x00000004UL                                /**< Mode tbd_4 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_5                                       0x00000005UL                                /**< Mode tbd_5 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_6                                       0x00000006UL                                /**< Mode tbd_6 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_7                                       0x00000007UL                                /**< Mode tbd_7 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_8                                       0x00000008UL                                /**< Mode tbd_8 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_9                                       0x00000009UL                                /**< Mode tbd_9 for RAC_TXPOWER                  */
#define _RAC_TXPOWER_TXSTRIPE_tbd_10                                      0x0000000AUL                                /**< Mode tbd_10 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_11                                      0x0000000BUL                                /**< Mode tbd_11 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_12                                      0x0000000CUL                                /**< Mode tbd_12 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_13                                      0x0000000DUL                                /**< Mode tbd_13 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_14                                      0x0000000EUL                                /**< Mode tbd_14 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_15                                      0x0000000FUL                                /**< Mode tbd_15 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_16                                      0x00000010UL                                /**< Mode tbd_16 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_17                                      0x00000011UL                                /**< Mode tbd_17 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_18                                      0x00000012UL                                /**< Mode tbd_18 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_19                                      0x00000013UL                                /**< Mode tbd_19 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_20                                      0x00000014UL                                /**< Mode tbd_20 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_21                                      0x00000015UL                                /**< Mode tbd_21 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_22                                      0x00000016UL                                /**< Mode tbd_22 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_23                                      0x00000017UL                                /**< Mode tbd_23 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_24                                      0x00000018UL                                /**< Mode tbd_24 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_25                                      0x00000019UL                                /**< Mode tbd_25 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_26                                      0x0000001AUL                                /**< Mode tbd_26 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_27                                      0x0000001BUL                                /**< Mode tbd_27 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_28                                      0x0000001CUL                                /**< Mode tbd_28 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_29                                      0x0000001DUL                                /**< Mode tbd_29 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_30                                      0x0000001EUL                                /**< Mode tbd_30 for RAC_TXPOWER                 */
#define _RAC_TXPOWER_TXSTRIPE_tbd_31                                      0x0000001FUL                                /**< Mode tbd_31 for RAC_TXPOWER                 */
#define RAC_TXPOWER_TXSTRIPE_DEFAULT                                      (_RAC_TXPOWER_TXSTRIPE_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TXSTRIPE_tbd_0                                        (_RAC_TXPOWER_TXSTRIPE_tbd_0 << 0)          /**< Shifted mode tbd_0 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_1                                        (_RAC_TXPOWER_TXSTRIPE_tbd_1 << 0)          /**< Shifted mode tbd_1 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_2                                        (_RAC_TXPOWER_TXSTRIPE_tbd_2 << 0)          /**< Shifted mode tbd_2 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_3                                        (_RAC_TXPOWER_TXSTRIPE_tbd_3 << 0)          /**< Shifted mode tbd_3 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_4                                        (_RAC_TXPOWER_TXSTRIPE_tbd_4 << 0)          /**< Shifted mode tbd_4 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_5                                        (_RAC_TXPOWER_TXSTRIPE_tbd_5 << 0)          /**< Shifted mode tbd_5 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_6                                        (_RAC_TXPOWER_TXSTRIPE_tbd_6 << 0)          /**< Shifted mode tbd_6 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_7                                        (_RAC_TXPOWER_TXSTRIPE_tbd_7 << 0)          /**< Shifted mode tbd_7 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_8                                        (_RAC_TXPOWER_TXSTRIPE_tbd_8 << 0)          /**< Shifted mode tbd_8 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_9                                        (_RAC_TXPOWER_TXSTRIPE_tbd_9 << 0)          /**< Shifted mode tbd_9 for RAC_TXPOWER          */
#define RAC_TXPOWER_TXSTRIPE_tbd_10                                       (_RAC_TXPOWER_TXSTRIPE_tbd_10 << 0)         /**< Shifted mode tbd_10 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_11                                       (_RAC_TXPOWER_TXSTRIPE_tbd_11 << 0)         /**< Shifted mode tbd_11 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_12                                       (_RAC_TXPOWER_TXSTRIPE_tbd_12 << 0)         /**< Shifted mode tbd_12 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_13                                       (_RAC_TXPOWER_TXSTRIPE_tbd_13 << 0)         /**< Shifted mode tbd_13 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_14                                       (_RAC_TXPOWER_TXSTRIPE_tbd_14 << 0)         /**< Shifted mode tbd_14 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_15                                       (_RAC_TXPOWER_TXSTRIPE_tbd_15 << 0)         /**< Shifted mode tbd_15 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_16                                       (_RAC_TXPOWER_TXSTRIPE_tbd_16 << 0)         /**< Shifted mode tbd_16 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_17                                       (_RAC_TXPOWER_TXSTRIPE_tbd_17 << 0)         /**< Shifted mode tbd_17 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_18                                       (_RAC_TXPOWER_TXSTRIPE_tbd_18 << 0)         /**< Shifted mode tbd_18 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_19                                       (_RAC_TXPOWER_TXSTRIPE_tbd_19 << 0)         /**< Shifted mode tbd_19 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_20                                       (_RAC_TXPOWER_TXSTRIPE_tbd_20 << 0)         /**< Shifted mode tbd_20 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_21                                       (_RAC_TXPOWER_TXSTRIPE_tbd_21 << 0)         /**< Shifted mode tbd_21 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_22                                       (_RAC_TXPOWER_TXSTRIPE_tbd_22 << 0)         /**< Shifted mode tbd_22 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_23                                       (_RAC_TXPOWER_TXSTRIPE_tbd_23 << 0)         /**< Shifted mode tbd_23 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_24                                       (_RAC_TXPOWER_TXSTRIPE_tbd_24 << 0)         /**< Shifted mode tbd_24 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_25                                       (_RAC_TXPOWER_TXSTRIPE_tbd_25 << 0)         /**< Shifted mode tbd_25 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_26                                       (_RAC_TXPOWER_TXSTRIPE_tbd_26 << 0)         /**< Shifted mode tbd_26 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_27                                       (_RAC_TXPOWER_TXSTRIPE_tbd_27 << 0)         /**< Shifted mode tbd_27 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_28                                       (_RAC_TXPOWER_TXSTRIPE_tbd_28 << 0)         /**< Shifted mode tbd_28 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_29                                       (_RAC_TXPOWER_TXSTRIPE_tbd_29 << 0)         /**< Shifted mode tbd_29 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_30                                       (_RAC_TXPOWER_TXSTRIPE_tbd_30 << 0)         /**< Shifted mode tbd_30 for RAC_TXPOWER         */
#define RAC_TXPOWER_TXSTRIPE_tbd_31                                       (_RAC_TXPOWER_TXSTRIPE_tbd_31 << 0)         /**< Shifted mode tbd_31 for RAC_TXPOWER         */
#define _RAC_TXPOWER_TXSLICE_SHIFT                                        5                                           /**< Shift value for RAC_TXSLICE                 */
#define _RAC_TXPOWER_TXSLICE_MASK                                         0xE0UL                                      /**< Bit mask for RAC_TXSLICE                    */
#define _RAC_TXPOWER_TXSLICE_DEFAULT                                      0x00000000UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TXSLICE_on_0_slice                                   0x00000000UL                                /**< Mode on_0_slice for RAC_TXPOWER             */
#define _RAC_TXPOWER_TXSLICE_on_1_slices                                  0x00000001UL                                /**< Mode on_1_slices for RAC_TXPOWER            */
#define _RAC_TXPOWER_TXSLICE_on_2_slices                                  0x00000002UL                                /**< Mode on_2_slices for RAC_TXPOWER            */
#define _RAC_TXPOWER_TXSLICE_NA                                           0x00000003UL                                /**< Mode NA for RAC_TXPOWER                     */
#define RAC_TXPOWER_TXSLICE_DEFAULT                                       (_RAC_TXPOWER_TXSLICE_DEFAULT << 5)         /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TXSLICE_on_0_slice                                    (_RAC_TXPOWER_TXSLICE_on_0_slice << 5)      /**< Shifted mode on_0_slice for RAC_TXPOWER     */
#define RAC_TXPOWER_TXSLICE_on_1_slices                                   (_RAC_TXPOWER_TXSLICE_on_1_slices << 5)     /**< Shifted mode on_1_slices for RAC_TXPOWER    */
#define RAC_TXPOWER_TXSLICE_on_2_slices                                   (_RAC_TXPOWER_TXSLICE_on_2_slices << 5)     /**< Shifted mode on_2_slices for RAC_TXPOWER    */
#define RAC_TXPOWER_TXSLICE_NA                                            (_RAC_TXPOWER_TXSLICE_NA << 5)              /**< Shifted mode NA for RAC_TXPOWER             */
#define _RAC_TXPOWER_TXDRVSLICE_SHIFT                                     9                                           /**< Shift value for RAC_TXDRVSLICE              */
#define _RAC_TXPOWER_TXDRVSLICE_MASK                                      0xE00UL                                     /**< Bit mask for RAC_TXDRVSLICE                 */
#define _RAC_TXPOWER_TXDRVSLICE_DEFAULT                                   0x00000000UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXDRVSLICE_DEFAULT                                    (_RAC_TXPOWER_TXDRVSLICE_DEFAULT << 9)      /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define _RAC_TXPOWER_TXANARAMPODEV_SHIFT                                  13                                          /**< Shift value for RAC_TXANARAMPODEV           */
#define _RAC_TXPOWER_TXANARAMPODEV_MASK                                   0x3E000UL                                   /**< Bit mask for RAC_TXANARAMPODEV              */
#define _RAC_TXPOWER_TXANARAMPODEV_DEFAULT                                0x0000001FUL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXANARAMPODEV_DEFAULT                                 (_RAC_TXPOWER_TXANARAMPODEV_DEFAULT << 13)  /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define _RAC_TXPOWER_TXANARAMPDRVFF_SHIFT                                 18                                          /**< Shift value for RAC_TXANARAMPDRVFF          */
#define _RAC_TXPOWER_TXANARAMPDRVFF_MASK                                  0x7C0000UL                                  /**< Bit mask for RAC_TXANARAMPDRVFF             */
#define _RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT                               0x0000001FUL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT                                (_RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT << 18) /**< Shifted mode DEFAULT for RAC_TXPOWER        */

