SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXRAMP */
#define _RAC_TXRAMP_RESETVALUE                                            0x0000003FUL                                         /**< Default value for RAC_TXRAMP                */
#define _RAC_TXRAMP_MASK                                                  0x000C0FFFUL                                         /**< Mask for RAC_TXRAMP                         */
#define _RAC_TXRAMP_TXANARAMPDRVBW_SHIFT                                  0                                                    /**< Shift value for RAC_TXANARAMPDRVBW          */
#define _RAC_TXRAMP_TXANARAMPDRVBW_MASK                                   0x3UL                                                /**< Bit mask for RAC_TXANARAMPDRVBW             */
#define _RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT                                0x00000003UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k                       0x00000000UL                                         /**< Mode drv_ramp_bw_500k for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg                       0x00000001UL                                         /**< Mode drv_ramp_bw_1meg for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg                       0x00000002UL                                         /**< Mode drv_ramp_bw_2meg for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg                       0x00000003UL                                         /**< Mode drv_ramp_bw_4meg for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT                                 (_RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k                        (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k << 0)   /**< Shifted mode drv_ramp_bw_500k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg                        (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg << 0)   /**< Shifted mode drv_ramp_bw_1meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg                        (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg << 0)   /**< Shifted mode drv_ramp_bw_2meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg                        (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg << 0)   /**< Shifted mode drv_ramp_bw_4meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVEN                                         (0x1UL << 2)                                         /**< TXANARAMPDRVEN                              */
#define _RAC_TXRAMP_TXANARAMPDRVEN_SHIFT                                  2                                                    /**< Shift value for RAC_TXANARAMPDRVEN          */
#define _RAC_TXRAMP_TXANARAMPDRVEN_MASK                                   0x4UL                                                /**< Bit mask for RAC_TXANARAMPDRVEN             */
#define _RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT                                0x00000001UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off                       0x00000000UL                                         /**< Mode ana_ramp_drv_off for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on                       0x00000001UL                                         /**< Mode tana_ramp_drv_on for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT                                 (_RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT << 2)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off                        (_RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off << 2)   /**< Shifted mode ana_ramp_drv_off for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on                        (_RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on << 2)   /**< Shifted mode tana_ramp_drv_on for RAC_TXRAMP*/
#define _RAC_TXRAMP_TXANARAMPODEVBW_SHIFT                                 3                                                    /**< Shift value for RAC_TXANARAMPODEVBW         */
#define _RAC_TXRAMP_TXANARAMPODEVBW_MASK                                  0x18UL                                               /**< Bit mask for RAC_TXANARAMPODEVBW            */
#define _RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT                               0x00000003UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k                     0x00000000UL                                         /**< Mode odev_ramp_res105k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k                     0x00000001UL                                         /**< Mode odev_ramp_res035k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k                     0x00000002UL                                         /**< Mode odev_ramp_res015k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k                     0x00000003UL                                         /**< Mode odev_ramp_res005k for RAC_TXRAMP       */
#define RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT                                (_RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT << 3)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k                      (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k << 3) /**< Shifted mode odev_ramp_res105k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k                      (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k << 3) /**< Shifted mode odev_ramp_res035k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k                      (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k << 3) /**< Shifted mode odev_ramp_res015k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k                      (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k << 3) /**< Shifted mode odev_ramp_res005k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVEN                                        (0x1UL << 5)                                         /**< TXANARAMPODEVEN                             */
#define _RAC_TXRAMP_TXANARAMPODEVEN_SHIFT                                 5                                                    /**< Shift value for RAC_TXANARAMPODEVEN         */
#define _RAC_TXRAMP_TXANARAMPODEVEN_MASK                                  0x20UL                                               /**< Bit mask for RAC_TXANARAMPODEVEN            */
#define _RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT                               0x00000001UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off                     0x00000000UL                                         /**< Mode ana_ramp_odev_off for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on                      0x00000001UL                                         /**< Mode ana_ramp_odev_on for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT                                (_RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off                      (_RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off << 5) /**< Shifted mode ana_ramp_odev_off for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on                       (_RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on << 5)  /**< Shifted mode ana_ramp_odev_on for RAC_TXRAMP*/
#define RAC_TXRAMP_TXBYPASSRAMPCLK                                        (0x1UL << 6)                                         /**< TXBYPASSRAMPCLK                             */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_SHIFT                                 6                                                    /**< Shift value for RAC_TXBYPASSRAMPCLK         */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_MASK                                  0x40UL                                               /**< Bit mask for RAC_TXBYPASSRAMPCLK            */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT                               0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk                          0x00000000UL                                         /**< Mode use_ramp_clk for RAC_TXRAMP            */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk                       0x00000001UL                                         /**< Mode bypass_ramp_clk for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT                                (_RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT << 6)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk                           (_RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk << 6)      /**< Shifted mode use_ramp_clk for RAC_TXRAMP    */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk                        (_RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk << 6)   /**< Shifted mode bypass_ramp_clk for RAC_TXRAMP */
#define RAC_TXRAMP_TXMODEPHASEFLIP                                        (0x1UL << 7)                                         /**< TXMODEPHASEFLIP                             */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_SHIFT                                 7                                                    /**< Shift value for RAC_TXMODEPHASEFLIP         */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_MASK                                  0x80UL                                               /**< Bit mask for RAC_TXMODEPHASEFLIP            */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT                               0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_disable                               0x00000000UL                                         /**< Mode disable for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_enable                                0x00000001UL                                         /**< Mode enable for RAC_TXRAMP                  */
#define RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT                                (_RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT << 7)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXMODEPHASEFLIP_disable                                (_RAC_TXRAMP_TXMODEPHASEFLIP_disable << 7)           /**< Shifted mode disable for RAC_TXRAMP         */
#define RAC_TXRAMP_TXMODEPHASEFLIP_enable                                 (_RAC_TXRAMP_TXMODEPHASEFLIP_enable << 7)            /**< Shifted mode enable for RAC_TXRAMP          */
#define RAC_TXRAMP_TXPHASEDIGITAL                                         (0x1UL << 8)                                         /**< TXPHASEDIGITAL                              */
#define _RAC_TXRAMP_TXPHASEDIGITAL_SHIFT                                  8                                                    /**< Shift value for RAC_TXPHASEDIGITAL          */
#define _RAC_TXRAMP_TXPHASEDIGITAL_MASK                                   0x100UL                                              /**< Bit mask for RAC_TXPHASEDIGITAL             */
#define _RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT                                0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXPHASEDIGITAL_phase0                                 0x00000000UL                                         /**< Mode phase0 for RAC_TXRAMP                  */
#define _RAC_TXRAMP_TXPHASEDIGITAL_phase180                               0x00000001UL                                         /**< Mode phase180 for RAC_TXRAMP                */
#define RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT                                 (_RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXPHASEDIGITAL_phase0                                  (_RAC_TXRAMP_TXPHASEDIGITAL_phase0 << 8)             /**< Shifted mode phase0 for RAC_TXRAMP          */
#define RAC_TXRAMP_TXPHASEDIGITAL_phase180                                (_RAC_TXRAMP_TXPHASEDIGITAL_phase180 << 8)           /**< Shifted mode phase180 for RAC_TXRAMP        */
#define RAC_TXRAMP_TXRESETPAPOWER                                         (0x1UL << 9)                                         /**< TXRESETPAPOWER                              */
#define _RAC_TXRAMP_TXRESETPAPOWER_SHIFT                                  9                                                    /**< Shift value for RAC_TXRESETPAPOWER          */
#define _RAC_TXRAMP_TXRESETPAPOWER_MASK                                   0x200UL                                              /**< Bit mask for RAC_TXRESETPAPOWER             */
#define _RAC_TXRAMP_TXRESETPAPOWER_DEFAULT                                0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXRESETPAPOWER_no_reset                               0x00000000UL                                         /**< Mode no_reset for RAC_TXRAMP                */
#define _RAC_TXRAMP_TXRESETPAPOWER_reset                                  0x00000001UL                                         /**< Mode reset for RAC_TXRAMP                   */
#define RAC_TXRAMP_TXRESETPAPOWER_DEFAULT                                 (_RAC_TXRAMP_TXRESETPAPOWER_DEFAULT << 9)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXRESETPAPOWER_no_reset                                (_RAC_TXRAMP_TXRESETPAPOWER_no_reset << 9)           /**< Shifted mode no_reset for RAC_TXRAMP        */
#define RAC_TXRAMP_TXRESETPAPOWER_reset                                   (_RAC_TXRAMP_TXRESETPAPOWER_reset << 9)              /**< Shifted mode reset for RAC_TXRAMP           */
#define RAC_TXRAMP_TXUNMUTEENDRVFF                                        (0x1UL << 10)                                        /**< TXUNMUTEENDRVFF                             */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_SHIFT                                 10                                                   /**< Shift value for RAC_TXUNMUTEENDRVFF         */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_MASK                                  0x400UL                                              /**< Bit mask for RAC_TXUNMUTEENDRVFF            */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT                               0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off                            0x00000000UL                                         /**< Mode driver_off for RAC_TXRAMP              */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on                             0x00000001UL                                         /**< Mode driver_on for RAC_TXRAMP               */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT                                (_RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT << 10)          /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off                             (_RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off << 10)       /**< Shifted mode driver_off for RAC_TXRAMP      */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on                              (_RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on << 10)        /**< Shifted mode driver_on for RAC_TXRAMP       */
#define RAC_TXRAMP_TXBYPASSBBDIGREG                                       (0x1UL << 11)                                        /**< TXBYPASSBBDIGREG                            */
#define _RAC_TXRAMP_TXBYPASSBBDIGREG_SHIFT                                11                                                   /**< Shift value for RAC_TXBYPASSBBDIGREG        */
#define _RAC_TXRAMP_TXBYPASSBBDIGREG_MASK                                 0x800UL                                              /**< Bit mask for RAC_TXBYPASSBBDIGREG           */
#define _RAC_TXRAMP_TXBYPASSBBDIGREG_DEFAULT                              0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXBYPASSBBDIGREG_disabled                             0x00000000UL                                         /**< Mode disabled for RAC_TXRAMP                */
#define _RAC_TXRAMP_TXBYPASSBBDIGREG_enabled                              0x00000001UL                                         /**< Mode enabled for RAC_TXRAMP                 */
#define RAC_TXRAMP_TXBYPASSBBDIGREG_DEFAULT                               (_RAC_TXRAMP_TXBYPASSBBDIGREG_DEFAULT << 11)         /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSBBDIGREG_disabled                              (_RAC_TXRAMP_TXBYPASSBBDIGREG_disabled << 11)        /**< Shifted mode disabled for RAC_TXRAMP        */
#define RAC_TXRAMP_TXBYPASSBBDIGREG_enabled                               (_RAC_TXRAMP_TXBYPASSBBDIGREG_enabled << 11)         /**< Shifted mode enabled for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSBUFREG                                         (0x1UL << 18)                                        /**< TXBYPASSBUFREG                              */
#define _RAC_TXRAMP_TXBYPASSBUFREG_SHIFT                                  18                                                   /**< Shift value for RAC_TXBYPASSBUFREG          */
#define _RAC_TXRAMP_TXBYPASSBUFREG_MASK                                   0x40000UL                                            /**< Bit mask for RAC_TXBYPASSBUFREG             */
#define _RAC_TXRAMP_TXBYPASSBUFREG_DEFAULT                                0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXBYPASSBUFREG_not_bypass                             0x00000000UL                                         /**< Mode not_bypass for RAC_TXRAMP              */
#define _RAC_TXRAMP_TXBYPASSBUFREG_bypass                                 0x00000001UL                                         /**< Mode bypass for RAC_TXRAMP                  */
#define RAC_TXRAMP_TXBYPASSBUFREG_DEFAULT                                 (_RAC_TXRAMP_TXBYPASSBUFREG_DEFAULT << 18)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSBUFREG_not_bypass                              (_RAC_TXRAMP_TXBYPASSBUFREG_not_bypass << 18)        /**< Shifted mode not_bypass for RAC_TXRAMP      */
#define RAC_TXRAMP_TXBYPASSBUFREG_bypass                                  (_RAC_TXRAMP_TXBYPASSBUFREG_bypass << 18)            /**< Shifted mode bypass for RAC_TXRAMP          */
#define RAC_TXRAMP_TXSTARTUPITCCORE                                       (0x1UL << 19)                                        /**< TXSTARTUPITCCORE                            */
#define _RAC_TXRAMP_TXSTARTUPITCCORE_SHIFT                                19                                                   /**< Shift value for RAC_TXSTARTUPITCCORE        */
#define _RAC_TXRAMP_TXSTARTUPITCCORE_MASK                                 0x80000UL                                            /**< Bit mask for RAC_TXSTARTUPITCCORE           */
#define _RAC_TXRAMP_TXSTARTUPITCCORE_DEFAULT                              0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXSTARTUPITCCORE_disabled                             0x00000000UL                                         /**< Mode disabled for RAC_TXRAMP                */
#define _RAC_TXRAMP_TXSTARTUPITCCORE_enabled                              0x00000001UL                                         /**< Mode enabled for RAC_TXRAMP                 */
#define RAC_TXRAMP_TXSTARTUPITCCORE_DEFAULT                               (_RAC_TXRAMP_TXSTARTUPITCCORE_DEFAULT << 19)         /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXSTARTUPITCCORE_disabled                              (_RAC_TXRAMP_TXSTARTUPITCCORE_disabled << 19)        /**< Shifted mode disabled for RAC_TXRAMP        */
#define RAC_TXRAMP_TXSTARTUPITCCORE_enabled                               (_RAC_TXRAMP_TXSTARTUPITCCORE_enabled << 19)         /**< Shifted mode enabled for RAC_TXRAMP         */

