SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC PGATRIM */
#define _RAC_PGATRIM_RESETVALUE                                           0x00000A87UL                                   /**< Default value for RAC_PGATRIM               */
#define _RAC_PGATRIM_MASK                                                 0x00000FDFUL                                   /**< Mask for RAC_PGATRIM                        */
#define _RAC_PGATRIM_PGACTUNE_SHIFT                                       0                                              /**< Shift value for RAC_PGACTUNE                */
#define _RAC_PGATRIM_PGACTUNE_MASK                                        0x1FUL                                         /**< Bit mask for RAC_PGACTUNE                   */
#define _RAC_PGATRIM_PGACTUNE_DEFAULT                                     0x00000007UL                                   /**< Mode DEFAULT for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGACTUNE_cfb_0p7                                     0x00000000UL                                   /**< Mode cfb_0p7 for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGACTUNE_cfb_nominal                                 0x00000007UL                                   /**< Mode cfb_nominal for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGACTUNE_cfb_1p32                                    0x0000000FUL                                   /**< Mode cfb_1p32 for RAC_PGATRIM               */
#define RAC_PGATRIM_PGACTUNE_DEFAULT                                      (_RAC_PGATRIM_PGACTUNE_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define RAC_PGATRIM_PGACTUNE_cfb_0p7                                      (_RAC_PGATRIM_PGACTUNE_cfb_0p7 << 0)           /**< Shifted mode cfb_0p7 for RAC_PGATRIM        */
#define RAC_PGATRIM_PGACTUNE_cfb_nominal                                  (_RAC_PGATRIM_PGACTUNE_cfb_nominal << 0)       /**< Shifted mode cfb_nominal for RAC_PGATRIM    */
#define RAC_PGATRIM_PGACTUNE_cfb_1p32                                     (_RAC_PGATRIM_PGACTUNE_cfb_1p32 << 0)          /**< Shifted mode cfb_1p32 for RAC_PGATRIM       */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_SHIFT                                  6                                              /**< Shift value for RAC_PGAVCMOUTTRIM           */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_MASK                                   0x1C0UL                                        /**< Bit mask for RAC_PGAVCMOUTTRIM              */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT                                0x00000002UL                                   /**< Mode DEFAULT for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p4                            0x00000000UL                                   /**< Mode vcm_out_0p4 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p45                           0x00000001UL                                   /**< Mode vcm_out_0p45 for RAC_PGATRIM           */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p5                            0x00000002UL                                   /**< Mode vcm_out_0p5 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p55                           0x00000003UL                                   /**< Mode vcm_out_0p55 for RAC_PGATRIM           */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p6                            0x00000004UL                                   /**< Mode vcm_out_0p6 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p65                           0x00000005UL                                   /**< Mode vcm_out_0p65 for RAC_PGATRIM           */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p7                            0x00000006UL                                   /**< Mode vcm_out_0p7 for RAC_PGATRIM            */
#define _RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p75                           0x00000007UL                                   /**< Mode vcm_out_0p75 for RAC_PGATRIM           */
#define RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT                                 (_RAC_PGATRIM_PGAVCMOUTTRIM_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p4                             (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p4 << 6)  /**< Shifted mode vcm_out_0p4 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p45                            (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p45 << 6) /**< Shifted mode vcm_out_0p45 for RAC_PGATRIM   */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p5                             (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p5 << 6)  /**< Shifted mode vcm_out_0p5 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p55                            (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p55 << 6) /**< Shifted mode vcm_out_0p55 for RAC_PGATRIM   */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p6                             (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p6 << 6)  /**< Shifted mode vcm_out_0p6 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p65                            (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p65 << 6) /**< Shifted mode vcm_out_0p65 for RAC_PGATRIM   */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p7                             (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p7 << 6)  /**< Shifted mode vcm_out_0p7 for RAC_PGATRIM    */
#define RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p75                            (_RAC_PGATRIM_PGAVCMOUTTRIM_vcm_out_0p75 << 6) /**< Shifted mode vcm_out_0p75 for RAC_PGATRIM   */
#define _RAC_PGATRIM_PGAVLDOTRIM_SHIFT                                    9                                              /**< Shift value for RAC_PGAVLDOTRIM             */
#define _RAC_PGATRIM_PGAVLDOTRIM_MASK                                     0xE00UL                                        /**< Bit mask for RAC_PGAVLDOTRIM                */
#define _RAC_PGATRIM_PGAVLDOTRIM_DEFAULT                                  0x00000005UL                                   /**< Mode DEFAULT for RAC_PGATRIM                */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p15                                0x00000000UL                                   /**< Mode vdda_1p15 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p2                                 0x00000001UL                                   /**< Mode vdda_1p2 for RAC_PGATRIM               */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p25                                0x00000002UL                                   /**< Mode vdda_1p25 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p3                                 0x00000003UL                                   /**< Mode vdda_1p3 for RAC_PGATRIM               */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p35                                0x00000004UL                                   /**< Mode vdda_1p35 for RAC_PGATRIM              */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p4                                 0x00000005UL                                   /**< Mode vdda_1p4 for RAC_PGATRIM               */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p5                                 0x00000006UL                                   /**< Mode vdda_1p5 for RAC_PGATRIM               */
#define _RAC_PGATRIM_PGAVLDOTRIM_vdda_1p55                                0x00000007UL                                   /**< Mode vdda_1p55 for RAC_PGATRIM              */
#define RAC_PGATRIM_PGAVLDOTRIM_DEFAULT                                   (_RAC_PGATRIM_PGAVLDOTRIM_DEFAULT << 9)        /**< Shifted mode DEFAULT for RAC_PGATRIM        */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p15                                 (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p15 << 9)      /**< Shifted mode vdda_1p15 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p2                                  (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p2 << 9)       /**< Shifted mode vdda_1p2 for RAC_PGATRIM       */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p25                                 (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p25 << 9)      /**< Shifted mode vdda_1p25 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p3                                  (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p3 << 9)       /**< Shifted mode vdda_1p3 for RAC_PGATRIM       */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p35                                 (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p35 << 9)      /**< Shifted mode vdda_1p35 for RAC_PGATRIM      */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p4                                  (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p4 << 9)       /**< Shifted mode vdda_1p4 for RAC_PGATRIM       */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p5                                  (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p5 << 9)       /**< Shifted mode vdda_1p5 for RAC_PGATRIM       */
#define RAC_PGATRIM_PGAVLDOTRIM_vdda_1p55                                 (_RAC_PGATRIM_PGAVLDOTRIM_vdda_1p55 << 9)      /**< Shifted mode vdda_1p55 for RAC_PGATRIM      */

/* Bit fields for RAC PGACAL */
#define _RAC_PGACAL_RESETVALUE                                            0x20200000UL                                  /**< Default value for RAC_PGACAL                */
#define _RAC_PGACAL_MASK                                                  0x3F3F0000UL                                  /**< Mask for RAC_PGACAL                         */
#define _RAC_PGACAL_PGAOFFCALI_SHIFT                                      16                                            /**< Shift value for RAC_PGAOFFCALI              */
#define _RAC_PGACAL_PGAOFFCALI_MASK                                       0x3F0000UL                                    /**< Bit mask for RAC_PGAOFFCALI                 */
#define _RAC_PGACAL_PGAOFFCALI_DEFAULT                                    0x00000020UL                                  /**< Mode DEFAULT for RAC_PGACAL                 */
#define _RAC_PGACAL_PGAOFFCALI_offset_m_300mv                             0x00000000UL                                  /**< Mode offset_m_300mv for RAC_PGACAL          */
#define _RAC_PGACAL_PGAOFFCALI_offset_p_300mv                             0x0000003FUL                                  /**< Mode offset_p_300mv for RAC_PGACAL          */
#define RAC_PGACAL_PGAOFFCALI_DEFAULT                                     (_RAC_PGACAL_PGAOFFCALI_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_PGACAL         */
#define RAC_PGACAL_PGAOFFCALI_offset_m_300mv                              (_RAC_PGACAL_PGAOFFCALI_offset_m_300mv << 16) /**< Shifted mode offset_m_300mv for RAC_PGACAL  */
#define RAC_PGACAL_PGAOFFCALI_offset_p_300mv                              (_RAC_PGACAL_PGAOFFCALI_offset_p_300mv << 16) /**< Shifted mode offset_p_300mv for RAC_PGACAL  */
#define _RAC_PGACAL_PGAOFFCALQ_SHIFT                                      24                                            /**< Shift value for RAC_PGAOFFCALQ              */
#define _RAC_PGACAL_PGAOFFCALQ_MASK                                       0x3F000000UL                                  /**< Bit mask for RAC_PGAOFFCALQ                 */
#define _RAC_PGACAL_PGAOFFCALQ_DEFAULT                                    0x00000020UL                                  /**< Mode DEFAULT for RAC_PGACAL                 */
#define _RAC_PGACAL_PGAOFFCALQ_offset_m_300mv                             0x00000000UL                                  /**< Mode offset_m_300mv for RAC_PGACAL          */
#define _RAC_PGACAL_PGAOFFCALQ_offset_p_300mv                             0x0000003FUL                                  /**< Mode offset_p_300mv for RAC_PGACAL          */
#define RAC_PGACAL_PGAOFFCALQ_DEFAULT                                     (_RAC_PGACAL_PGAOFFCALQ_DEFAULT << 24)        /**< Shifted mode DEFAULT for RAC_PGACAL         */
#define RAC_PGACAL_PGAOFFCALQ_offset_m_300mv                              (_RAC_PGACAL_PGAOFFCALQ_offset_m_300mv << 24) /**< Shifted mode offset_m_300mv for RAC_PGACAL  */
#define RAC_PGACAL_PGAOFFCALQ_offset_p_300mv                              (_RAC_PGACAL_PGAOFFCALQ_offset_p_300mv << 24) /**< Shifted mode offset_p_300mv for RAC_PGACAL  */

