SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC RFPATHEN0 */
#define _RAC_RFPATHEN0_RESETVALUE                                         0x00000042UL                                        /**< Default value for RAC_RFPATHEN0             */
#define _RAC_RFPATHEN0_MASK                                               0x0000184FUL                                        /**< Mask for RAC_RFPATHEN0                      */
#define RAC_RFPATHEN0_LNAMIXEN0                                           (0x1UL << 0)                                        /**< LNAMIXEN0                                   */
#define _RAC_RFPATHEN0_LNAMIXEN0_SHIFT                                    0                                                   /**< Shift value for RAC_LNAMIXEN0               */
#define _RAC_RFPATHEN0_LNAMIXEN0_MASK                                     0x1UL                                               /**< Bit mask for RAC_LNAMIXEN0                  */
#define _RAC_RFPATHEN0_LNAMIXEN0_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXEN0_disable                                  0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXEN0_enable                                   0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_LNAMIXEN0_DEFAULT                                   (_RAC_RFPATHEN0_LNAMIXEN0_DEFAULT << 0)             /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXEN0_disable                                   (_RAC_RFPATHEN0_LNAMIXEN0_disable << 0)             /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXEN0_enable                                    (_RAC_RFPATHEN0_LNAMIXEN0_enable << 0)              /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0                                    (0x1UL << 1)                                        /**< LNAMIXRFATTDCEN0                            */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_SHIFT                             1                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN0        */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_MASK                              0x2UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN0           */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc                        0x00000000UL                                        /**< Mode disable_dc for RAC_RFPATHEN0           */
#define _RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc                         0x00000001UL                                        /**< Mode enable_dc for RAC_RFPATHEN0            */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT                            (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc                         (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_disable_dc << 1)   /**< Shifted mode disable_dc for RAC_RFPATHEN0   */
#define RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc                          (_RAC_RFPATHEN0_LNAMIXRFATTDCEN0_enable_dc << 1)    /**< Shifted mode enable_dc for RAC_RFPATHEN0    */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0                                    (0x1UL << 2)                                        /**< LNAMIXRFPKDENRF0                            */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_SHIFT                             2                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF0        */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_MASK                              0x4UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF0           */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT                           0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0                      0x00000001UL                                        /**< Mode enable_path0 for RAC_RFPATHEN0         */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT                            (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable                            (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_disable << 2)      /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0                       (_RAC_RFPATHEN0_LNAMIXRFPKDENRF0_enable_path0 << 2) /**< Shifted mode enable_path0 for RAC_RFPATHEN0 */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN                                   (0x1UL << 3)                                        /**< SYLODIVRLO0SUBGEN                           */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_SHIFT                            3                                                   /**< Shift value for RAC_SYLODIVRLO0SUBGEN       */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_MASK                             0x8UL                                               /**< Bit mask for RAC_SYLODIVRLO0SUBGEN          */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT                          0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable                          0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable                           0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT                           (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable                           (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_disable << 3)     /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable                            (_RAC_RFPATHEN0_SYLODIVRLO0SUBGEN_enable << 3)      /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_TXENVMIDHPA0                                        (0x1UL << 6)                                        /**< TXENVMIDHPA0                                */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_SHIFT                                 6                                                   /**< Shift value for RAC_TXENVMIDHPA0            */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_MASK                                  0x40UL                                              /**< Bit mask for RAC_TXENVMIDHPA0               */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT                               0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_disable                               0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENVMIDHPA0_enable                                0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT                                (_RAC_RFPATHEN0_TXENVMIDHPA0_DEFAULT << 6)          /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDHPA0_disable                                (_RAC_RFPATHEN0_TXENVMIDHPA0_disable << 6)          /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENVMIDHPA0_enable                                 (_RAC_RFPATHEN0_TXENVMIDHPA0_enable << 6)           /**< Shifted mode enable for RAC_RFPATHEN0       */
#define RAC_RFPATHEN0_TXENFSKPA0                                          (0x1UL << 11)                                       /**< TXENFSKPA0                                  */
#define _RAC_RFPATHEN0_TXENFSKPA0_SHIFT                                   11                                                  /**< Shift value for RAC_TXENFSKPA0              */
#define _RAC_RFPATHEN0_TXENFSKPA0_MASK                                    0x800UL                                             /**< Bit mask for RAC_TXENFSKPA0                 */
#define _RAC_RFPATHEN0_TXENFSKPA0_DEFAULT                                 0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENFSKPA0_hpa0_off                                0x00000000UL                                        /**< Mode hpa0_off for RAC_RFPATHEN0             */
#define _RAC_RFPATHEN0_TXENFSKPA0_hpa0_on                                 0x00000001UL                                        /**< Mode hpa0_on for RAC_RFPATHEN0              */
#define RAC_RFPATHEN0_TXENFSKPA0_DEFAULT                                  (_RAC_RFPATHEN0_TXENFSKPA0_DEFAULT << 11)           /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENFSKPA0_hpa0_off                                 (_RAC_RFPATHEN0_TXENFSKPA0_hpa0_off << 11)          /**< Shifted mode hpa0_off for RAC_RFPATHEN0     */
#define RAC_RFPATHEN0_TXENFSKPA0_hpa0_on                                  (_RAC_RFPATHEN0_TXENFSKPA0_hpa0_on << 11)           /**< Shifted mode hpa0_on for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENOFDMPA0                                         (0x1UL << 12)                                       /**< TXENOFDMPA0                                 */
#define _RAC_RFPATHEN0_TXENOFDMPA0_SHIFT                                  12                                                  /**< Shift value for RAC_TXENOFDMPA0             */
#define _RAC_RFPATHEN0_TXENOFDMPA0_MASK                                   0x1000UL                                            /**< Bit mask for RAC_TXENOFDMPA0                */
#define _RAC_RFPATHEN0_TXENOFDMPA0_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENOFDMPA0_disable                                0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN0              */
#define _RAC_RFPATHEN0_TXENOFDMPA0_enable                                 0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN0               */
#define RAC_RFPATHEN0_TXENOFDMPA0_DEFAULT                                 (_RAC_RFPATHEN0_TXENOFDMPA0_DEFAULT << 12)          /**< Shifted mode DEFAULT for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENOFDMPA0_disable                                 (_RAC_RFPATHEN0_TXENOFDMPA0_disable << 12)          /**< Shifted mode disable for RAC_RFPATHEN0      */
#define RAC_RFPATHEN0_TXENOFDMPA0_enable                                  (_RAC_RFPATHEN0_TXENOFDMPA0_enable << 12)           /**< Shifted mode enable for RAC_RFPATHEN0       */

/* Bit fields for RAC RFPATHEN1 */
#define _RAC_RFPATHEN1_RESETVALUE                                         0x00000042UL                                        /**< Default value for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_MASK                                               0x0000184FUL                                        /**< Mask for RAC_RFPATHEN1                      */
#define RAC_RFPATHEN1_LNAMIXEN1                                           (0x1UL << 0)                                        /**< LNAMIXEN1                                   */
#define _RAC_RFPATHEN1_LNAMIXEN1_SHIFT                                    0                                                   /**< Shift value for RAC_LNAMIXEN1               */
#define _RAC_RFPATHEN1_LNAMIXEN1_MASK                                     0x1UL                                               /**< Bit mask for RAC_LNAMIXEN1                  */
#define _RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_disable                                  0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_enable                                   0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                                   (_RAC_RFPATHEN1_LNAMIXEN1_DEFAULT << 0)             /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_disable                                   (_RAC_RFPATHEN1_LNAMIXEN1_disable << 0)             /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_enable                                    (_RAC_RFPATHEN1_LNAMIXEN1_enable << 0)              /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1                                    (0x1UL << 1)                                        /**< LNAMIXRFATTDCEN1                            */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_SHIFT                             1                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN1        */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_MASK                              0x2UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                        0x00000000UL                                        /**< Mode disable_dc for RAC_RFPATHEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                         0x00000001UL                                        /**< Mode enable_dc for RAC_RFPATHEN1            */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                            (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                         (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc << 1)   /**< Shifted mode disable_dc for RAC_RFPATHEN1   */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                          (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc << 1)    /**< Shifted mode enable_dc for RAC_RFPATHEN1    */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1                                    (0x1UL << 2)                                        /**< LNAMIXRFPKDENRF1                            */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_SHIFT                             2                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF1        */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_MASK                              0x4UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF1           */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                           0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                      0x00000001UL                                        /**< Mode enable_path1 for RAC_RFPATHEN1         */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                            (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                            (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable << 2)      /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                       (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1 << 2) /**< Shifted mode enable_path1 for RAC_RFPATHEN1 */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN                                   (0x1UL << 3)                                        /**< SYLODIVRLO1SUBGEN                           */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_SHIFT                            3                                                   /**< Shift value for RAC_SYLODIVRLO1SUBGEN       */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_MASK                             0x8UL                                               /**< Bit mask for RAC_SYLODIVRLO1SUBGEN          */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT                          0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable                          0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable                           0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT                           (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable                           (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable << 3)     /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable                            (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable << 3)      /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_TXENVMIDHPA1                                        (0x1UL << 6)                                        /**< TXENVMIDHPA1                                */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_SHIFT                                 6                                                   /**< Shift value for RAC_TXENVMIDHPA1            */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_MASK                                  0x40UL                                              /**< Bit mask for RAC_TXENVMIDHPA1               */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT                               0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_disable                               0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_enable                                0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT                                (_RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT << 6)          /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDHPA1_disable                                (_RAC_RFPATHEN1_TXENVMIDHPA1_disable << 6)          /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDHPA1_enable                                 (_RAC_RFPATHEN1_TXENVMIDHPA1_enable << 6)           /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_TXENFSKPA1                                          (0x1UL << 11)                                       /**< TXENFSKPA1                                  */
#define _RAC_RFPATHEN1_TXENFSKPA1_SHIFT                                   11                                                  /**< Shift value for RAC_TXENFSKPA1              */
#define _RAC_RFPATHEN1_TXENFSKPA1_MASK                                    0x800UL                                             /**< Bit mask for RAC_TXENFSKPA1                 */
#define _RAC_RFPATHEN1_TXENFSKPA1_DEFAULT                                 0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENFSKPA1_hpa1_off                                0x00000000UL                                        /**< Mode hpa1_off for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_TXENFSKPA1_hpa1_on                                 0x00000001UL                                        /**< Mode hpa1_on for RAC_RFPATHEN1              */
#define RAC_RFPATHEN1_TXENFSKPA1_DEFAULT                                  (_RAC_RFPATHEN1_TXENFSKPA1_DEFAULT << 11)           /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENFSKPA1_hpa1_off                                 (_RAC_RFPATHEN1_TXENFSKPA1_hpa1_off << 11)          /**< Shifted mode hpa1_off for RAC_RFPATHEN1     */
#define RAC_RFPATHEN1_TXENFSKPA1_hpa1_on                                  (_RAC_RFPATHEN1_TXENFSKPA1_hpa1_on << 11)           /**< Shifted mode hpa1_on for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENOFDMPA1                                         (0x1UL << 12)                                       /**< TXENOFDMPA1                                 */
#define _RAC_RFPATHEN1_TXENOFDMPA1_SHIFT                                  12                                                  /**< Shift value for RAC_TXENOFDMPA1             */
#define _RAC_RFPATHEN1_TXENOFDMPA1_MASK                                   0x1000UL                                            /**< Bit mask for RAC_TXENOFDMPA1                */
#define _RAC_RFPATHEN1_TXENOFDMPA1_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENOFDMPA1_disable                                0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENOFDMPA1_enable                                 0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_TXENOFDMPA1_DEFAULT                                 (_RAC_RFPATHEN1_TXENOFDMPA1_DEFAULT << 12)          /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENOFDMPA1_disable                                 (_RAC_RFPATHEN1_TXENOFDMPA1_disable << 12)          /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENOFDMPA1_enable                                  (_RAC_RFPATHEN1_TXENOFDMPA1_enable << 12)           /**< Shifted mode enable for RAC_RFPATHEN1       */

