SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC RX */
#define _RAC_RX_RESETVALUE                                                0x00000000UL                                        /**< Default value for RAC_RX                    */
#define _RAC_RX_MASK                                                      0x800F03FFUL                                        /**< Mask for RAC_RX                             */
#define RAC_RX_IFADCCAPRESET                                              (0x1UL << 0)                                        /**< IFADCCAPRESET                               */
#define _RAC_RX_IFADCCAPRESET_SHIFT                                       0                                                   /**< Shift value for RAC_IFADCCAPRESET           */
#define _RAC_RX_IFADCCAPRESET_MASK                                        0x1UL                                               /**< Bit mask for RAC_IFADCCAPRESET              */
#define _RAC_RX_IFADCCAPRESET_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_IFADCCAPRESET_cap_reset_disable                           0x00000000UL                                        /**< Mode cap_reset_disable for RAC_RX           */
#define _RAC_RX_IFADCCAPRESET_cap_reset_enable                            0x00000001UL                                        /**< Mode cap_reset_enable for RAC_RX            */
#define RAC_RX_IFADCCAPRESET_DEFAULT                                      (_RAC_RX_IFADCCAPRESET_DEFAULT << 0)                /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_IFADCCAPRESET_cap_reset_disable                            (_RAC_RX_IFADCCAPRESET_cap_reset_disable << 0)      /**< Shifted mode cap_reset_disable for RAC_RX   */
#define RAC_RX_IFADCCAPRESET_cap_reset_enable                             (_RAC_RX_IFADCCAPRESET_cap_reset_enable << 0)       /**< Shifted mode cap_reset_enable for RAC_RX    */
#define RAC_RX_IFADCENLDOSERIES                                           (0x1UL << 1)                                        /**< IFADCENLDOSERIES                            */
#define _RAC_RX_IFADCENLDOSERIES_SHIFT                                    1                                                   /**< Shift value for RAC_IFADCENLDOSERIES        */
#define _RAC_RX_IFADCENLDOSERIES_MASK                                     0x2UL                                               /**< Bit mask for RAC_IFADCENLDOSERIES           */
#define _RAC_RX_IFADCENLDOSERIES_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_IFADCENLDOSERIES_series_ldo_disable                       0x00000000UL                                        /**< Mode series_ldo_disable for RAC_RX          */
#define _RAC_RX_IFADCENLDOSERIES_series_ldo_enable                        0x00000001UL                                        /**< Mode series_ldo_enable for RAC_RX           */
#define RAC_RX_IFADCENLDOSERIES_DEFAULT                                   (_RAC_RX_IFADCENLDOSERIES_DEFAULT << 1)             /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_IFADCENLDOSERIES_series_ldo_disable                        (_RAC_RX_IFADCENLDOSERIES_series_ldo_disable << 1)  /**< Shifted mode series_ldo_disable for RAC_RX  */
#define RAC_RX_IFADCENLDOSERIES_series_ldo_enable                         (_RAC_RX_IFADCENLDOSERIES_series_ldo_enable << 1)   /**< Shifted mode series_ldo_enable for RAC_RX   */
#define RAC_RX_IFADCENLDOSHUNT                                            (0x1UL << 2)                                        /**< IFADCENLDOSHUNT                             */
#define _RAC_RX_IFADCENLDOSHUNT_SHIFT                                     2                                                   /**< Shift value for RAC_IFADCENLDOSHUNT         */
#define _RAC_RX_IFADCENLDOSHUNT_MASK                                      0x4UL                                               /**< Bit mask for RAC_IFADCENLDOSHUNT            */
#define _RAC_RX_IFADCENLDOSHUNT_DEFAULT                                   0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_IFADCENLDOSHUNT_shunt_ldo_disable                         0x00000000UL                                        /**< Mode shunt_ldo_disable for RAC_RX           */
#define _RAC_RX_IFADCENLDOSHUNT_shunt_ldo_enable                          0x00000001UL                                        /**< Mode shunt_ldo_enable for RAC_RX            */
#define RAC_RX_IFADCENLDOSHUNT_DEFAULT                                    (_RAC_RX_IFADCENLDOSHUNT_DEFAULT << 2)              /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_IFADCENLDOSHUNT_shunt_ldo_disable                          (_RAC_RX_IFADCENLDOSHUNT_shunt_ldo_disable << 2)    /**< Shifted mode shunt_ldo_disable for RAC_RX   */
#define RAC_RX_IFADCENLDOSHUNT_shunt_ldo_enable                           (_RAC_RX_IFADCENLDOSHUNT_shunt_ldo_enable << 2)     /**< Shifted mode shunt_ldo_enable for RAC_RX    */
#define RAC_RX_LNAMIXENRFPKD                                              (0x1UL << 3)                                        /**< LNAMIXENRFPKD                               */
#define _RAC_RX_LNAMIXENRFPKD_SHIFT                                       3                                                   /**< Shift value for RAC_LNAMIXENRFPKD           */
#define _RAC_RX_LNAMIXENRFPKD_MASK                                        0x8UL                                               /**< Bit mask for RAC_LNAMIXENRFPKD              */
#define _RAC_RX_LNAMIXENRFPKD_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_LNAMIXENRFPKD_disable                                     0x00000000UL                                        /**< Mode disable for RAC_RX                     */
#define _RAC_RX_LNAMIXENRFPKD_enable                                      0x00000001UL                                        /**< Mode enable for RAC_RX                      */
#define RAC_RX_LNAMIXENRFPKD_DEFAULT                                      (_RAC_RX_LNAMIXENRFPKD_DEFAULT << 3)                /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_LNAMIXENRFPKD_disable                                      (_RAC_RX_LNAMIXENRFPKD_disable << 3)                /**< Shifted mode disable for RAC_RX             */
#define RAC_RX_LNAMIXENRFPKD_enable                                       (_RAC_RX_LNAMIXENRFPKD_enable << 3)                 /**< Shifted mode enable for RAC_RX              */
#define RAC_RX_LNAMIXENRFPKDLOTHRESH                                      (0x1UL << 4)                                        /**< LNAMIXENRFPKDLOTHRESH                       */
#define _RAC_RX_LNAMIXENRFPKDLOTHRESH_SHIFT                               4                                                   /**< Shift value for RAC_LNAMIXENRFPKDLOTHRESH   */
#define _RAC_RX_LNAMIXENRFPKDLOTHRESH_MASK                                0x10UL                                              /**< Bit mask for RAC_LNAMIXENRFPKDLOTHRESH      */
#define _RAC_RX_LNAMIXENRFPKDLOTHRESH_DEFAULT                             0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_LNAMIXENRFPKDLOTHRESH_disable                             0x00000000UL                                        /**< Mode disable for RAC_RX                     */
#define _RAC_RX_LNAMIXENRFPKDLOTHRESH_enable                              0x00000001UL                                        /**< Mode enable for RAC_RX                      */
#define RAC_RX_LNAMIXENRFPKDLOTHRESH_DEFAULT                              (_RAC_RX_LNAMIXENRFPKDLOTHRESH_DEFAULT << 4)        /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_LNAMIXENRFPKDLOTHRESH_disable                              (_RAC_RX_LNAMIXENRFPKDLOTHRESH_disable << 4)        /**< Shifted mode disable for RAC_RX             */
#define RAC_RX_LNAMIXENRFPKDLOTHRESH_enable                               (_RAC_RX_LNAMIXENRFPKDLOTHRESH_enable << 4)         /**< Shifted mode enable for RAC_RX              */
#define _RAC_RX_LNAMIXLDOLOWCUR_SHIFT                                     5                                                   /**< Shift value for RAC_LNAMIXLDOLOWCUR         */
#define _RAC_RX_LNAMIXLDOLOWCUR_MASK                                      0x60UL                                              /**< Bit mask for RAC_LNAMIXLDOLOWCUR            */
#define _RAC_RX_LNAMIXLDOLOWCUR_DEFAULT                                   0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_LNAMIXLDOLOWCUR_regular_mode                              0x00000000UL                                        /**< Mode regular_mode for RAC_RX                */
#define _RAC_RX_LNAMIXLDOLOWCUR_low_current_mode                          0x00000001UL                                        /**< Mode low_current_mode for RAC_RX            */
#define _RAC_RX_LNAMIXLDOLOWCUR_high_current_mode                         0x00000003UL                                        /**< Mode high_current_mode for RAC_RX           */
#define RAC_RX_LNAMIXLDOLOWCUR_DEFAULT                                    (_RAC_RX_LNAMIXLDOLOWCUR_DEFAULT << 5)              /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_LNAMIXLDOLOWCUR_regular_mode                               (_RAC_RX_LNAMIXLDOLOWCUR_regular_mode << 5)         /**< Shifted mode regular_mode for RAC_RX        */
#define RAC_RX_LNAMIXLDOLOWCUR_low_current_mode                           (_RAC_RX_LNAMIXLDOLOWCUR_low_current_mode << 5)     /**< Shifted mode low_current_mode for RAC_RX    */
#define RAC_RX_LNAMIXLDOLOWCUR_high_current_mode                          (_RAC_RX_LNAMIXLDOLOWCUR_high_current_mode << 5)    /**< Shifted mode high_current_mode for RAC_RX   */
#define RAC_RX_LNAMIXREGLOADEN                                            (0x1UL << 7)                                        /**< LNAMIXREGLOADEN                             */
#define _RAC_RX_LNAMIXREGLOADEN_SHIFT                                     7                                                   /**< Shift value for RAC_LNAMIXREGLOADEN         */
#define _RAC_RX_LNAMIXREGLOADEN_MASK                                      0x80UL                                              /**< Bit mask for RAC_LNAMIXREGLOADEN            */
#define _RAC_RX_LNAMIXREGLOADEN_DEFAULT                                   0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_LNAMIXREGLOADEN_disable_resistor                          0x00000000UL                                        /**< Mode disable_resistor for RAC_RX            */
#define _RAC_RX_LNAMIXREGLOADEN_enable_resistor                           0x00000001UL                                        /**< Mode enable_resistor for RAC_RX             */
#define RAC_RX_LNAMIXREGLOADEN_DEFAULT                                    (_RAC_RX_LNAMIXREGLOADEN_DEFAULT << 7)              /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_LNAMIXREGLOADEN_disable_resistor                           (_RAC_RX_LNAMIXREGLOADEN_disable_resistor << 7)     /**< Shifted mode disable_resistor for RAC_RX    */
#define RAC_RX_LNAMIXREGLOADEN_enable_resistor                            (_RAC_RX_LNAMIXREGLOADEN_enable_resistor << 7)      /**< Shifted mode enable_resistor for RAC_RX     */
#define RAC_RX_PGAENLDO                                                   (0x1UL << 8)                                        /**< PGAENLDO                                    */
#define _RAC_RX_PGAENLDO_SHIFT                                            8                                                   /**< Shift value for RAC_PGAENLDO                */
#define _RAC_RX_PGAENLDO_MASK                                             0x100UL                                             /**< Bit mask for RAC_PGAENLDO                   */
#define _RAC_RX_PGAENLDO_DEFAULT                                          0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_PGAENLDO_disable_ldo                                      0x00000000UL                                        /**< Mode disable_ldo for RAC_RX                 */
#define _RAC_RX_PGAENLDO_enable_ldo                                       0x00000001UL                                        /**< Mode enable_ldo for RAC_RX                  */
#define RAC_RX_PGAENLDO_DEFAULT                                           (_RAC_RX_PGAENLDO_DEFAULT << 8)                     /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_PGAENLDO_disable_ldo                                       (_RAC_RX_PGAENLDO_disable_ldo << 8)                 /**< Shifted mode disable_ldo for RAC_RX         */
#define RAC_RX_PGAENLDO_enable_ldo                                        (_RAC_RX_PGAENLDO_enable_ldo << 8)                  /**< Shifted mode enable_ldo for RAC_RX          */
#define RAC_RX_SYCHPQNC3EN                                                (0x1UL << 9)                                        /**< SYCHPQNC3EN                                 */
#define _RAC_RX_SYCHPQNC3EN_SHIFT                                         9                                                   /**< Shift value for RAC_SYCHPQNC3EN             */
#define _RAC_RX_SYCHPQNC3EN_MASK                                          0x200UL                                             /**< Bit mask for RAC_SYCHPQNC3EN                */
#define _RAC_RX_SYCHPQNC3EN_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_SYCHPQNC3EN_qnc_2                                         0x00000000UL                                        /**< Mode qnc_2 for RAC_RX                       */
#define _RAC_RX_SYCHPQNC3EN_qnc_3                                         0x00000001UL                                        /**< Mode qnc_3 for RAC_RX                       */
#define RAC_RX_SYCHPQNC3EN_DEFAULT                                        (_RAC_RX_SYCHPQNC3EN_DEFAULT << 9)                  /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_SYCHPQNC3EN_qnc_2                                          (_RAC_RX_SYCHPQNC3EN_qnc_2 << 9)                    /**< Shifted mode qnc_2 for RAC_RX               */
#define RAC_RX_SYCHPQNC3EN_qnc_3                                          (_RAC_RX_SYCHPQNC3EN_qnc_3 << 9)                    /**< Shifted mode qnc_3 for RAC_RX               */
#define RAC_RX_SYCHPBIASTRIMBUFRX                                         (0x1UL << 16)                                       /**< SYCHPBIASTRIMBUFRX                          */
#define _RAC_RX_SYCHPBIASTRIMBUFRX_SHIFT                                  16                                                  /**< Shift value for RAC_SYCHPBIASTRIMBUFRX      */
#define _RAC_RX_SYCHPBIASTRIMBUFRX_MASK                                   0x10000UL                                           /**< Bit mask for RAC_SYCHPBIASTRIMBUFRX         */
#define _RAC_RX_SYCHPBIASTRIMBUFRX_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_10u                             0x00000000UL                                        /**< Mode i_tail_10u for RAC_RX                  */
#define _RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_20u                             0x00000001UL                                        /**< Mode i_tail_20u for RAC_RX                  */
#define RAC_RX_SYCHPBIASTRIMBUFRX_DEFAULT                                 (_RAC_RX_SYCHPBIASTRIMBUFRX_DEFAULT << 16)          /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_10u                              (_RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_10u << 16)       /**< Shifted mode i_tail_10u for RAC_RX          */
#define RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_20u                              (_RAC_RX_SYCHPBIASTRIMBUFRX_i_tail_20u << 16)       /**< Shifted mode i_tail_20u for RAC_RX          */
#define RAC_RX_SYPFDCHPLPENRX                                             (0x1UL << 17)                                       /**< SYPFDCHPLPENRX                              */
#define _RAC_RX_SYPFDCHPLPENRX_SHIFT                                      17                                                  /**< Shift value for RAC_SYPFDCHPLPENRX          */
#define _RAC_RX_SYPFDCHPLPENRX_MASK                                       0x20000UL                                           /**< Bit mask for RAC_SYPFDCHPLPENRX             */
#define _RAC_RX_SYPFDCHPLPENRX_DEFAULT                                    0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_SYPFDCHPLPENRX_disable                                    0x00000000UL                                        /**< Mode disable for RAC_RX                     */
#define _RAC_RX_SYPFDCHPLPENRX_enable                                     0x00000001UL                                        /**< Mode enable for RAC_RX                      */
#define RAC_RX_SYPFDCHPLPENRX_DEFAULT                                     (_RAC_RX_SYPFDCHPLPENRX_DEFAULT << 17)              /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_SYPFDCHPLPENRX_disable                                     (_RAC_RX_SYPFDCHPLPENRX_disable << 17)              /**< Shifted mode disable for RAC_RX             */
#define RAC_RX_SYPFDCHPLPENRX_enable                                      (_RAC_RX_SYPFDCHPLPENRX_enable << 17)               /**< Shifted mode enable for RAC_RX              */
#define RAC_RX_SYPFDFPWENRX                                               (0x1UL << 18)                                       /**< SYPFDFPWENRX                                */
#define _RAC_RX_SYPFDFPWENRX_SHIFT                                        18                                                  /**< Shift value for RAC_SYPFDFPWENRX            */
#define _RAC_RX_SYPFDFPWENRX_MASK                                         0x40000UL                                           /**< Bit mask for RAC_SYPFDFPWENRX               */
#define _RAC_RX_SYPFDFPWENRX_DEFAULT                                      0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_SYPFDFPWENRX_disable                                      0x00000000UL                                        /**< Mode disable for RAC_RX                     */
#define _RAC_RX_SYPFDFPWENRX_enable                                       0x00000001UL                                        /**< Mode enable for RAC_RX                      */
#define RAC_RX_SYPFDFPWENRX_DEFAULT                                       (_RAC_RX_SYPFDFPWENRX_DEFAULT << 18)                /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_SYPFDFPWENRX_disable                                       (_RAC_RX_SYPFDFPWENRX_disable << 18)                /**< Shifted mode disable for RAC_RX             */
#define RAC_RX_SYPFDFPWENRX_enable                                        (_RAC_RX_SYPFDFPWENRX_enable << 18)                 /**< Shifted mode enable for RAC_RX              */
#define RAC_RX_SYVCOVCAPFASTRAMPRX                                        (0x1UL << 19)                                       /**< SYVCOVCAPFASTRAMPRX                         */
#define _RAC_RX_SYVCOVCAPFASTRAMPRX_SHIFT                                 19                                                  /**< Shift value for RAC_SYVCOVCAPFASTRAMPRX     */
#define _RAC_RX_SYVCOVCAPFASTRAMPRX_MASK                                  0x80000UL                                           /**< Bit mask for RAC_SYVCOVCAPFASTRAMPRX        */
#define _RAC_RX_SYVCOVCAPFASTRAMPRX_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_0                       0x00000000UL                                        /**< Mode vcap_fastramp_0 for RAC_RX             */
#define _RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_1                       0x00000001UL                                        /**< Mode vcap_fastramp_1 for RAC_RX             */
#define RAC_RX_SYVCOVCAPFASTRAMPRX_DEFAULT                                (_RAC_RX_SYVCOVCAPFASTRAMPRX_DEFAULT << 19)         /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_0                        (_RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_0 << 19) /**< Shifted mode vcap_fastramp_0 for RAC_RX     */
#define RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_1                        (_RAC_RX_SYVCOVCAPFASTRAMPRX_vcap_fastramp_1 << 19) /**< Shifted mode vcap_fastramp_1 for RAC_RX     */
#define RAC_RX_FEFILTOUTPUTSEL                                            (0x1UL << 31)                                       /**< Select output between two FEFILTs           */
#define _RAC_RX_FEFILTOUTPUTSEL_SHIFT                                     31                                                  /**< Shift value for RAC_FEFILTOUTPUTSEL         */
#define _RAC_RX_FEFILTOUTPUTSEL_MASK                                      0x80000000UL                                        /**< Bit mask for RAC_FEFILTOUTPUTSEL            */
#define _RAC_RX_FEFILTOUTPUTSEL_DEFAULT                                   0x00000000UL                                        /**< Mode DEFAULT for RAC_RX                     */
#define _RAC_RX_FEFILTOUTPUTSEL_FEFILT0                                   0x00000000UL                                        /**< Mode FEFILT0 for RAC_RX                     */
#define _RAC_RX_FEFILTOUTPUTSEL_FEFILT1                                   0x00000001UL                                        /**< Mode FEFILT1 for RAC_RX                     */
#define RAC_RX_FEFILTOUTPUTSEL_DEFAULT                                    (_RAC_RX_FEFILTOUTPUTSEL_DEFAULT << 31)             /**< Shifted mode DEFAULT for RAC_RX             */
#define RAC_RX_FEFILTOUTPUTSEL_FEFILT0                                    (_RAC_RX_FEFILTOUTPUTSEL_FEFILT0 << 31)             /**< Shifted mode FEFILT0 for RAC_RX             */
#define RAC_RX_FEFILTOUTPUTSEL_FEFILT1                                    (_RAC_RX_FEFILTOUTPUTSEL_FEFILT1 << 31)             /**< Shifted mode FEFILT1 for RAC_RX             */

