SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TX */
#define _RAC_TX_RESETVALUE                                                0x00000000UL                                        /**< Default value for RAC_TX                    */
#define _RAC_TX_MASK                                                      0xDF3FEFFFUL                                        /**< Mask for RAC_TX                             */
#define RAC_TX_TXENDREG                                                   (0x1UL << 0)                                        /**< TXENDREG                                    */
#define _RAC_TX_TXENDREG_SHIFT                                            0                                                   /**< Shift value for RAC_TXENDREG                */
#define _RAC_TX_TXENDREG_MASK                                             0x1UL                                               /**< Bit mask for RAC_TXENDREG                   */
#define _RAC_TX_TXENDREG_DEFAULT                                          0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENDREG_dreg_off                                         0x00000000UL                                        /**< Mode dreg_off for RAC_TX                    */
#define _RAC_TX_TXENDREG_dreg_on                                          0x00000001UL                                        /**< Mode dreg_on for RAC_TX                     */
#define RAC_TX_TXENDREG_DEFAULT                                           (_RAC_TX_TXENDREG_DEFAULT << 0)                     /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENDREG_dreg_off                                          (_RAC_TX_TXENDREG_dreg_off << 0)                    /**< Shifted mode dreg_off for RAC_TX            */
#define RAC_TX_TXENDREG_dreg_on                                           (_RAC_TX_TXENDREG_dreg_on << 0)                     /**< Shifted mode dreg_on for RAC_TX             */
#define RAC_TX_TXENOREG                                                   (0x1UL << 1)                                        /**< TXENOREG                                    */
#define _RAC_TX_TXENOREG_SHIFT                                            1                                                   /**< Shift value for RAC_TXENOREG                */
#define _RAC_TX_TXENOREG_MASK                                             0x2UL                                               /**< Bit mask for RAC_TXENOREG                   */
#define _RAC_TX_TXENOREG_DEFAULT                                          0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENOREG_oreg_off                                         0x00000000UL                                        /**< Mode oreg_off for RAC_TX                    */
#define _RAC_TX_TXENOREG_oreg_on                                          0x00000001UL                                        /**< Mode oreg_on for RAC_TX                     */
#define RAC_TX_TXENOREG_DEFAULT                                           (_RAC_TX_TXENOREG_DEFAULT << 1)                     /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENOREG_oreg_off                                          (_RAC_TX_TXENOREG_oreg_off << 1)                    /**< Shifted mode oreg_off for RAC_TX            */
#define RAC_TX_TXENOREG_oreg_on                                           (_RAC_TX_TXENOREG_oreg_on << 1)                     /**< Shifted mode oreg_on for RAC_TX             */
#define RAC_TX_TXENOREGBLEED                                              (0x1UL << 2)                                        /**< TXENOREGBLEED                               */
#define _RAC_TX_TXENOREGBLEED_SHIFT                                       2                                                   /**< Shift value for RAC_TXENOREGBLEED           */
#define _RAC_TX_TXENOREGBLEED_MASK                                        0x4UL                                               /**< Bit mask for RAC_TXENOREGBLEED              */
#define _RAC_TX_TXENOREGBLEED_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENOREGBLEED_oreg_bleed_off                              0x00000000UL                                        /**< Mode oreg_bleed_off for RAC_TX              */
#define _RAC_TX_TXENOREGBLEED_oreg_bleed_on                               0x00000001UL                                        /**< Mode oreg_bleed_on for RAC_TX               */
#define RAC_TX_TXENOREGBLEED_DEFAULT                                      (_RAC_TX_TXENOREGBLEED_DEFAULT << 2)                /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENOREGBLEED_oreg_bleed_off                               (_RAC_TX_TXENOREGBLEED_oreg_bleed_off << 2)         /**< Shifted mode oreg_bleed_off for RAC_TX      */
#define RAC_TX_TXENOREGBLEED_oreg_bleed_on                                (_RAC_TX_TXENOREGBLEED_oreg_bleed_on << 2)          /**< Shifted mode oreg_bleed_on for RAC_TX       */
#define RAC_TX_TXENRREG                                                   (0x1UL << 3)                                        /**< TXENRREG                                    */
#define _RAC_TX_TXENRREG_SHIFT                                            3                                                   /**< Shift value for RAC_TXENRREG                */
#define _RAC_TX_TXENRREG_MASK                                             0x8UL                                               /**< Bit mask for RAC_TXENRREG                   */
#define _RAC_TX_TXENRREG_DEFAULT                                          0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENRREG_iso_enabled                                      0x00000000UL                                        /**< Mode iso_enabled for RAC_TX                 */
#define _RAC_TX_TXENRREG_iso_disabled                                     0x00000001UL                                        /**< Mode iso_disabled for RAC_TX                */
#define RAC_TX_TXENRREG_DEFAULT                                           (_RAC_TX_TXENRREG_DEFAULT << 3)                     /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENRREG_iso_enabled                                       (_RAC_TX_TXENRREG_iso_enabled << 3)                 /**< Shifted mode iso_enabled for RAC_TX         */
#define RAC_TX_TXENRREG_iso_disabled                                      (_RAC_TX_TXENRREG_iso_disabled << 3)                /**< Shifted mode iso_disabled for RAC_TX        */
#define RAC_TX_TXENCLKGEN                                                 (0x1UL << 4)                                        /**< TXENCLKGEN                                  */
#define _RAC_TX_TXENCLKGEN_SHIFT                                          4                                                   /**< Shift value for RAC_TXENCLKGEN              */
#define _RAC_TX_TXENCLKGEN_MASK                                           0x10UL                                              /**< Bit mask for RAC_TXENCLKGEN                 */
#define _RAC_TX_TXENCLKGEN_DEFAULT                                        0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENCLKGEN_clkgen_off                                     0x00000000UL                                        /**< Mode clkgen_off for RAC_TX                  */
#define _RAC_TX_TXENCLKGEN_clkgen_on                                      0x00000001UL                                        /**< Mode clkgen_on for RAC_TX                   */
#define RAC_TX_TXENCLKGEN_DEFAULT                                         (_RAC_TX_TXENCLKGEN_DEFAULT << 4)                   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENCLKGEN_clkgen_off                                      (_RAC_TX_TXENCLKGEN_clkgen_off << 4)                /**< Shifted mode clkgen_off for RAC_TX          */
#define RAC_TX_TXENCLKGEN_clkgen_on                                       (_RAC_TX_TXENCLKGEN_clkgen_on << 4)                 /**< Shifted mode clkgen_on for RAC_TX           */
#define RAC_TX_TXENPADDCFORCE                                             (0x1UL << 5)                                        /**< TXENPADDCFORCE                              */
#define _RAC_TX_TXENPADDCFORCE_SHIFT                                      5                                                   /**< Shift value for RAC_TXENPADDCFORCE          */
#define _RAC_TX_TXENPADDCFORCE_MASK                                       0x20UL                                              /**< Bit mask for RAC_TXENPADDCFORCE             */
#define _RAC_TX_TXENPADDCFORCE_DEFAULT                                    0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENPADDCFORCE_dc_force_off                               0x00000000UL                                        /**< Mode dc_force_off for RAC_TX                */
#define _RAC_TX_TXENPADDCFORCE_dc_force_on                                0x00000001UL                                        /**< Mode dc_force_on for RAC_TX                 */
#define RAC_TX_TXENPADDCFORCE_DEFAULT                                     (_RAC_TX_TXENPADDCFORCE_DEFAULT << 5)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENPADDCFORCE_dc_force_off                                (_RAC_TX_TXENPADDCFORCE_dc_force_off << 5)          /**< Shifted mode dc_force_off for RAC_TX        */
#define RAC_TX_TXENPADDCFORCE_dc_force_on                                 (_RAC_TX_TXENPADDCFORCE_dc_force_on << 5)           /**< Shifted mode dc_force_on for RAC_TX         */
#define RAC_TX_TXENPKDOGND                                                (0x1UL << 6)                                        /**< TXENPKDOGND                                 */
#define _RAC_TX_TXENPKDOGND_SHIFT                                         6                                                   /**< Shift value for RAC_TXENPKDOGND             */
#define _RAC_TX_TXENPKDOGND_MASK                                          0x40UL                                              /**< Bit mask for RAC_TXENPKDOGND                */
#define _RAC_TX_TXENPKDOGND_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENPKDOGND_ognd_pkd_off                                  0x00000000UL                                        /**< Mode ognd_pkd_off for RAC_TX                */
#define _RAC_TX_TXENPKDOGND_ognd_pkd_on                                   0x00000001UL                                        /**< Mode ognd_pkd_on for RAC_TX                 */
#define RAC_TX_TXENPKDOGND_DEFAULT                                        (_RAC_TX_TXENPKDOGND_DEFAULT << 6)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENPKDOGND_ognd_pkd_off                                   (_RAC_TX_TXENPKDOGND_ognd_pkd_off << 6)             /**< Shifted mode ognd_pkd_off for RAC_TX        */
#define RAC_TX_TXENPKDOGND_ognd_pkd_on                                    (_RAC_TX_TXENPKDOGND_ognd_pkd_on << 6)              /**< Shifted mode ognd_pkd_on for RAC_TX         */
#define RAC_TX_TXENPKDOGNDCLK                                             (0x1UL << 7)                                        /**< TXENPKDOGNDCLK                              */
#define _RAC_TX_TXENPKDOGNDCLK_SHIFT                                      7                                                   /**< Shift value for RAC_TXENPKDOGNDCLK          */
#define _RAC_TX_TXENPKDOGNDCLK_MASK                                       0x80UL                                              /**< Bit mask for RAC_TXENPKDOGNDCLK             */
#define _RAC_TX_TXENPKDOGNDCLK_DEFAULT                                    0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENPKDOGNDCLK_pkdognd_clk_off                            0x00000000UL                                        /**< Mode pkdognd_clk_off for RAC_TX             */
#define _RAC_TX_TXENPKDOGNDCLK_pkdognd_clki_on                            0x00000001UL                                        /**< Mode pkdognd_clki_on for RAC_TX             */
#define RAC_TX_TXENPKDOGNDCLK_DEFAULT                                     (_RAC_TX_TXENPKDOGNDCLK_DEFAULT << 7)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENPKDOGNDCLK_pkdognd_clk_off                             (_RAC_TX_TXENPKDOGNDCLK_pkdognd_clk_off << 7)       /**< Shifted mode pkdognd_clk_off for RAC_TX     */
#define RAC_TX_TXENPKDOGNDCLK_pkdognd_clki_on                             (_RAC_TX_TXENPKDOGNDCLK_pkdognd_clki_on << 7)       /**< Shifted mode pkdognd_clki_on for RAC_TX     */
#define RAC_TX_TXENPUPDNPROTECT                                           (0x1UL << 8)                                        /**< TXENPUPDNPROTECT                            */
#define _RAC_TX_TXENPUPDNPROTECT_SHIFT                                    8                                                   /**< Shift value for RAC_TXENPUPDNPROTECT        */
#define _RAC_TX_TXENPUPDNPROTECT_MASK                                     0x100UL                                             /**< Bit mask for RAC_TXENPUPDNPROTECT           */
#define _RAC_TX_TXENPUPDNPROTECT_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENPUPDNPROTECT_pupdn_protect_off                        0x00000000UL                                        /**< Mode pupdn_protect_off for RAC_TX           */
#define _RAC_TX_TXENPUPDNPROTECT_pupdn_protect_on                         0x00000001UL                                        /**< Mode pupdn_protect_on for RAC_TX            */
#define RAC_TX_TXENPUPDNPROTECT_DEFAULT                                   (_RAC_TX_TXENPUPDNPROTECT_DEFAULT << 8)             /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENPUPDNPROTECT_pupdn_protect_off                         (_RAC_TX_TXENPUPDNPROTECT_pupdn_protect_off << 8)   /**< Shifted mode pupdn_protect_off for RAC_TX   */
#define RAC_TX_TXENPUPDNPROTECT_pupdn_protect_on                          (_RAC_TX_TXENPUPDNPROTECT_pupdn_protect_on << 8)    /**< Shifted mode pupdn_protect_on for RAC_TX    */
#define RAC_TX_TXENRAMPCLK                                                (0x1UL << 9)                                        /**< TXENRAMPCLK                                 */
#define _RAC_TX_TXENRAMPCLK_SHIFT                                         9                                                   /**< Shift value for RAC_TXENRAMPCLK             */
#define _RAC_TX_TXENRAMPCLK_MASK                                          0x200UL                                             /**< Bit mask for RAC_TXENRAMPCLK                */
#define _RAC_TX_TXENRAMPCLK_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENRAMPCLK_disable_ramp_clk                              0x00000000UL                                        /**< Mode disable_ramp_clk for RAC_TX            */
#define _RAC_TX_TXENRAMPCLK_enable_ramp_clk                               0x00000001UL                                        /**< Mode enable_ramp_clk for RAC_TX             */
#define RAC_TX_TXENRAMPCLK_DEFAULT                                        (_RAC_TX_TXENRAMPCLK_DEFAULT << 9)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENRAMPCLK_disable_ramp_clk                               (_RAC_TX_TXENRAMPCLK_disable_ramp_clk << 9)         /**< Shifted mode disable_ramp_clk for RAC_TX    */
#define RAC_TX_TXENRAMPCLK_enable_ramp_clk                                (_RAC_TX_TXENRAMPCLK_enable_ramp_clk << 9)          /**< Shifted mode enable_ramp_clk for RAC_TX     */
#define RAC_TX_TXENVTRCURRENT                                             (0x1UL << 10)                                       /**< TXENVTRCURRENT                              */
#define _RAC_TX_TXENVTRCURRENT_SHIFT                                      10                                                  /**< Shift value for RAC_TXENVTRCURRENT          */
#define _RAC_TX_TXENVTRCURRENT_MASK                                       0x400UL                                             /**< Bit mask for RAC_TXENVTRCURRENT             */
#define _RAC_TX_TXENVTRCURRENT_DEFAULT                                    0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENVTRCURRENT_disable                                    0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXENVTRCURRENT_enable                                     0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXENVTRCURRENT_DEFAULT                                     (_RAC_TX_TXENVTRCURRENT_DEFAULT << 10)              /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENVTRCURRENT_disable                                     (_RAC_TX_TXENVTRCURRENT_disable << 10)              /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXENVTRCURRENT_enable                                      (_RAC_TX_TXENVTRCURRENT_enable << 10)               /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXENXDRVVMID                                               (0x1UL << 11)                                       /**< TXENXDRVVMID                                */
#define _RAC_TX_TXENXDRVVMID_SHIFT                                        11                                                  /**< Shift value for RAC_TXENXDRVVMID            */
#define _RAC_TX_TXENXDRVVMID_MASK                                         0x800UL                                             /**< Bit mask for RAC_TXENXDRVVMID               */
#define _RAC_TX_TXENXDRVVMID_DEFAULT                                      0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENXDRVVMID_disable                                      0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXENXDRVVMID_enable                                       0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXENXDRVVMID_DEFAULT                                       (_RAC_TX_TXENXDRVVMID_DEFAULT << 11)                /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENXDRVVMID_disable                                       (_RAC_TX_TXENXDRVVMID_disable << 11)                /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXENXDRVVMID_enable                                        (_RAC_TX_TXENXDRVVMID_enable << 11)                 /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXMODESE                                                   (0x1UL << 13)                                       /**< TXMODESE                                    */
#define _RAC_TX_TXMODESE_SHIFT                                            13                                                  /**< Shift value for RAC_TXMODESE                */
#define _RAC_TX_TXMODESE_MASK                                             0x2000UL                                            /**< Bit mask for RAC_TXMODESE                   */
#define _RAC_TX_TXMODESE_DEFAULT                                          0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXMODESE_differential                                     0x00000000UL                                        /**< Mode differential for RAC_TX                */
#define _RAC_TX_TXMODESE_single_ended                                     0x00000001UL                                        /**< Mode single_ended for RAC_TX                */
#define RAC_TX_TXMODESE_DEFAULT                                           (_RAC_TX_TXMODESE_DEFAULT << 13)                    /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXMODESE_differential                                      (_RAC_TX_TXMODESE_differential << 13)               /**< Shifted mode differential for RAC_TX        */
#define RAC_TX_TXMODESE_single_ended                                      (_RAC_TX_TXMODESE_single_ended << 13)               /**< Shifted mode single_ended for RAC_TX        */
#define RAC_TX_TXENRFPKD0                                                 (0x1UL << 14)                                       /**< TXENRFPKD0                                  */
#define _RAC_TX_TXENRFPKD0_SHIFT                                          14                                                  /**< Shift value for RAC_TXENRFPKD0              */
#define _RAC_TX_TXENRFPKD0_MASK                                           0x4000UL                                            /**< Bit mask for RAC_TXENRFPKD0                 */
#define _RAC_TX_TXENRFPKD0_DEFAULT                                        0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENRFPKD0_disable                                        0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXENRFPKD0_enable                                         0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXENRFPKD0_DEFAULT                                         (_RAC_TX_TXENRFPKD0_DEFAULT << 14)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENRFPKD0_disable                                         (_RAC_TX_TXENRFPKD0_disable << 14)                  /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXENRFPKD0_enable                                          (_RAC_TX_TXENRFPKD0_enable << 14)                   /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXENRFPKD1                                                 (0x1UL << 15)                                       /**< TXENRFPKD1                                  */
#define _RAC_TX_TXENRFPKD1_SHIFT                                          15                                                  /**< Shift value for RAC_TXENRFPKD1              */
#define _RAC_TX_TXENRFPKD1_MASK                                           0x8000UL                                            /**< Bit mask for RAC_TXENRFPKD1                 */
#define _RAC_TX_TXENRFPKD1_DEFAULT                                        0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENRFPKD1_disable                                        0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXENRFPKD1_enable                                         0x00000001UL                                        /**< Mode enable for RAC_TX                      */
