SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
#define RAC_TX_TXENRFPKD1_DEFAULT                                         (_RAC_TX_TXENRFPKD1_DEFAULT << 15)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENRFPKD1_disable                                         (_RAC_TX_TXENRFPKD1_disable << 15)                  /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXENRFPKD1_enable                                          (_RAC_TX_TXENRFPKD1_enable << 15)                   /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXENRREGBLEED                                              (0x1UL << 16)                                       /**< TXENRREGBLEED                               */
#define _RAC_TX_TXENRREGBLEED_SHIFT                                       16                                                  /**< Shift value for RAC_TXENRREGBLEED           */
#define _RAC_TX_TXENRREGBLEED_MASK                                        0x10000UL                                           /**< Bit mask for RAC_TXENRREGBLEED              */
#define _RAC_TX_TXENRREGBLEED_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENRREGBLEED_disable                                     0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXENRREGBLEED_enable                                      0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXENRREGBLEED_DEFAULT                                      (_RAC_TX_TXENRREGBLEED_DEFAULT << 16)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENRREGBLEED_disable                                      (_RAC_TX_TXENRREGBLEED_disable << 16)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXENRREGBLEED_enable                                       (_RAC_TX_TXENRREGBLEED_enable << 16)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYCHPBIASTRIMBUFTX                                         (0x1UL << 17)                                       /**< SYCHPBIASTRIMBUFTX                          */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_SHIFT                                  17                                                  /**< Shift value for RAC_SYCHPBIASTRIMBUFTX      */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_MASK                                   0x20000UL                                           /**< Bit mask for RAC_SYCHPBIASTRIMBUFTX         */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u                             0x00000000UL                                        /**< Mode i_tail_10u for RAC_TX                  */
#define _RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u                             0x00000001UL                                        /**< Mode i_tail_20u for RAC_TX                  */
#define RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT                                 (_RAC_TX_SYCHPBIASTRIMBUFTX_DEFAULT << 17)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u                              (_RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_10u << 17)       /**< Shifted mode i_tail_10u for RAC_TX          */
#define RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u                              (_RAC_TX_SYCHPBIASTRIMBUFTX_i_tail_20u << 17)       /**< Shifted mode i_tail_20u for RAC_TX          */
#define RAC_TX_SYPFDCHPLPENTX                                             (0x1UL << 18)                                       /**< SYPFDCHPLPENTX                              */
#define _RAC_TX_SYPFDCHPLPENTX_SHIFT                                      18                                                  /**< Shift value for RAC_SYPFDCHPLPENTX          */
#define _RAC_TX_SYPFDCHPLPENTX_MASK                                       0x40000UL                                           /**< Bit mask for RAC_SYPFDCHPLPENTX             */
#define _RAC_TX_SYPFDCHPLPENTX_DEFAULT                                    0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_disable                                    0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_enable                                     0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDCHPLPENTX_DEFAULT                                     (_RAC_TX_SYPFDCHPLPENTX_DEFAULT << 18)              /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_disable                                     (_RAC_TX_SYPFDCHPLPENTX_disable << 18)              /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_enable                                      (_RAC_TX_SYPFDCHPLPENTX_enable << 18)               /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYPFDFPWENTX                                               (0x1UL << 19)                                       /**< SYPFDFPWENTX                                */
#define _RAC_TX_SYPFDFPWENTX_SHIFT                                        19                                                  /**< Shift value for RAC_SYPFDFPWENTX            */
#define _RAC_TX_SYPFDFPWENTX_MASK                                         0x80000UL                                           /**< Bit mask for RAC_SYPFDFPWENTX               */
#define _RAC_TX_SYPFDFPWENTX_DEFAULT                                      0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_disable                                      0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_enable                                       0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDFPWENTX_DEFAULT                                       (_RAC_TX_SYPFDFPWENTX_DEFAULT << 19)                /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_disable                                       (_RAC_TX_SYPFDFPWENTX_disable << 19)                /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_enable                                        (_RAC_TX_SYPFDFPWENTX_enable << 19)                 /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYVCOVCAPFASTRAMPTX                                        (0x1UL << 20)                                       /**< SYVCOVCAPFASTRAMPTX                         */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_SHIFT                                 20                                                  /**< Shift value for RAC_SYVCOVCAPFASTRAMPTX     */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_MASK                                  0x100000UL                                          /**< Bit mask for RAC_SYVCOVCAPFASTRAMPTX        */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0                       0x00000000UL                                        /**< Mode vcap_fastramp_0 for RAC_TX             */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1                       0x00000001UL                                        /**< Mode vcap_fastramp_1 for RAC_TX             */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT                                (_RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT << 20)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0                        (_RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0 << 20) /**< Shifted mode vcap_fastramp_0 for RAC_TX     */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1                        (_RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1 << 20) /**< Shifted mode vcap_fastramp_1 for RAC_TX     */
#define RAC_TX_TXMODEPMOSOFF                                              (0x1UL << 21)                                       /**< TXMODEPMOSOFF                               */
#define _RAC_TX_TXMODEPMOSOFF_SHIFT                                       21                                                  /**< Shift value for RAC_TXMODEPMOSOFF           */
#define _RAC_TX_TXMODEPMOSOFF_MASK                                        0x200000UL                                          /**< Bit mask for RAC_TXMODEPMOSOFF              */
#define _RAC_TX_TXMODEPMOSOFF_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXMODEPMOSOFF_disable                                     0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_TXMODEPMOSOFF_enable                                      0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_TXMODEPMOSOFF_DEFAULT                                      (_RAC_TX_TXMODEPMOSOFF_DEFAULT << 21)               /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXMODEPMOSOFF_disable                                      (_RAC_TX_TXMODEPMOSOFF_disable << 21)               /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_TXMODEPMOSOFF_enable                                       (_RAC_TX_TXMODEPMOSOFF_enable << 21)                /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_TXSWPENDACI                                                (0x1UL << 24)                                       /**< TXSWPENDACI                                 */
#define _RAC_TX_TXSWPENDACI_SHIFT                                         24                                                  /**< Shift value for RAC_TXSWPENDACI             */
#define _RAC_TX_TXSWPENDACI_MASK                                          0x1000000UL                                         /**< Bit mask for RAC_TXSWPENDACI                */
#define _RAC_TX_TXSWPENDACI_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXSWPENDACI_disabled                                      0x00000000UL                                        /**< Mode disabled for RAC_TX                    */
#define _RAC_TX_TXSWPENDACI_enabled                                       0x00000001UL                                        /**< Mode enabled for RAC_TX                     */
#define RAC_TX_TXSWPENDACI_DEFAULT                                        (_RAC_TX_TXSWPENDACI_DEFAULT << 24)                 /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXSWPENDACI_disabled                                       (_RAC_TX_TXSWPENDACI_disabled << 24)                /**< Shifted mode disabled for RAC_TX            */
#define RAC_TX_TXSWPENDACI_enabled                                        (_RAC_TX_TXSWPENDACI_enabled << 24)                 /**< Shifted mode enabled for RAC_TX             */
#define RAC_TX_TXSWPENDACQ                                                (0x1UL << 25)                                       /**< TXSWPENDACQ                                 */
#define _RAC_TX_TXSWPENDACQ_SHIFT                                         25                                                  /**< Shift value for RAC_TXSWPENDACQ             */
#define _RAC_TX_TXSWPENDACQ_MASK                                          0x2000000UL                                         /**< Bit mask for RAC_TXSWPENDACQ                */
#define _RAC_TX_TXSWPENDACQ_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXSWPENDACQ_disabled                                      0x00000000UL                                        /**< Mode disabled for RAC_TX                    */
#define _RAC_TX_TXSWPENDACQ_enabled                                       0x00000001UL                                        /**< Mode enabled for RAC_TX                     */
#define RAC_TX_TXSWPENDACQ_DEFAULT                                        (_RAC_TX_TXSWPENDACQ_DEFAULT << 25)                 /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXSWPENDACQ_disabled                                       (_RAC_TX_TXSWPENDACQ_disabled << 25)                /**< Shifted mode disabled for RAC_TX            */
#define RAC_TX_TXSWPENDACQ_enabled                                        (_RAC_TX_TXSWPENDACQ_enabled << 25)                 /**< Shifted mode enabled for RAC_TX             */
#define RAC_TX_TXENITCDAC                                                 (0x1UL << 26)                                       /**< TXENITCDAC                                  */
#define _RAC_TX_TXENITCDAC_SHIFT                                          26                                                  /**< Shift value for RAC_TXENITCDAC              */
#define _RAC_TX_TXENITCDAC_MASK                                           0x4000000UL                                         /**< Bit mask for RAC_TXENITCDAC                 */
#define _RAC_TX_TXENITCDAC_DEFAULT                                        0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENITCDAC_disabled                                       0x00000000UL                                        /**< Mode disabled for RAC_TX                    */
#define _RAC_TX_TXENITCDAC_enabled                                        0x00000001UL                                        /**< Mode enabled for RAC_TX                     */
#define RAC_TX_TXENITCDAC_DEFAULT                                         (_RAC_TX_TXENITCDAC_DEFAULT << 26)                  /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENITCDAC_disabled                                        (_RAC_TX_TXENITCDAC_disabled << 26)                 /**< Shifted mode disabled for RAC_TX            */
#define RAC_TX_TXENITCDAC_enabled                                         (_RAC_TX_TXENITCDAC_enabled << 26)                  /**< Shifted mode enabled for RAC_TX             */
#define RAC_TX_TXENITCPA                                                  (0x1UL << 27)                                       /**< TXENITCPA                                   */
#define _RAC_TX_TXENITCPA_SHIFT                                           27                                                  /**< Shift value for RAC_TXENITCPA               */
#define _RAC_TX_TXENITCPA_MASK                                            0x8000000UL                                         /**< Bit mask for RAC_TXENITCPA                  */
#define _RAC_TX_TXENITCPA_DEFAULT                                         0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENITCPA_disabled                                        0x00000000UL                                        /**< Mode disabled for RAC_TX                    */
#define _RAC_TX_TXENITCPA_enabled                                         0x00000001UL                                        /**< Mode enabled for RAC_TX                     */
#define RAC_TX_TXENITCPA_DEFAULT                                          (_RAC_TX_TXENITCPA_DEFAULT << 27)                   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENITCPA_disabled                                         (_RAC_TX_TXENITCPA_disabled << 27)                  /**< Shifted mode disabled for RAC_TX            */
#define RAC_TX_TXENITCPA_enabled                                          (_RAC_TX_TXENITCPA_enabled << 27)                   /**< Shifted mode enabled for RAC_TX             */
#define RAC_TX_TXENITCCORE                                                (0x1UL << 28)                                       /**< TXENITCCORE                                 */
#define _RAC_TX_TXENITCCORE_SHIFT                                         28                                                  /**< Shift value for RAC_TXENITCCORE             */
#define _RAC_TX_TXENITCCORE_MASK                                          0x10000000UL                                        /**< Bit mask for RAC_TXENITCCORE                */
#define _RAC_TX_TXENITCCORE_DEFAULT                                       0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_TXENITCCORE_disabled                                      0x00000000UL                                        /**< Mode disabled for RAC_TX                    */
#define _RAC_TX_TXENITCCORE_enabled                                       0x00000001UL                                        /**< Mode enabled for RAC_TX                     */
#define RAC_TX_TXENITCCORE_DEFAULT                                        (_RAC_TX_TXENITCCORE_DEFAULT << 28)                 /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_TXENITCCORE_disabled                                       (_RAC_TX_TXENITCCORE_disabled << 28)                /**< Shifted mode disabled for RAC_TX            */
#define RAC_TX_TXENITCCORE_enabled                                        (_RAC_TX_TXENITCCORE_enabled << 28)                 /**< Shifted mode enabled for RAC_TX             */
#define RAC_TX_ENPAPOWER                                                  (0x1UL << 30)                                       /**< Override                                    */
#define _RAC_TX_ENPAPOWER_SHIFT                                           30                                                  /**< Shift value for RAC_ENPAPOWER               */
#define _RAC_TX_ENPAPOWER_MASK                                            0x40000000UL                                        /**< Bit mask for RAC_ENPAPOWER                  */
#define _RAC_TX_ENPAPOWER_DEFAULT                                         0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPAPOWER_DEFAULT                                          (_RAC_TX_ENPAPOWER_DEFAULT << 30)                   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_ENPASELSLICE                                               (0x1UL << 31)                                       /**< Override                                    */
#define _RAC_TX_ENPASELSLICE_SHIFT                                        31                                                  /**< Shift value for RAC_ENPASELSLICE            */
#define _RAC_TX_ENPASELSLICE_MASK                                         0x80000000UL                                        /**< Bit mask for RAC_ENPASELSLICE               */
#define _RAC_TX_ENPASELSLICE_DEFAULT                                      0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPASELSLICE_DEFAULT                                       (_RAC_TX_ENPASELSLICE_DEFAULT << 31)                /**< Shifted mode DEFAULT for RAC_TX             */

