SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC AGCOVERWRITE1 */
#define _RAC_AGCOVERWRITE1_RESETVALUE                                     0x00000000UL                                       /**< Default value for RAC_AGCOVERWRITE1         */
#define _RAC_AGCOVERWRITE1_MASK                                           0x3FFF3FFFUL                                       /**< Mask for RAC_AGCOVERWRITE1                  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_SHIFT                          0                                                  /**< Shift value for RAC_MANLNAMIXRFATT0         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_MASK                           0x3FFFUL                                           /**< Bit mask for RAC_MANLNAMIXRFATT0            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                         (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_SHIFT                          16                                                 /**< Shift value for RAC_MANLNAMIXRFATT1         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_MASK                           0x3FFF0000UL                                       /**< Bit mask for RAC_MANLNAMIXRFATT1            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                         (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */

/* Bit fields for RAC TXOGNDPKD */
#define _RAC_TXOGNDPKD_RESETVALUE                                         0x00000000UL                                           /**< Default value for RAC_TXOGNDPKD             */
#define _RAC_TXOGNDPKD_MASK                                               0x000001FFUL                                           /**< Mask for RAC_TXOGNDPKD                      */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_SHIFT                              0                                                      /**< Shift value for RAC_TXPKDOGNDTHRESH         */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_MASK                               0xFUL                                                  /**< Bit mask for RAC_TXPKDOGNDTHRESH            */
#define _RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT                            0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT                             (_RAC_TXOGNDPKD_TXPKDOGNDTHRESH_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH                                (0x1UL << 4)                                           /**< TXPKDOGNDBYPASSLATCH                        */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_SHIFT                         4                                                      /**< Shift value for RAC_TXPKDOGNDBYPASSLATCH    */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_MASK                          0x10UL                                                 /**< Bit mask for RAC_TXPKDOGNDBYPASSLATCH       */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT                       0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable                       0x00000000UL                                           /**< Mode disable for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable                        0x00000001UL                                           /**< Mode enable for RAC_TXOGNDPKD               */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT                        (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable                        (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_disable << 4)     /**< Shifted mode disable for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable                         (_RAC_TXOGNDPKD_TXPKDOGNDBYPASSLATCH_enable << 4)      /**< Shifted mode enable for RAC_TXOGNDPKD       */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE                                       (0x1UL << 5)                                           /**< TXPKDOGNDTYPE                               */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_SHIFT                                5                                                      /**< Shift value for RAC_TXPKDOGNDTYPE           */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_MASK                                 0x20UL                                                 /**< Bit mask for RAC_TXPKDOGNDTYPE              */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT                              0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative                             0x00000000UL                                           /**< Mode negative for RAC_TXOGNDPKD             */
#define _RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive                             0x00000001UL                                           /**< Mode positive for RAC_TXOGNDPKD             */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT                               (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_DEFAULT << 5)            /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative                              (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_negative << 5)           /**< Shifted mode negative for RAC_TXOGNDPKD     */
#define RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive                              (_RAC_TXOGNDPKD_TXPKDOGNDTYPE_positive << 5)           /**< Shifted mode positive for RAC_TXOGNDPKD     */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET                                      (0x1UL << 6)                                           /**< TXPKDOGNDRESET                              */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_SHIFT                               6                                                      /**< Shift value for RAC_TXPKDOGNDRESET          */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_MASK                                0x40UL                                                 /**< Bit mask for RAC_TXPKDOGNDRESET             */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT                             0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_latch                               0x00000000UL                                           /**< Mode latch for RAC_TXOGNDPKD                */
#define _RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch                         0x00000001UL                                           /**< Mode reset_latch for RAC_TXOGNDPKD          */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT                              (_RAC_TXOGNDPKD_TXPKDOGNDRESET_DEFAULT << 6)           /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_latch                                (_RAC_TXOGNDPKD_TXPKDOGNDRESET_latch << 6)             /**< Shifted mode latch for RAC_TXOGNDPKD        */
#define RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch                          (_RAC_TXOGNDPKD_TXPKDOGNDRESET_reset_latch << 6)       /**< Shifted mode reset_latch for RAC_TXOGNDPKD  */
#define RAC_TXOGNDPKD_TXPKDOGNDATTEN                                      (0x1UL << 7)                                           /**< TXPKDOGNDATTEN                              */
#define _RAC_TXOGNDPKD_TXPKDOGNDATTEN_SHIFT                               7                                                      /**< Shift value for RAC_TXPKDOGNDATTEN          */
#define _RAC_TXOGNDPKD_TXPKDOGNDATTEN_MASK                                0x80UL                                                 /**< Bit mask for RAC_TXPKDOGNDATTEN             */
#define _RAC_TXOGNDPKD_TXPKDOGNDATTEN_DEFAULT                             0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDATTEN_disable                             0x00000000UL                                           /**< Mode disable for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDATTEN_enable                              0x00000001UL                                           /**< Mode enable for RAC_TXOGNDPKD               */
#define RAC_TXOGNDPKD_TXPKDOGNDATTEN_DEFAULT                              (_RAC_TXOGNDPKD_TXPKDOGNDATTEN_DEFAULT << 7)           /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDATTEN_disable                              (_RAC_TXOGNDPKD_TXPKDOGNDATTEN_disable << 7)           /**< Shifted mode disable for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDATTEN_enable                               (_RAC_TXOGNDPKD_TXPKDOGNDATTEN_enable << 7)            /**< Shifted mode enable for RAC_TXOGNDPKD       */
#define RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH                                    (0x1UL << 8)                                           /**< TXPKDOGNDCLKHIGH                            */
#define _RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_SHIFT                             8                                                      /**< Shift value for RAC_TXPKDOGNDCLKHIGH        */
#define _RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_MASK                              0x100UL                                                /**< Bit mask for RAC_TXPKDOGNDCLKHIGH           */
#define _RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_DEFAULT                           0x00000000UL                                           /**< Mode DEFAULT for RAC_TXOGNDPKD              */
#define _RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_dis                   0x00000000UL                                           /**< Mode set_clkhigh_dis for RAC_TXOGNDPKD      */
#define _RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_en                    0x00000001UL                                           /**< Mode set_clkhigh_en for RAC_TXOGNDPKD       */
#define RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_DEFAULT                            (_RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_DEFAULT << 8)         /**< Shifted mode DEFAULT for RAC_TXOGNDPKD      */
#define RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_dis                    (_RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_dis << 8) /**< Shifted mode set_clkhigh_dis for RAC_TXOGNDPKD*/
#define RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_en                     (_RAC_TXOGNDPKD_TXPKDOGNDCLKHIGH_set_clkhigh_en << 8)  /**< Shifted mode set_clkhigh_en for RAC_TXOGNDPKD*/

