SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXOGNDPKDSTATUS */
#define _RAC_TXOGNDPKDSTATUS_RESETVALUE                                   0x00000001UL                                   /**< Default value for RAC_TXOGNDPKDSTATUS       */
#define _RAC_TXOGNDPKDSTATUS_MASK                                         0x00000003UL                                   /**< Mask for RAC_TXOGNDPKDSTATUS                */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN                                    (0x1UL << 0)                                   /**< TXOGNDPKDN                                  */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_SHIFT                             0                                              /**< Shift value for RAC_TXOGNDPKDN              */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_MASK                              0x1UL                                          /**< Bit mask for RAC_TXOGNDPKDN                 */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT                           0x00000001UL                                   /**< Mode DEFAULT for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped                            0x00000000UL                                   /**< Mode triped for RAC_TXOGNDPKDSTATUS         */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip                           0x00000001UL                                   /**< Mode no_trip for RAC_TXOGNDPKDSTATUS        */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT                            (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped                             (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_triped << 0)  /**< Shifted mode triped for RAC_TXOGNDPKDSTATUS */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip                            (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDN_no_trip << 0) /**< Shifted mode no_trip for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP                                    (0x1UL << 1)                                   /**< TXOGNDPKDP                                  */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_SHIFT                             1                                              /**< Shift value for RAC_TXOGNDPKDP              */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_MASK                              0x2UL                                          /**< Bit mask for RAC_TXOGNDPKDP                 */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT                           0x00000000UL                                   /**< Mode DEFAULT for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip                           0x00000000UL                                   /**< Mode no_trip for RAC_TXOGNDPKDSTATUS        */
#define _RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped                           0x00000001UL                                   /**< Mode tripped for RAC_TXOGNDPKDSTATUS        */
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT                            (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip                            (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_no_trip << 1) /**< Shifted mode no_trip for RAC_TXOGNDPKDSTATUS*/
#define RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped                            (_RAC_TXOGNDPKDSTATUS_TXOGNDPKDP_tripped << 1) /**< Shifted mode tripped for RAC_TXOGNDPKDSTATUS*/

/* Bit fields for RAC GPPLLCLKRETIMECTRL */
#define _RAC_GPPLLCLKRETIMECTRL_RESETVALUE                                0x00000000UL                                                          /**< Default value for RAC_GPPLLCLKRETIMECTRL    */
#define _RAC_GPPLLCLKRETIMECTRL_MASK                                      0x00000777UL                                                          /**< Mask for RAC_GPPLLCLKRETIMECTRL             */
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME                     (0x1UL << 0)                                                          /**< GPPLLCLKRETIMEENRETIME                      */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_SHIFT              0                                                                     /**< Shift value for RAC_GPPLLCLKRETIMEENRETIME  */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_MASK               0x1UL                                                                 /**< Bit mask for RAC_GPPLLCLKRETIMEENRETIME     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_DEFAULT            0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMECTRL     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_disable            0x00000000UL                                                          /**< Mode disable for RAC_GPPLLCLKRETIMECTRL     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_enable             0x00000001UL                                                          /**< Mode enable for RAC_GPPLLCLKRETIMECTRL      */
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_DEFAULT             (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_disable             (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_disable << 0)         /**< Shifted mode disable for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_enable              (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEENRETIME_enable << 0)          /**< Shifted mode enable for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME                    (0x1UL << 1)                                                          /**< GPPLLCLKRETIMEDISRETIME                     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_SHIFT             1                                                                     /**< Shift value for RAC_GPPLLCLKRETIMEDISRETIME */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_MASK              0x2UL                                                                 /**< Bit mask for RAC_GPPLLCLKRETIMEDISRETIME    */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_DEFAULT           0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMECTRL     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_enable_retime     0x00000000UL                                                          /**< Mode enable_retime for RAC_GPPLLCLKRETIMECTRL*/
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_disable_retime    0x00000001UL                                                          /**< Mode disable_retime for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_DEFAULT            (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_DEFAULT << 1)        /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_enable_retime      (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_enable_retime << 1)  /**< Shifted mode enable_retime for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_disable_retime     (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMEDISRETIME_disable_retime << 1) /**< Shifted mode disable_retime for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN                       (0x1UL << 2)                                                          /**< GPPLLCLKRETIMERESETN                        */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_SHIFT                2                                                                     /**< Shift value for RAC_GPPLLCLKRETIMERESETN    */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_MASK                 0x4UL                                                                 /**< Bit mask for RAC_GPPLLCLKRETIMERESETN       */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_DEFAULT              0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMECTRL     */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_disable_output3      0x00000000UL                                                          /**< Mode disable_output3 for RAC_GPPLLCLKRETIMECTRL*/
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_enable_output3       0x00000001UL                                                          /**< Mode enable_output3 for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_DEFAULT               (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_DEFAULT << 2)           /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_disable_output3       (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_disable_output3 << 2)   /**< Shifted mode disable_output3 for RAC_GPPLLCLKRETIMECTRL*/
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_enable_output3        (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMERESETN_enable_output3 << 2)    /**< Shifted mode enable_output3 for RAC_GPPLLCLKRETIMECTRL*/
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITH_SHIFT                4                                                                     /**< Shift value for RAC_GPPLLCLKRETIMELIMITH    */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITH_MASK                 0x70UL                                                                /**< Bit mask for RAC_GPPLLCLKRETIMELIMITH       */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITH_DEFAULT              0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMECTRL     */
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITH_DEFAULT               (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITH_DEFAULT << 4)           /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMECTRL*/
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITL_SHIFT                8                                                                     /**< Shift value for RAC_GPPLLCLKRETIMELIMITL    */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITL_MASK                 0x700UL                                                               /**< Bit mask for RAC_GPPLLCLKRETIMELIMITL       */
#define _RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITL_DEFAULT              0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMECTRL     */
#define RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITL_DEFAULT               (_RAC_GPPLLCLKRETIMECTRL_GPPLLCLKRETIMELIMITL_DEFAULT << 8)           /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMECTRL*/

/* Bit fields for RAC GPPLLCLKRETIMESTATUS */
#define _RAC_GPPLLCLKRETIMESTATUS_RESETVALUE                              0x00000000UL                                                          /**< Default value for RAC_GPPLLCLKRETIMESTATUS  */
#define _RAC_GPPLLCLKRETIMESTATUS_MASK                                    0x00000003UL                                                          /**< Mask for RAC_GPPLLCLKRETIMESTATUS           */
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL                     (0x1UL << 0)                                                          /**< GPPLLCLKRETIMECLKSEL                        */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_SHIFT              0                                                                     /**< Shift value for RAC_GPPLLCLKRETIMECLKSEL    */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_MASK               0x1UL                                                                 /**< Bit mask for RAC_GPPLLCLKRETIMECLKSEL       */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_DEFAULT            0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMESTATUS   */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_raw_clk        0x00000000UL                                                          /**< Mode use_raw_clk for RAC_GPPLLCLKRETIMESTATUS*/
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_retimed_clk    0x00000001UL                                                          /**< Mode use_retimed_clk for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_DEFAULT             (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_raw_clk         (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_raw_clk << 0)     /**< Shifted mode use_raw_clk for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_retimed_clk     (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMECLKSEL_use_retimed_clk << 0) /**< Shifted mode use_retimed_clk for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO                   (0x1UL << 1)                                                          /**< GPPLLCLKRETIMERESETNLO                      */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_SHIFT            1                                                                     /**< Shift value for RAC_GPPLLCLKRETIMERESETNLO  */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_MASK             0x2UL                                                                 /**< Bit mask for RAC_GPPLLCLKRETIMERESETNLO     */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_DEFAULT          0x00000000UL                                                          /**< Mode DEFAULT for RAC_GPPLLCLKRETIMESTATUS   */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_lo               0x00000000UL                                                          /**< Mode lo for RAC_GPPLLCLKRETIMESTATUS        */
#define _RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_hi               0x00000001UL                                                          /**< Mode hi for RAC_GPPLLCLKRETIMESTATUS        */
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_DEFAULT           (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_DEFAULT << 1)       /**< Shifted mode DEFAULT for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_lo                (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_lo << 1)            /**< Shifted mode lo for RAC_GPPLLCLKRETIMESTATUS*/
#define RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_hi                (_RAC_GPPLLCLKRETIMESTATUS_GPPLLCLKRETIMERESETNLO_hi << 1)            /**< Shifted mode hi for RAC_GPPLLCLKRETIMESTATUS*/

