SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC PATRIM6 */
#define _RAC_PATRIM6_RESETVALUE                                           0x000451A0UL                                   /**< Default value for RAC_PATRIM6               */
#define _RAC_PATRIM6_MASK                                                 0xFF3FF3FEUL                                   /**< Mask for RAC_PATRIM6                        */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_SHIFT                             1                                              /**< Shift value for RAC_TXTRIMBBDIGREGIOUT      */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_MASK                              0x6UL                                          /**< Bit mask for RAC_TXTRIMBBDIGREGIOUT         */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_DEFAULT                           0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i050u                             0x00000000UL                                   /**< Mode i050u for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i100u                             0x00000001UL                                   /**< Mode i100u for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i150u                             0x00000002UL                                   /**< Mode i150u for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i200u                             0x00000003UL                                   /**< Mode i200u for RAC_PATRIM6                  */
#define RAC_PATRIM6_TXTRIMBBDIGREGIOUT_DEFAULT                            (_RAC_PATRIM6_TXTRIMBBDIGREGIOUT_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i050u                              (_RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i050u << 1)   /**< Shifted mode i050u for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i100u                              (_RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i100u << 1)   /**< Shifted mode i100u for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i150u                              (_RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i150u << 1)   /**< Shifted mode i150u for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i200u                              (_RAC_PATRIM6_TXTRIMBBDIGREGIOUT_i200u << 1)   /**< Shifted mode i200u for RAC_PATRIM6          */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_SHIFT                                3                                              /**< Shift value for RAC_TXTRIMBBREGVREF         */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_MASK                                 0x38UL                                         /**< Bit mask for RAC_TXTRIMBBREGVREF            */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_DEFAULT                              0x00000004UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_900m                               0x00000000UL                                   /**< Mode v_900m for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_912p5m                             0x00000001UL                                   /**< Mode v_912p5m for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_925m                               0x00000002UL                                   /**< Mode v_925m for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_937p5m                             0x00000003UL                                   /**< Mode v_937p5m for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_950m                               0x00000004UL                                   /**< Mode v_950m for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_962p5m                             0x00000005UL                                   /**< Mode v_962p5m for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_975m                               0x00000006UL                                   /**< Mode v_975m for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBBREGVREF_v_987p5m                             0x00000007UL                                   /**< Mode v_987p5m for RAC_PATRIM6               */
#define RAC_PATRIM6_TXTRIMBBREGVREF_DEFAULT                               (_RAC_PATRIM6_TXTRIMBBREGVREF_DEFAULT << 3)    /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_900m                                (_RAC_PATRIM6_TXTRIMBBREGVREF_v_900m << 3)     /**< Shifted mode v_900m for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_912p5m                              (_RAC_PATRIM6_TXTRIMBBREGVREF_v_912p5m << 3)   /**< Shifted mode v_912p5m for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_925m                                (_RAC_PATRIM6_TXTRIMBBREGVREF_v_925m << 3)     /**< Shifted mode v_925m for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_937p5m                              (_RAC_PATRIM6_TXTRIMBBREGVREF_v_937p5m << 3)   /**< Shifted mode v_937p5m for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_950m                                (_RAC_PATRIM6_TXTRIMBBREGVREF_v_950m << 3)     /**< Shifted mode v_950m for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_962p5m                              (_RAC_PATRIM6_TXTRIMBBREGVREF_v_962p5m << 3)   /**< Shifted mode v_962p5m for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_975m                                (_RAC_PATRIM6_TXTRIMBBREGVREF_v_975m << 3)     /**< Shifted mode v_975m for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBBREGVREF_v_987p5m                              (_RAC_PATRIM6_TXTRIMBBREGVREF_v_987p5m << 3)   /**< Shifted mode v_987p5m for RAC_PATRIM6       */
#define _RAC_PATRIM6_TXTRIMBBREGFB_SHIFT                                  6                                              /**< Shift value for RAC_TXTRIMBBREGFB           */
#define _RAC_PATRIM6_TXTRIMBBREGFB_MASK                                   0x3C0UL                                        /**< Bit mask for RAC_TXTRIMBBREGFB              */
#define _RAC_PATRIM6_TXTRIMBBREGFB_DEFAULT                                0x00000006UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p97                                  0x00000000UL                                   /**< Mode v1p97 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p89                                  0x00000001UL                                   /**< Mode v1p89 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p81                                  0x00000002UL                                   /**< Mode v1p81 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p72                                  0x00000003UL                                   /**< Mode v1p72 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p65                                  0x00000004UL                                   /**< Mode v1p65 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p58                                  0x00000005UL                                   /**< Mode v1p58 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p52                                  0x00000006UL                                   /**< Mode v1p52 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p46                                  0x00000007UL                                   /**< Mode v1p46 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p41                                  0x00000008UL                                   /**< Mode v1p41 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p36                                  0x00000009UL                                   /**< Mode v1p36 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p31                                  0x0000000AUL                                   /**< Mode v1p31 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p27                                  0x0000000BUL                                   /**< Mode v1p27 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p22                                  0x0000000CUL                                   /**< Mode v1p22 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p19                                  0x0000000DUL                                   /**< Mode v1p19 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p15                                  0x0000000EUL                                   /**< Mode v1p15 for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMBBREGFB_v1p11                                  0x0000000FUL                                   /**< Mode v1p11 for RAC_PATRIM6                  */
#define RAC_PATRIM6_TXTRIMBBREGFB_DEFAULT                                 (_RAC_PATRIM6_TXTRIMBBREGFB_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p97                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p97 << 6)        /**< Shifted mode v1p97 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p89                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p89 << 6)        /**< Shifted mode v1p89 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p81                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p81 << 6)        /**< Shifted mode v1p81 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p72                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p72 << 6)        /**< Shifted mode v1p72 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p65                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p65 << 6)        /**< Shifted mode v1p65 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p58                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p58 << 6)        /**< Shifted mode v1p58 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p52                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p52 << 6)        /**< Shifted mode v1p52 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p46                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p46 << 6)        /**< Shifted mode v1p46 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p41                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p41 << 6)        /**< Shifted mode v1p41 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p36                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p36 << 6)        /**< Shifted mode v1p36 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p31                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p31 << 6)        /**< Shifted mode v1p31 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p27                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p27 << 6)        /**< Shifted mode v1p27 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p22                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p22 << 6)        /**< Shifted mode v1p22 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p19                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p19 << 6)        /**< Shifted mode v1p19 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p15                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p15 << 6)        /**< Shifted mode v1p15 for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMBBREGFB_v1p11                                   (_RAC_PATRIM6_TXTRIMBBREGFB_v1p11 << 6)        /**< Shifted mode v1p11 for RAC_PATRIM6          */
#define _RAC_PATRIM6_TXTRIMFILVCOM_SHIFT                                  12                                             /**< Shift value for RAC_TXTRIMFILVCOM           */
#define _RAC_PATRIM6_TXTRIMFILVCOM_MASK                                   0xF000UL                                       /**< Bit mask for RAC_TXTRIMFILVCOM              */
#define _RAC_PATRIM6_TXTRIMFILVCOM_DEFAULT                                0x00000005UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v300m                                  0x00000000UL                                   /**< Mode v300m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v333m                                  0x00000001UL                                   /**< Mode v333m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v367m                                  0x00000002UL                                   /**< Mode v367m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v400m                                  0x00000003UL                                   /**< Mode v400m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v433m                                  0x00000004UL                                   /**< Mode v433m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v466m                                  0x00000005UL                                   /**< Mode v466m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v500m                                  0x00000006UL                                   /**< Mode v500m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v533m                                  0x00000007UL                                   /**< Mode v533m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v566m                                  0x00000008UL                                   /**< Mode v566m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v599m                                  0x00000009UL                                   /**< Mode v599m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v631m                                  0x0000000AUL                                   /**< Mode v631m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v664m                                  0x0000000BUL                                   /**< Mode v664m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v696m                                  0x0000000CUL                                   /**< Mode v696m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v728m                                  0x0000000DUL                                   /**< Mode v728m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v760m                                  0x0000000EUL                                   /**< Mode v760m for RAC_PATRIM6                  */
#define _RAC_PATRIM6_TXTRIMFILVCOM_v790m                                  0x0000000FUL                                   /**< Mode v790m for RAC_PATRIM6                  */
#define RAC_PATRIM6_TXTRIMFILVCOM_DEFAULT                                 (_RAC_PATRIM6_TXTRIMFILVCOM_DEFAULT << 12)     /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMFILVCOM_v300m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v300m << 12)       /**< Shifted mode v300m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v333m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v333m << 12)       /**< Shifted mode v333m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v367m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v367m << 12)       /**< Shifted mode v367m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v400m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v400m << 12)       /**< Shifted mode v400m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v433m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v433m << 12)       /**< Shifted mode v433m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v466m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v466m << 12)       /**< Shifted mode v466m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v500m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v500m << 12)       /**< Shifted mode v500m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v533m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v533m << 12)       /**< Shifted mode v533m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v566m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v566m << 12)       /**< Shifted mode v566m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v599m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v599m << 12)       /**< Shifted mode v599m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v631m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v631m << 12)       /**< Shifted mode v631m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v664m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v664m << 12)       /**< Shifted mode v664m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v696m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v696m << 12)       /**< Shifted mode v696m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v728m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v728m << 12)       /**< Shifted mode v728m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v760m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v760m << 12)       /**< Shifted mode v760m for RAC_PATRIM6          */
#define RAC_PATRIM6_TXTRIMFILVCOM_v790m                                   (_RAC_PATRIM6_TXTRIMFILVCOM_v790m << 12)       /**< Shifted mode v790m for RAC_PATRIM6          */
#define _RAC_PATRIM6_TXTRIMFILCAP_SHIFT                                   16                                             /**< Shift value for RAC_TXTRIMFILCAP            */
#define _RAC_PATRIM6_TXTRIMFILCAP_MASK                                    0x30000UL                                      /**< Bit mask for RAC_TXTRIMFILCAP               */
#define _RAC_PATRIM6_TXTRIMFILCAP_DEFAULT                                 0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMFILCAP_C_1                                     0x00000000UL                                   /**< Mode C_1 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILCAP_C_2                                     0x00000001UL                                   /**< Mode C_2 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILCAP_C_3                                     0x00000002UL                                   /**< Mode C_3 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILCAP_C_4                                     0x00000003UL                                   /**< Mode C_4 for RAC_PATRIM6                    */
#define RAC_PATRIM6_TXTRIMFILCAP_DEFAULT                                  (_RAC_PATRIM6_TXTRIMFILCAP_DEFAULT << 16)      /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMFILCAP_C_1                                      (_RAC_PATRIM6_TXTRIMFILCAP_C_1 << 16)          /**< Shifted mode C_1 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILCAP_C_2                                      (_RAC_PATRIM6_TXTRIMFILCAP_C_2 << 16)          /**< Shifted mode C_2 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILCAP_C_3                                      (_RAC_PATRIM6_TXTRIMFILCAP_C_3 << 16)          /**< Shifted mode C_3 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILCAP_C_4                                      (_RAC_PATRIM6_TXTRIMFILCAP_C_4 << 16)          /**< Shifted mode C_4 for RAC_PATRIM6            */
#define _RAC_PATRIM6_TXTRIMFILGAIN_SHIFT                                  18                                             /**< Shift value for RAC_TXTRIMFILGAIN           */
#define _RAC_PATRIM6_TXTRIMFILGAIN_MASK                                   0xC0000UL                                      /**< Bit mask for RAC_TXTRIMFILGAIN              */
#define _RAC_PATRIM6_TXTRIMFILGAIN_DEFAULT                                0x00000001UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMFILGAIN_minus9p5db                             0x00000000UL                                   /**< Mode minus9p5db for RAC_PATRIM6             */
#define _RAC_PATRIM6_TXTRIMFILGAIN_minus6db                               0x00000001UL                                   /**< Mode minus6db for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMFILGAIN_minus2p5db                             0x00000002UL                                   /**< Mode minus2p5db for RAC_PATRIM6             */
#define _RAC_PATRIM6_TXTRIMFILGAIN_plus1db                                0x00000003UL                                   /**< Mode plus1db for RAC_PATRIM6                */
#define RAC_PATRIM6_TXTRIMFILGAIN_DEFAULT                                 (_RAC_PATRIM6_TXTRIMFILGAIN_DEFAULT << 18)     /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMFILGAIN_minus9p5db                              (_RAC_PATRIM6_TXTRIMFILGAIN_minus9p5db << 18)  /**< Shifted mode minus9p5db for RAC_PATRIM6     */
#define RAC_PATRIM6_TXTRIMFILGAIN_minus6db                                (_RAC_PATRIM6_TXTRIMFILGAIN_minus6db << 18)    /**< Shifted mode minus6db for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMFILGAIN_minus2p5db                              (_RAC_PATRIM6_TXTRIMFILGAIN_minus2p5db << 18)  /**< Shifted mode minus2p5db for RAC_PATRIM6     */
#define RAC_PATRIM6_TXTRIMFILGAIN_plus1db                                 (_RAC_PATRIM6_TXTRIMFILGAIN_plus1db << 18)     /**< Shifted mode plus1db for RAC_PATRIM6        */
#define _RAC_PATRIM6_TXTRIMFILRES_SHIFT                                   20                                             /**< Shift value for RAC_TXTRIMFILRES            */
#define _RAC_PATRIM6_TXTRIMFILRES_MASK                                    0x300000UL                                     /**< Bit mask for RAC_TXTRIMFILRES               */
#define _RAC_PATRIM6_TXTRIMFILRES_DEFAULT                                 0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMFILRES_R_0                                     0x00000000UL                                   /**< Mode R_0 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILRES_R_1                                     0x00000001UL                                   /**< Mode R_1 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILRES_R_2                                     0x00000002UL                                   /**< Mode R_2 for RAC_PATRIM6                    */
#define _RAC_PATRIM6_TXTRIMFILRES_R_3                                     0x00000003UL                                   /**< Mode R_3 for RAC_PATRIM6                    */
#define RAC_PATRIM6_TXTRIMFILRES_DEFAULT                                  (_RAC_PATRIM6_TXTRIMFILRES_DEFAULT << 20)      /**< Shifted mode DEFAULT for RAC_PATRIM6        */
