SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
#define RAC_PATRIM6_TXTRIMFILRES_R_0                                      (_RAC_PATRIM6_TXTRIMFILRES_R_0 << 20)          /**< Shifted mode R_0 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILRES_R_1                                      (_RAC_PATRIM6_TXTRIMFILRES_R_1 << 20)          /**< Shifted mode R_1 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILRES_R_2                                      (_RAC_PATRIM6_TXTRIMFILRES_R_2 << 20)          /**< Shifted mode R_2 for RAC_PATRIM6            */
#define RAC_PATRIM6_TXTRIMFILRES_R_3                                      (_RAC_PATRIM6_TXTRIMFILRES_R_3 << 20)          /**< Shifted mode R_3 for RAC_PATRIM6            */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_SHIFT                                 24                                             /**< Shift value for RAC_TXTRIMBIASNMAX          */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_MASK                                  0xF000000UL                                    /**< Bit mask for RAC_TXTRIMBIASNMAX             */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_DEFAULT                               0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_0u                                0x00000000UL                                   /**< Mode add_0u for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_2p5u                              0x00000001UL                                   /**< Mode add_2p5u for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_5u                                0x00000002UL                                   /**< Mode add_5u for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_7p5u                              0x00000003UL                                   /**< Mode add_7p5u for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_10u                               0x00000004UL                                   /**< Mode add_10u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_12p5u                             0x00000005UL                                   /**< Mode add_12p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_15p                               0x00000006UL                                   /**< Mode add_15p for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_17p5u                             0x00000007UL                                   /**< Mode add_17p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_20u                               0x00000008UL                                   /**< Mode add_20u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_22p5u                             0x00000009UL                                   /**< Mode add_22p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_25u                               0x0000000AUL                                   /**< Mode add_25u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_27p5u                             0x0000000BUL                                   /**< Mode add_27p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_30u                               0x0000000CUL                                   /**< Mode add_30u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_32p5u                             0x0000000DUL                                   /**< Mode add_32p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_35u                               0x0000000EUL                                   /**< Mode add_35u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASNMAX_add_37p5u                             0x0000000FUL                                   /**< Mode add_37p5u for RAC_PATRIM6              */
#define RAC_PATRIM6_TXTRIMBIASNMAX_DEFAULT                                (_RAC_PATRIM6_TXTRIMBIASNMAX_DEFAULT << 24)    /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_0u                                 (_RAC_PATRIM6_TXTRIMBIASNMAX_add_0u << 24)     /**< Shifted mode add_0u for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_2p5u                               (_RAC_PATRIM6_TXTRIMBIASNMAX_add_2p5u << 24)   /**< Shifted mode add_2p5u for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_5u                                 (_RAC_PATRIM6_TXTRIMBIASNMAX_add_5u << 24)     /**< Shifted mode add_5u for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_7p5u                               (_RAC_PATRIM6_TXTRIMBIASNMAX_add_7p5u << 24)   /**< Shifted mode add_7p5u for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_10u                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_10u << 24)    /**< Shifted mode add_10u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_12p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_12p5u << 24)  /**< Shifted mode add_12p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_15p                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_15p << 24)    /**< Shifted mode add_15p for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_17p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_17p5u << 24)  /**< Shifted mode add_17p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_20u                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_20u << 24)    /**< Shifted mode add_20u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_22p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_22p5u << 24)  /**< Shifted mode add_22p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_25u                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_25u << 24)    /**< Shifted mode add_25u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_27p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_27p5u << 24)  /**< Shifted mode add_27p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_30u                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_30u << 24)    /**< Shifted mode add_30u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_32p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_32p5u << 24)  /**< Shifted mode add_32p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_35u                                (_RAC_PATRIM6_TXTRIMBIASNMAX_add_35u << 24)    /**< Shifted mode add_35u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASNMAX_add_37p5u                              (_RAC_PATRIM6_TXTRIMBIASNMAX_add_37p5u << 24)  /**< Shifted mode add_37p5u for RAC_PATRIM6      */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_SHIFT                                 28                                             /**< Shift value for RAC_TXTRIMBIASPMAX          */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_MASK                                  0xF0000000UL                                   /**< Bit mask for RAC_TXTRIMBIASPMAX             */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_DEFAULT                               0x00000000UL                                   /**< Mode DEFAULT for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_0u                                0x00000000UL                                   /**< Mode add_0u for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_2p5u                              0x00000001UL                                   /**< Mode add_2p5u for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_5u                                0x00000002UL                                   /**< Mode add_5u for RAC_PATRIM6                 */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_7p5u                              0x00000003UL                                   /**< Mode add_7p5u for RAC_PATRIM6               */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_10u                               0x00000004UL                                   /**< Mode add_10u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_12p5u                             0x00000005UL                                   /**< Mode add_12p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_15p                               0x00000006UL                                   /**< Mode add_15p for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_17p5u                             0x00000007UL                                   /**< Mode add_17p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_20u                               0x00000008UL                                   /**< Mode add_20u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_22p5u                             0x00000009UL                                   /**< Mode add_22p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_25u                               0x0000000AUL                                   /**< Mode add_25u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_27p5u                             0x0000000BUL                                   /**< Mode add_27p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_30u                               0x0000000CUL                                   /**< Mode add_30u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_32p5u                             0x0000000DUL                                   /**< Mode add_32p5u for RAC_PATRIM6              */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_35u                               0x0000000EUL                                   /**< Mode add_35u for RAC_PATRIM6                */
#define _RAC_PATRIM6_TXTRIMBIASPMAX_add_37p5u                             0x0000000FUL                                   /**< Mode add_37p5u for RAC_PATRIM6              */
#define RAC_PATRIM6_TXTRIMBIASPMAX_DEFAULT                                (_RAC_PATRIM6_TXTRIMBIASPMAX_DEFAULT << 28)    /**< Shifted mode DEFAULT for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_0u                                 (_RAC_PATRIM6_TXTRIMBIASPMAX_add_0u << 28)     /**< Shifted mode add_0u for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_2p5u                               (_RAC_PATRIM6_TXTRIMBIASPMAX_add_2p5u << 28)   /**< Shifted mode add_2p5u for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_5u                                 (_RAC_PATRIM6_TXTRIMBIASPMAX_add_5u << 28)     /**< Shifted mode add_5u for RAC_PATRIM6         */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_7p5u                               (_RAC_PATRIM6_TXTRIMBIASPMAX_add_7p5u << 28)   /**< Shifted mode add_7p5u for RAC_PATRIM6       */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_10u                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_10u << 28)    /**< Shifted mode add_10u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_12p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_12p5u << 28)  /**< Shifted mode add_12p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_15p                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_15p << 28)    /**< Shifted mode add_15p for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_17p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_17p5u << 28)  /**< Shifted mode add_17p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_20u                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_20u << 28)    /**< Shifted mode add_20u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_22p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_22p5u << 28)  /**< Shifted mode add_22p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_25u                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_25u << 28)    /**< Shifted mode add_25u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_27p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_27p5u << 28)  /**< Shifted mode add_27p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_30u                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_30u << 28)    /**< Shifted mode add_30u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_32p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_32p5u << 28)  /**< Shifted mode add_32p5u for RAC_PATRIM6      */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_35u                                (_RAC_PATRIM6_TXTRIMBIASPMAX_add_35u << 28)    /**< Shifted mode add_35u for RAC_PATRIM6        */
#define RAC_PATRIM6_TXTRIMBIASPMAX_add_37p5u                              (_RAC_PATRIM6_TXTRIMBIASPMAX_add_37p5u << 28)  /**< Shifted mode add_37p5u for RAC_PATRIM6      */

