SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC PATRIM7 */
#define _RAC_PATRIM7_RESETVALUE                                           0x029C8015UL                                     /**< Default value for RAC_PATRIM7               */
#define _RAC_PATRIM7_MASK                                                 0x03FFC73FUL                                     /**< Mask for RAC_PATRIM7                        */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_SHIFT                                0                                                /**< Shift value for RAC_TXTRIMMIXGMBIAS         */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_MASK                                 0x3UL                                            /**< Bit mask for RAC_TXTRIMMIXGMBIAS            */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_DEFAULT                              0x00000001UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_gm500uA                              0x00000000UL                                     /**< Mode gm500uA for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_gm700uA                              0x00000001UL                                     /**< Mode gm700uA for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_1                             0x00000002UL                                     /**< Mode unused_1 for RAC_PATRIM7               */
#define _RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_2                             0x00000003UL                                     /**< Mode unused_2 for RAC_PATRIM7               */
#define RAC_PATRIM7_TXTRIMMIXGMBIAS_DEFAULT                               (_RAC_PATRIM7_TXTRIMMIXGMBIAS_DEFAULT << 0)      /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXGMBIAS_gm500uA                               (_RAC_PATRIM7_TXTRIMMIXGMBIAS_gm500uA << 0)      /**< Shifted mode gm500uA for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXGMBIAS_gm700uA                               (_RAC_PATRIM7_TXTRIMMIXGMBIAS_gm700uA << 0)      /**< Shifted mode gm700uA for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_1                              (_RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_1 << 0)     /**< Shifted mode unused_1 for RAC_PATRIM7       */
#define RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_2                              (_RAC_PATRIM7_TXTRIMMIXGMBIAS_unused_2 << 0)     /**< Shifted mode unused_2 for RAC_PATRIM7       */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_SHIFT                               2                                                /**< Shift value for RAC_TXTRIMMIXLOBIASI        */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_MASK                                0xCUL                                            /**< Bit mask for RAC_TXTRIMMIXLOBIASI           */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_DEFAULT                             0x00000001UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_v_29o53_vdd                         0x00000000UL                                     /**< Mode v_29o53_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_v_30o54_vdd                         0x00000001UL                                     /**< Mode v_30o54_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_v_31o55_vdd                         0x00000002UL                                     /**< Mode v_31o55_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASI_v_32o56_vdd                         0x00000003UL                                     /**< Mode v_32o56_vdd for RAC_PATRIM7            */
#define RAC_PATRIM7_TXTRIMMIXLOBIASI_DEFAULT                              (_RAC_PATRIM7_TXTRIMMIXLOBIASI_DEFAULT << 2)     /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXLOBIASI_v_29o53_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASI_v_29o53_vdd << 2) /**< Shifted mode v_29o53_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASI_v_30o54_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASI_v_30o54_vdd << 2) /**< Shifted mode v_30o54_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASI_v_31o55_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASI_v_31o55_vdd << 2) /**< Shifted mode v_31o55_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASI_v_32o56_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASI_v_32o56_vdd << 2) /**< Shifted mode v_32o56_vdd for RAC_PATRIM7    */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_SHIFT                               4                                                /**< Shift value for RAC_TXTRIMMIXLOBIASQ        */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_MASK                                0x30UL                                           /**< Bit mask for RAC_TXTRIMMIXLOBIASQ           */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_DEFAULT                             0x00000001UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_29o53_vdd                         0x00000000UL                                     /**< Mode v_29o53_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_30o54_vdd                         0x00000001UL                                     /**< Mode v_30o54_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_31o55_vdd                         0x00000002UL                                     /**< Mode v_31o55_vdd for RAC_PATRIM7            */
#define _RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_32o56_vdd                         0x00000003UL                                     /**< Mode v_32o56_vdd for RAC_PATRIM7            */
#define RAC_PATRIM7_TXTRIMMIXLOBIASQ_DEFAULT                              (_RAC_PATRIM7_TXTRIMMIXLOBIASQ_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_29o53_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_29o53_vdd << 4) /**< Shifted mode v_29o53_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_30o54_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_30o54_vdd << 4) /**< Shifted mode v_30o54_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_31o55_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_31o55_vdd << 4) /**< Shifted mode v_31o55_vdd for RAC_PATRIM7    */
#define RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_32o56_vdd                          (_RAC_PATRIM7_TXTRIMMIXLOBIASQ_v_32o56_vdd << 4) /**< Shifted mode v_32o56_vdd for RAC_PATRIM7    */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_SHIFT                                 8                                                /**< Shift value for RAC_TXTRIMMIXINDSW          */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_MASK                                  0x700UL                                          /**< Bit mask for RAC_TXTRIMMIXINDSW             */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_DEFAULT                               0x00000000UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_off                                0x00000000UL                                     /**< Mode sw_off for RAC_PATRIM7                 */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_1                               0x00000001UL                                     /**< Mode sw_2x_1 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_2                               0x00000002UL                                     /**< Mode sw_2x_2 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_1                               0x00000003UL                                     /**< Mode sw_4x_1 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_2                               0x00000004UL                                     /**< Mode sw_4x_2 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_1                               0x00000005UL                                     /**< Mode sw_6x_1 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_2                               0x00000006UL                                     /**< Mode sw_6x_2 for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMMIXINDSW_sw_8x                                 0x00000007UL                                     /**< Mode sw_8x for RAC_PATRIM7                  */
#define RAC_PATRIM7_TXTRIMMIXINDSW_DEFAULT                                (_RAC_PATRIM7_TXTRIMMIXINDSW_DEFAULT << 8)       /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_off                                 (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_off << 8)        /**< Shifted mode sw_off for RAC_PATRIM7         */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_1                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_1 << 8)       /**< Shifted mode sw_2x_1 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_2                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_2x_2 << 8)       /**< Shifted mode sw_2x_2 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_1                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_1 << 8)       /**< Shifted mode sw_4x_1 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_2                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_4x_2 << 8)       /**< Shifted mode sw_4x_2 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_1                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_1 << 8)       /**< Shifted mode sw_6x_1 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_2                                (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_6x_2 << 8)       /**< Shifted mode sw_6x_2 for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMMIXINDSW_sw_8x                                  (_RAC_PATRIM7_TXTRIMMIXINDSW_sw_8x << 8)         /**< Shifted mode sw_8x for RAC_PATRIM7          */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_SHIFT                                 14                                               /**< Shift value for RAC_TXTRIMSHVDDREG          */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_MASK                                  0xC000UL                                         /**< Bit mask for RAC_TXTRIMSHVDDREG             */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_DEFAULT                               0x00000002UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_v1p1                                  0x00000000UL                                     /**< Mode v1p1 for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_v1p15                                 0x00000001UL                                     /**< Mode v1p15 for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_v1p2                                  0x00000002UL                                     /**< Mode v1p2 for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHVDDREG_v1p25                                 0x00000003UL                                     /**< Mode v1p25 for RAC_PATRIM7                  */
#define RAC_PATRIM7_TXTRIMSHVDDREG_DEFAULT                                (_RAC_PATRIM7_TXTRIMSHVDDREG_DEFAULT << 14)      /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMSHVDDREG_v1p1                                   (_RAC_PATRIM7_TXTRIMSHVDDREG_v1p1 << 14)         /**< Shifted mode v1p1 for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHVDDREG_v1p15                                  (_RAC_PATRIM7_TXTRIMSHVDDREG_v1p15 << 14)        /**< Shifted mode v1p15 for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVDDREG_v1p2                                   (_RAC_PATRIM7_TXTRIMSHVDDREG_v1p2 << 14)         /**< Shifted mode v1p2 for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHVDDREG_v1p25                                  (_RAC_PATRIM7_TXTRIMSHVDDREG_v1p25 << 14)        /**< Shifted mode v1p25 for RAC_PATRIM7          */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_SHIFT                                16                                               /**< Shift value for RAC_TXTRIMSHIBINBUF         */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_MASK                                 0x70000UL                                        /**< Bit mask for RAC_TXTRIMSHIBINBUF            */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_DEFAULT                              0x00000004UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i35u                                 0x00000001UL                                     /**< Mode i35u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i40u                                 0x00000002UL                                     /**< Mode i40u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i45u                                 0x00000003UL                                     /**< Mode i45u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i50u                                 0x00000004UL                                     /**< Mode i50u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i55u                                 0x00000005UL                                     /**< Mode i55u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i60u                                 0x00000006UL                                     /**< Mode i60u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBINBUF_i65u                                 0x00000007UL                                     /**< Mode i65u for RAC_PATRIM7                   */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_DEFAULT                               (_RAC_PATRIM7_TXTRIMSHIBINBUF_DEFAULT << 16)     /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i35u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i35u << 16)        /**< Shifted mode i35u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i40u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i40u << 16)        /**< Shifted mode i40u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i45u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i45u << 16)        /**< Shifted mode i45u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i50u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i50u << 16)        /**< Shifted mode i50u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i55u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i55u << 16)        /**< Shifted mode i55u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i60u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i60u << 16)        /**< Shifted mode i60u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBINBUF_i65u                                  (_RAC_PATRIM7_TXTRIMSHIBINBUF_i65u << 16)        /**< Shifted mode i65u for RAC_PATRIM7           */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_SHIFT                                  19                                               /**< Shift value for RAC_TXTRIMSHIBVCM           */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_MASK                                   0x380000UL                                       /**< Bit mask for RAC_TXTRIMSHIBVCM              */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_DEFAULT                                0x00000003UL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i30u                                   0x00000000UL                                     /**< Mode i30u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i35u                                   0x00000001UL                                     /**< Mode i35u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i40u                                   0x00000002UL                                     /**< Mode i40u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i45u                                   0x00000003UL                                     /**< Mode i45u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i50u                                   0x00000004UL                                     /**< Mode i50u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i55u                                   0x00000005UL                                     /**< Mode i55u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i60u                                   0x00000006UL                                     /**< Mode i60u for RAC_PATRIM7                   */
#define _RAC_PATRIM7_TXTRIMSHIBVCM_i65u                                   0x00000007UL                                     /**< Mode i65u for RAC_PATRIM7                   */
#define RAC_PATRIM7_TXTRIMSHIBVCM_DEFAULT                                 (_RAC_PATRIM7_TXTRIMSHIBVCM_DEFAULT << 19)       /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i30u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i30u << 19)          /**< Shifted mode i30u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i35u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i35u << 19)          /**< Shifted mode i35u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i40u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i40u << 19)          /**< Shifted mode i40u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i45u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i45u << 19)          /**< Shifted mode i45u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i50u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i50u << 19)          /**< Shifted mode i50u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i55u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i55u << 19)          /**< Shifted mode i55u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i60u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i60u << 19)          /**< Shifted mode i60u for RAC_PATRIM7           */
#define RAC_PATRIM7_TXTRIMSHIBVCM_i65u                                    (_RAC_PATRIM7_TXTRIMSHIBVCM_i65u << 19)          /**< Shifted mode i65u for RAC_PATRIM7           */
#define _RAC_PATRIM7_TXTRIMSHVCM_SHIFT                                    22                                               /**< Shift value for RAC_TXTRIMSHVCM             */
#define _RAC_PATRIM7_TXTRIMSHVCM_MASK                                     0x3C00000UL                                      /**< Bit mask for RAC_TXTRIMSHVCM                */
#define _RAC_PATRIM7_TXTRIMSHVCM_DEFAULT                                  0x0000000AUL                                     /**< Mode DEFAULT for RAC_PATRIM7                */
#define _RAC_PATRIM7_TXTRIMSHVCM_v300m                                    0x00000000UL                                     /**< Mode v300m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v333m                                    0x00000001UL                                     /**< Mode v333m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v367m                                    0x00000002UL                                     /**< Mode v367m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v400m                                    0x00000003UL                                     /**< Mode v400m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v433m                                    0x00000004UL                                     /**< Mode v433m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v466m                                    0x00000005UL                                     /**< Mode v466m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v500m                                    0x00000006UL                                     /**< Mode v500m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v533m                                    0x00000007UL                                     /**< Mode v533m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v566m                                    0x00000008UL                                     /**< Mode v566m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v599m                                    0x00000009UL                                     /**< Mode v599m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v631m                                    0x0000000AUL                                     /**< Mode v631m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v664m                                    0x0000000BUL                                     /**< Mode v664m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v696m                                    0x0000000CUL                                     /**< Mode v696m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v728m                                    0x0000000DUL                                     /**< Mode v728m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v760m                                    0x0000000EUL                                     /**< Mode v760m for RAC_PATRIM7                  */
#define _RAC_PATRIM7_TXTRIMSHVCM_v790m                                    0x0000000FUL                                     /**< Mode v790m for RAC_PATRIM7                  */
#define RAC_PATRIM7_TXTRIMSHVCM_DEFAULT                                   (_RAC_PATRIM7_TXTRIMSHVCM_DEFAULT << 22)         /**< Shifted mode DEFAULT for RAC_PATRIM7        */
#define RAC_PATRIM7_TXTRIMSHVCM_v300m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v300m << 22)           /**< Shifted mode v300m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v333m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v333m << 22)           /**< Shifted mode v333m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v367m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v367m << 22)           /**< Shifted mode v367m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v400m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v400m << 22)           /**< Shifted mode v400m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v433m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v433m << 22)           /**< Shifted mode v433m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v466m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v466m << 22)           /**< Shifted mode v466m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v500m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v500m << 22)           /**< Shifted mode v500m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v533m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v533m << 22)           /**< Shifted mode v533m for RAC_PATRIM7          */
