SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
#define RAC_PATRIM7_TXTRIMSHVCM_v566m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v566m << 22)           /**< Shifted mode v566m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v599m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v599m << 22)           /**< Shifted mode v599m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v631m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v631m << 22)           /**< Shifted mode v631m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v664m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v664m << 22)           /**< Shifted mode v664m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v696m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v696m << 22)           /**< Shifted mode v696m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v728m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v728m << 22)           /**< Shifted mode v728m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v760m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v760m << 22)           /**< Shifted mode v760m for RAC_PATRIM7          */
#define RAC_PATRIM7_TXTRIMSHVCM_v790m                                     (_RAC_PATRIM7_TXTRIMSHVCM_v790m << 22)           /**< Shifted mode v790m for RAC_PATRIM7          */

/* Bit fields for RAC PATRIM8 */
#define _RAC_PATRIM8_RESETVALUE                                           0x000501C6UL                                  /**< Default value for RAC_PATRIM8               */
#define _RAC_PATRIM8_MASK                                                 0x000FFFFFUL                                  /**< Mask for RAC_PATRIM8                        */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_SHIFT                                0                                             /**< Shift value for RAC_TXTRIMRFPKDVDDD         */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_MASK                                 0x3UL                                         /**< Bit mask for RAC_TXTRIMRFPKDVDDD            */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_DEFAULT                              0x00000002UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p1                             0x00000000UL                                  /**< Mode vreg_1p1 for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p15                            0x00000001UL                                  /**< Mode vreg_1p15 for RAC_PATRIM8              */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p2                             0x00000002UL                                  /**< Mode vreg_1p2 for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p25                            0x00000003UL                                  /**< Mode vreg_1p25 for RAC_PATRIM8              */
#define RAC_PATRIM8_TXTRIMRFPKDVDDD_DEFAULT                               (_RAC_PATRIM8_TXTRIMRFPKDVDDD_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p1                              (_RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p1 << 0)  /**< Shifted mode vreg_1p1 for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p15                             (_RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p15 << 0) /**< Shifted mode vreg_1p15 for RAC_PATRIM8      */
#define RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p2                              (_RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p2 << 0)  /**< Shifted mode vreg_1p2 for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p25                             (_RAC_PATRIM8_TXTRIMRFPKDVDDD_vreg_1p25 << 0) /**< Shifted mode vreg_1p25 for RAC_PATRIM8      */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_SHIFT                                  2                                             /**< Shift value for RAC_TXTRIMRFPKDIB           */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_MASK                                   0xCUL                                         /**< Bit mask for RAC_TXTRIMRFPKDIB              */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_DEFAULT                                0x00000001UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_ib_15uA                                0x00000000UL                                  /**< Mode ib_15uA for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_1                              0x00000001UL                                  /**< Mode ib_10uA_1 for RAC_PATRIM8              */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_2                              0x00000002UL                                  /**< Mode ib_10uA_2 for RAC_PATRIM8              */
#define _RAC_PATRIM8_TXTRIMRFPKDIB_tib_15uA                               0x00000003UL                                  /**< Mode tib_15uA for RAC_PATRIM8               */
#define RAC_PATRIM8_TXTRIMRFPKDIB_DEFAULT                                 (_RAC_PATRIM8_TXTRIMRFPKDIB_DEFAULT << 2)     /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMRFPKDIB_ib_15uA                                 (_RAC_PATRIM8_TXTRIMRFPKDIB_ib_15uA << 2)     /**< Shifted mode ib_15uA for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_1                               (_RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_1 << 2)   /**< Shifted mode ib_10uA_1 for RAC_PATRIM8      */
#define RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_2                               (_RAC_PATRIM8_TXTRIMRFPKDIB_ib_10uA_2 << 2)   /**< Shifted mode ib_10uA_2 for RAC_PATRIM8      */
#define RAC_PATRIM8_TXTRIMRFPKDIB_tib_15uA                                (_RAC_PATRIM8_TXTRIMRFPKDIB_tib_15uA << 2)    /**< Shifted mode tib_15uA for RAC_PATRIM8       */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_SHIFT                                 4                                             /**< Shift value for RAC_TXTRIMRFPKDVCM          */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_MASK                                  0x30UL                                        /**< Bit mask for RAC_TXTRIMRFPKDVCM             */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_DEFAULT                               0x00000000UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_1                              0x00000000UL                                  /**< Mode VCM_R0_1 for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_2                              0x00000001UL                                  /**< Mode VCM_R0_2 for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R5k                               0x00000002UL                                  /**< Mode VCM_R5k for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_10k                               0x00000003UL                                  /**< Mode VCM_10k for RAC_PATRIM8                */
#define RAC_PATRIM8_TXTRIMRFPKDVCM_DEFAULT                                (_RAC_PATRIM8_TXTRIMRFPKDVCM_DEFAULT << 4)    /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_1                               (_RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_1 << 4)   /**< Shifted mode VCM_R0_1 for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_2                               (_RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R0_2 << 4)   /**< Shifted mode VCM_R0_2 for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R5k                                (_RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_R5k << 4)    /**< Shifted mode VCM_R5k for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_10k                                (_RAC_PATRIM8_TXTRIMRFPKDVCM_VCM_10k << 4)    /**< Shifted mode VCM_10k for RAC_PATRIM8        */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_SHIFT                                  6                                             /**< Shift value for RAC_TXTRIMBUFBIAS           */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_MASK                                   0x3C0UL                                       /**< Bit mask for RAC_TXTRIMBUFBIAS              */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_DEFAULT                                0x00000007UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_125uA                               0x00000000UL                                  /**< Mode ib_125uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_130uA                               0x00000001UL                                  /**< Mode ib_130uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_135uA                               0x00000002UL                                  /**< Mode ib_135uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_140uA                               0x00000003UL                                  /**< Mode ib_140uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_145uA                               0x00000004UL                                  /**< Mode ib_145uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_150uA                               0x00000005UL                                  /**< Mode ib_150uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_155uA                               0x00000006UL                                  /**< Mode ib_155uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_160uA                               0x00000007UL                                  /**< Mode ib_160uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_165uA                               0x00000008UL                                  /**< Mode ib_165uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_170uA                               0x00000009UL                                  /**< Mode ib_170uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_175uA                               0x0000000AUL                                  /**< Mode ib_175uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_180uA                               0x0000000BUL                                  /**< Mode ib_180uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_185uA                               0x0000000CUL                                  /**< Mode ib_185uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_190uA                               0x0000000DUL                                  /**< Mode ib_190uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_195uA                               0x0000000EUL                                  /**< Mode ib_195uA for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFBIAS_ib_200uA                               0x0000000FUL                                  /**< Mode ib_200uA for RAC_PATRIM8               */
#define RAC_PATRIM8_TXTRIMBUFBIAS_DEFAULT                                 (_RAC_PATRIM8_TXTRIMBUFBIAS_DEFAULT << 6)     /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_125uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_125uA << 6)    /**< Shifted mode ib_125uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_130uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_130uA << 6)    /**< Shifted mode ib_130uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_135uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_135uA << 6)    /**< Shifted mode ib_135uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_140uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_140uA << 6)    /**< Shifted mode ib_140uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_145uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_145uA << 6)    /**< Shifted mode ib_145uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_150uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_150uA << 6)    /**< Shifted mode ib_150uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_155uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_155uA << 6)    /**< Shifted mode ib_155uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_160uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_160uA << 6)    /**< Shifted mode ib_160uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_165uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_165uA << 6)    /**< Shifted mode ib_165uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_170uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_170uA << 6)    /**< Shifted mode ib_170uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_175uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_175uA << 6)    /**< Shifted mode ib_175uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_180uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_180uA << 6)    /**< Shifted mode ib_180uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_185uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_185uA << 6)    /**< Shifted mode ib_185uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_190uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_190uA << 6)    /**< Shifted mode ib_190uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_195uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_195uA << 6)    /**< Shifted mode ib_195uA for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFBIAS_ib_200uA                                (_RAC_PATRIM8_TXTRIMBUFBIAS_ib_200uA << 6)    /**< Shifted mode ib_200uA for RAC_PATRIM8       */
#define _RAC_PATRIM8_TXTRIMBUFSLICESN_SHIFT                               10                                            /**< Shift value for RAC_TXTRIMBUFSLICESN        */
#define _RAC_PATRIM8_TXTRIMBUFSLICESN_MASK                                0x1C00UL                                      /**< Bit mask for RAC_TXTRIMBUFSLICESN           */
#define _RAC_PATRIM8_TXTRIMBUFSLICESN_DEFAULT                             0x00000000UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define RAC_PATRIM8_TXTRIMBUFSLICESN_DEFAULT                              (_RAC_PATRIM8_TXTRIMBUFSLICESN_DEFAULT << 10) /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define _RAC_PATRIM8_TXTRIMBUFSLICESP_SHIFT                               13                                            /**< Shift value for RAC_TXTRIMBUFSLICESP        */
#define _RAC_PATRIM8_TXTRIMBUFSLICESP_MASK                                0xE000UL                                      /**< Bit mask for RAC_TXTRIMBUFSLICESP           */
#define _RAC_PATRIM8_TXTRIMBUFSLICESP_DEFAULT                             0x00000000UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define RAC_PATRIM8_TXTRIMBUFSLICESP_DEFAULT                              (_RAC_PATRIM8_TXTRIMBUFSLICESP_DEFAULT << 13) /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define _RAC_PATRIM8_TXTRIMBUFVMID_SHIFT                                  16                                            /**< Shift value for RAC_TXTRIMBUFVMID           */
#define _RAC_PATRIM8_TXTRIMBUFVMID_MASK                                   0x30000UL                                     /**< Bit mask for RAC_TXTRIMBUFVMID              */
#define _RAC_PATRIM8_TXTRIMBUFVMID_DEFAULT                                0x00000001UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFVMID_v_1p20V                                0x00000000UL                                  /**< Mode v_1p20V for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFVMID_v_1p25V                                0x00000001UL                                  /**< Mode v_1p25V for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFVMID_v_1p30V                                0x00000002UL                                  /**< Mode v_1p30V for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFVMID_v_1p35V                                0x00000003UL                                  /**< Mode v_1p35V for RAC_PATRIM8                */
#define RAC_PATRIM8_TXTRIMBUFVMID_DEFAULT                                 (_RAC_PATRIM8_TXTRIMBUFVMID_DEFAULT << 16)    /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFVMID_v_1p20V                                 (_RAC_PATRIM8_TXTRIMBUFVMID_v_1p20V << 16)    /**< Shifted mode v_1p20V for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFVMID_v_1p25V                                 (_RAC_PATRIM8_TXTRIMBUFVMID_v_1p25V << 16)    /**< Shifted mode v_1p25V for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFVMID_v_1p30V                                 (_RAC_PATRIM8_TXTRIMBUFVMID_v_1p30V << 16)    /**< Shifted mode v_1p30V for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFVMID_v_1p35V                                 (_RAC_PATRIM8_TXTRIMBUFVMID_v_1p35V << 16)    /**< Shifted mode v_1p35V for RAC_PATRIM8        */
#define _RAC_PATRIM8_TXTRIMBUFVREG_SHIFT                                  18                                            /**< Shift value for RAC_TXTRIMBUFVREG           */
#define _RAC_PATRIM8_TXTRIMBUFVREG_MASK                                   0xC0000UL                                     /**< Bit mask for RAC_TXTRIMBUFVREG              */
#define _RAC_PATRIM8_TXTRIMBUFVREG_DEFAULT                                0x00000001UL                                  /**< Mode DEFAULT for RAC_PATRIM8                */
#define _RAC_PATRIM8_TXTRIMBUFVREG_v_2p375V                               0x00000000UL                                  /**< Mode v_2p375V for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFVREG_v_2p500V                               0x00000001UL                                  /**< Mode v_2p500V for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFVREG_v_2p625V                               0x00000002UL                                  /**< Mode v_2p625V for RAC_PATRIM8               */
#define _RAC_PATRIM8_TXTRIMBUFVREG_v_2p750V                               0x00000003UL                                  /**< Mode v_2p750V for RAC_PATRIM8               */
#define RAC_PATRIM8_TXTRIMBUFVREG_DEFAULT                                 (_RAC_PATRIM8_TXTRIMBUFVREG_DEFAULT << 18)    /**< Shifted mode DEFAULT for RAC_PATRIM8        */
#define RAC_PATRIM8_TXTRIMBUFVREG_v_2p375V                                (_RAC_PATRIM8_TXTRIMBUFVREG_v_2p375V << 18)   /**< Shifted mode v_2p375V for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFVREG_v_2p500V                                (_RAC_PATRIM8_TXTRIMBUFVREG_v_2p500V << 18)   /**< Shifted mode v_2p500V for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFVREG_v_2p625V                                (_RAC_PATRIM8_TXTRIMBUFVREG_v_2p625V << 18)   /**< Shifted mode v_2p625V for RAC_PATRIM8       */
#define RAC_PATRIM8_TXTRIMBUFVREG_v_2p750V                                (_RAC_PATRIM8_TXTRIMBUFVREG_v_2p750V << 18)   /**< Shifted mode v_2p750V for RAC_PATRIM8       */

