SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC PATRIM9 */
#define _RAC_PATRIM9_RESETVALUE                                           0x00000045UL                                 /**< Default value for RAC_PATRIM9               */
#define _RAC_PATRIM9_MASK                                                 0xFFFF007FUL                                 /**< Mask for RAC_PATRIM9                        */
#define RAC_PATRIM9_TXTRIMDACVCAS                                         (0x1UL << 0)                                 /**< TXTRIMDACVCAS                               */
#define _RAC_PATRIM9_TXTRIMDACVCAS_SHIFT                                  0                                            /**< Shift value for RAC_TXTRIMDACVCAS           */
#define _RAC_PATRIM9_TXTRIMDACVCAS_MASK                                   0x1UL                                        /**< Bit mask for RAC_TXTRIMDACVCAS              */
#define _RAC_PATRIM9_TXTRIMDACVCAS_DEFAULT                                0x00000001UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define _RAC_PATRIM9_TXTRIMDACVCAS_v200m                                  0x00000000UL                                 /**< Mode v200m for RAC_PATRIM9                  */
#define _RAC_PATRIM9_TXTRIMDACVCAS_v110m                                  0x00000001UL                                 /**< Mode v110m for RAC_PATRIM9                  */
#define RAC_PATRIM9_TXTRIMDACVCAS_DEFAULT                                 (_RAC_PATRIM9_TXTRIMDACVCAS_DEFAULT << 0)    /**< Shifted mode DEFAULT for RAC_PATRIM9        */
#define RAC_PATRIM9_TXTRIMDACVCAS_v200m                                   (_RAC_PATRIM9_TXTRIMDACVCAS_v200m << 0)      /**< Shifted mode v200m for RAC_PATRIM9          */
#define RAC_PATRIM9_TXTRIMDACVCAS_v110m                                   (_RAC_PATRIM9_TXTRIMDACVCAS_v110m << 0)      /**< Shifted mode v110m for RAC_PATRIM9          */
#define RAC_PATRIM9_TXTRIMDACSCALE                                        (0x1UL << 1)                                 /**< TXTRIMDACSCALE                              */
#define _RAC_PATRIM9_TXTRIMDACSCALE_SHIFT                                 1                                            /**< Shift value for RAC_TXTRIMDACSCALE          */
#define _RAC_PATRIM9_TXTRIMDACSCALE_MASK                                  0x2UL                                        /**< Bit mask for RAC_TXTRIMDACSCALE             */
#define _RAC_PATRIM9_TXTRIMDACSCALE_DEFAULT                               0x00000000UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define _RAC_PATRIM9_TXTRIMDACSCALE_disabled                              0x00000000UL                                 /**< Mode disabled for RAC_PATRIM9               */
#define _RAC_PATRIM9_TXTRIMDACSCALE_enabled                               0x00000001UL                                 /**< Mode enabled for RAC_PATRIM9                */
#define RAC_PATRIM9_TXTRIMDACSCALE_DEFAULT                                (_RAC_PATRIM9_TXTRIMDACSCALE_DEFAULT << 1)   /**< Shifted mode DEFAULT for RAC_PATRIM9        */
#define RAC_PATRIM9_TXTRIMDACSCALE_disabled                               (_RAC_PATRIM9_TXTRIMDACSCALE_disabled << 1)  /**< Shifted mode disabled for RAC_PATRIM9       */
#define RAC_PATRIM9_TXTRIMDACSCALE_enabled                                (_RAC_PATRIM9_TXTRIMDACSCALE_enabled << 1)   /**< Shifted mode enabled for RAC_PATRIM9        */
#define _RAC_PATRIM9_TXTRIMDACVDDD_SHIFT                                  2                                            /**< Shift value for RAC_TXTRIMDACVDDD           */
#define _RAC_PATRIM9_TXTRIMDACVDDD_MASK                                   0xCUL                                        /**< Bit mask for RAC_TXTRIMDACVDDD              */
#define _RAC_PATRIM9_TXTRIMDACVDDD_DEFAULT                                0x00000001UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define _RAC_PATRIM9_TXTRIMDACVDDD_v1                                     0x00000000UL                                 /**< Mode v1 for RAC_PATRIM9                     */
#define _RAC_PATRIM9_TXTRIMDACVDDD_v1p1                                   0x00000001UL                                 /**< Mode v1p1 for RAC_PATRIM9                   */
#define _RAC_PATRIM9_TXTRIMDACVDDD_v1p18                                  0x00000002UL                                 /**< Mode v1p18 for RAC_PATRIM9                  */
#define _RAC_PATRIM9_TXTRIMDACVDDD_v1p25                                  0x00000003UL                                 /**< Mode v1p25 for RAC_PATRIM9                  */
#define RAC_PATRIM9_TXTRIMDACVDDD_DEFAULT                                 (_RAC_PATRIM9_TXTRIMDACVDDD_DEFAULT << 2)    /**< Shifted mode DEFAULT for RAC_PATRIM9        */
#define RAC_PATRIM9_TXTRIMDACVDDD_v1                                      (_RAC_PATRIM9_TXTRIMDACVDDD_v1 << 2)         /**< Shifted mode v1 for RAC_PATRIM9             */
#define RAC_PATRIM9_TXTRIMDACVDDD_v1p1                                    (_RAC_PATRIM9_TXTRIMDACVDDD_v1p1 << 2)       /**< Shifted mode v1p1 for RAC_PATRIM9           */
#define RAC_PATRIM9_TXTRIMDACVDDD_v1p18                                   (_RAC_PATRIM9_TXTRIMDACVDDD_v1p18 << 2)      /**< Shifted mode v1p18 for RAC_PATRIM9          */
#define RAC_PATRIM9_TXTRIMDACVDDD_v1p25                                   (_RAC_PATRIM9_TXTRIMDACVDDD_v1p25 << 2)      /**< Shifted mode v1p25 for RAC_PATRIM9          */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_SHIFT                                 4                                            /**< Shift value for RAC_TXTRIMDACIBIAS          */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_MASK                                  0x70UL                                       /**< Bit mask for RAC_TXTRIMDACIBIAS             */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_DEFAULT                               0x00000004UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i10u                                  0x00000000UL                                 /**< Mode i10u for RAC_PATRIM9                   */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i12p5u                                0x00000001UL                                 /**< Mode i12p5u for RAC_PATRIM9                 */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i15u                                  0x00000002UL                                 /**< Mode i15u for RAC_PATRIM9                   */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i17p5u                                0x00000003UL                                 /**< Mode i17p5u for RAC_PATRIM9                 */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i20u                                  0x00000004UL                                 /**< Mode i20u for RAC_PATRIM9                   */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i22p5u                                0x00000005UL                                 /**< Mode i22p5u for RAC_PATRIM9                 */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i25u                                  0x00000006UL                                 /**< Mode i25u for RAC_PATRIM9                   */
#define _RAC_PATRIM9_TXTRIMDACIBIAS_i27p5u                                0x00000007UL                                 /**< Mode i27p5u for RAC_PATRIM9                 */
#define RAC_PATRIM9_TXTRIMDACIBIAS_DEFAULT                                (_RAC_PATRIM9_TXTRIMDACIBIAS_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_PATRIM9        */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i10u                                   (_RAC_PATRIM9_TXTRIMDACIBIAS_i10u << 4)      /**< Shifted mode i10u for RAC_PATRIM9           */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i12p5u                                 (_RAC_PATRIM9_TXTRIMDACIBIAS_i12p5u << 4)    /**< Shifted mode i12p5u for RAC_PATRIM9         */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i15u                                   (_RAC_PATRIM9_TXTRIMDACIBIAS_i15u << 4)      /**< Shifted mode i15u for RAC_PATRIM9           */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i17p5u                                 (_RAC_PATRIM9_TXTRIMDACIBIAS_i17p5u << 4)    /**< Shifted mode i17p5u for RAC_PATRIM9         */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i20u                                   (_RAC_PATRIM9_TXTRIMDACIBIAS_i20u << 4)      /**< Shifted mode i20u for RAC_PATRIM9           */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i22p5u                                 (_RAC_PATRIM9_TXTRIMDACIBIAS_i22p5u << 4)    /**< Shifted mode i22p5u for RAC_PATRIM9         */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i25u                                   (_RAC_PATRIM9_TXTRIMDACIBIAS_i25u << 4)      /**< Shifted mode i25u for RAC_PATRIM9           */
#define RAC_PATRIM9_TXTRIMDACIBIAS_i27p5u                                 (_RAC_PATRIM9_TXTRIMDACIBIAS_i27p5u << 4)    /**< Shifted mode i27p5u for RAC_PATRIM9         */
#define _RAC_PATRIM9_TXTRIMPASLICESN_SHIFT                                16                                           /**< Shift value for RAC_TXTRIMPASLICESN         */
#define _RAC_PATRIM9_TXTRIMPASLICESN_MASK                                 0xFF0000UL                                   /**< Bit mask for RAC_TXTRIMPASLICESN            */
#define _RAC_PATRIM9_TXTRIMPASLICESN_DEFAULT                              0x00000000UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define RAC_PATRIM9_TXTRIMPASLICESN_DEFAULT                               (_RAC_PATRIM9_TXTRIMPASLICESN_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_PATRIM9        */
#define _RAC_PATRIM9_TXTRIMPASLICESP_SHIFT                                24                                           /**< Shift value for RAC_TXTRIMPASLICESP         */
#define _RAC_PATRIM9_TXTRIMPASLICESP_MASK                                 0xFF000000UL                                 /**< Bit mask for RAC_TXTRIMPASLICESP            */
#define _RAC_PATRIM9_TXTRIMPASLICESP_DEFAULT                              0x00000000UL                                 /**< Mode DEFAULT for RAC_PATRIM9                */
#define RAC_PATRIM9_TXTRIMPASLICESP_DEFAULT                               (_RAC_PATRIM9_TXTRIMPASLICESP_DEFAULT << 24) /**< Shifted mode DEFAULT for RAC_PATRIM9        */

/* Bit fields for RAC PATRIM10 */
#define _RAC_PATRIM10_RESETVALUE                                          0x015E0579UL                                    /**< Default value for RAC_PATRIM10              */
#define _RAC_PATRIM10_MASK                                                0x07FF1FFFUL                                    /**< Mask for RAC_PATRIM10                       */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_SHIFT                                0                                               /**< Shift value for RAC_TXTRIMPAMIRROR          */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_MASK                                 0x3UL                                           /**< Bit mask for RAC_TXTRIMPAMIRROR             */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_DEFAULT                              0x00000001UL                                    /**< Mode DEFAULT for RAC_PATRIM10               */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_bias_0p5LSB                          0x00000000UL                                    /**< Mode bias_0p5LSB for RAC_PATRIM10           */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p0LSB                          0x00000001UL                                    /**< Mode bias_1p0LSB for RAC_PATRIM10           */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p5LSB                          0x00000002UL                                    /**< Mode bias_1p5LSB for RAC_PATRIM10           */
#define _RAC_PATRIM10_TXTRIMPAMIRROR_bias_2p0LSB                          0x00000003UL                                    /**< Mode bias_2p0LSB for RAC_PATRIM10           */
#define RAC_PATRIM10_TXTRIMPAMIRROR_DEFAULT                               (_RAC_PATRIM10_TXTRIMPAMIRROR_DEFAULT << 0)     /**< Shifted mode DEFAULT for RAC_PATRIM10       */
#define RAC_PATRIM10_TXTRIMPAMIRROR_bias_0p5LSB                           (_RAC_PATRIM10_TXTRIMPAMIRROR_bias_0p5LSB << 0) /**< Shifted mode bias_0p5LSB for RAC_PATRIM10   */
#define RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p0LSB                           (_RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p0LSB << 0) /**< Shifted mode bias_1p0LSB for RAC_PATRIM10   */
#define RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p5LSB                           (_RAC_PATRIM10_TXTRIMPAMIRROR_bias_1p5LSB << 0) /**< Shifted mode bias_1p5LSB for RAC_PATRIM10   */
#define RAC_PATRIM10_TXTRIMPAMIRROR_bias_2p0LSB                           (_RAC_PATRIM10_TXTRIMPAMIRROR_bias_2p0LSB << 0) /**< Shifted mode bias_2p0LSB for RAC_PATRIM10   */
#define _RAC_PATRIM10_TXTRIMPANBIAS_SHIFT                                 2                                               /**< Shift value for RAC_TXTRIMPANBIAS           */
#define _RAC_PATRIM10_TXTRIMPANBIAS_MASK                                  0x3FCUL                                         /**< Bit mask for RAC_TXTRIMPANBIAS              */
#define _RAC_PATRIM10_TXTRIMPANBIAS_DEFAULT                               0x0000005EUL                                    /**< Mode DEFAULT for RAC_PATRIM10               */
#define RAC_PATRIM10_TXTRIMPANBIAS_DEFAULT                                (_RAC_PATRIM10_TXTRIMPANBIAS_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_PATRIM10       */
#define _RAC_PATRIM10_TXTRIMPANCBIAS_SHIFT                                10                                              /**< Shift value for RAC_TXTRIMPANCBIAS          */
#define _RAC_PATRIM10_TXTRIMPANCBIAS_MASK                                 0x1C00UL                                        /**< Bit mask for RAC_TXTRIMPANCBIAS             */
#define _RAC_PATRIM10_TXTRIMPANCBIAS_DEFAULT                              0x00000001UL                                    /**< Mode DEFAULT for RAC_PATRIM10               */
#define RAC_PATRIM10_TXTRIMPANCBIAS_DEFAULT                               (_RAC_PATRIM10_TXTRIMPANCBIAS_DEFAULT << 10)    /**< Shifted mode DEFAULT for RAC_PATRIM10       */
#define _RAC_PATRIM10_TXTRIMPAPBIAS_SHIFT                                 16                                              /**< Shift value for RAC_TXTRIMPAPBIAS           */
#define _RAC_PATRIM10_TXTRIMPAPBIAS_MASK                                  0xFF0000UL                                      /**< Bit mask for RAC_TXTRIMPAPBIAS              */
#define _RAC_PATRIM10_TXTRIMPAPBIAS_DEFAULT                               0x0000005EUL                                    /**< Mode DEFAULT for RAC_PATRIM10               */
#define RAC_PATRIM10_TXTRIMPAPBIAS_DEFAULT                                (_RAC_PATRIM10_TXTRIMPAPBIAS_DEFAULT << 16)     /**< Shifted mode DEFAULT for RAC_PATRIM10       */
#define _RAC_PATRIM10_TXTRIMPAPCBIAS_SHIFT                                24                                              /**< Shift value for RAC_TXTRIMPAPCBIAS          */
#define _RAC_PATRIM10_TXTRIMPAPCBIAS_MASK                                 0x7000000UL                                     /**< Bit mask for RAC_TXTRIMPAPCBIAS             */
#define _RAC_PATRIM10_TXTRIMPAPCBIAS_DEFAULT                              0x00000001UL                                    /**< Mode DEFAULT for RAC_PATRIM10               */
#define RAC_PATRIM10_TXTRIMPAPCBIAS_DEFAULT                               (_RAC_PATRIM10_TXTRIMPAPCBIAS_DEFAULT << 24)    /**< Shifted mode DEFAULT for RAC_PATRIM10       */

