SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXRFPKD */
#define _RAC_TXRFPKD_RESETVALUE                                           0x00010011UL                                        /**< Default value for RAC_TXRFPKD               */
#define _RAC_TXRFPKD_MASK                                                 0x0071F71DUL                                        /**< Mask for RAC_TXRFPKD                        */
#define RAC_TXRFPKD_TXRESETRFPKD                                          (0x1UL << 0)                                        /**< TXRESETRFPKD                                */
#define _RAC_TXRFPKD_TXRESETRFPKD_SHIFT                                   0                                                   /**< Shift value for RAC_TXRESETRFPKD            */
#define _RAC_TXRFPKD_TXRESETRFPKD_MASK                                    0x1UL                                               /**< Bit mask for RAC_TXRESETRFPKD               */
#define _RAC_TXRFPKD_TXRESETRFPKD_DEFAULT                                 0x00000001UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXRESETRFPKD_tbd0                                    0x00000000UL                                        /**< Mode tbd0 for RAC_TXRFPKD                   */
#define _RAC_TXRFPKD_TXRESETRFPKD_tbd1                                    0x00000001UL                                        /**< Mode tbd1 for RAC_TXRFPKD                   */
#define RAC_TXRFPKD_TXRESETRFPKD_DEFAULT                                  (_RAC_TXRFPKD_TXRESETRFPKD_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXRESETRFPKD_tbd0                                     (_RAC_TXRFPKD_TXRESETRFPKD_tbd0 << 0)               /**< Shifted mode tbd0 for RAC_TXRFPKD           */
#define RAC_TXRFPKD_TXRESETRFPKD_tbd1                                     (_RAC_TXRFPKD_TXRESETRFPKD_tbd1 << 0)               /**< Shifted mode tbd1 for RAC_TXRFPKD           */
#define _RAC_TXRFPKD_TXSELRFPKDREF_SHIFT                                  2                                                   /**< Shift value for RAC_TXSELRFPKDREF           */
#define _RAC_TXRFPKD_TXSELRFPKDREF_MASK                                   0x1CUL                                              /**< Bit mask for RAC_TXSELRFPKDREF              */
#define _RAC_TXRFPKD_TXSELRFPKDREF_DEFAULT                                0x00000004UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_79p4mV                              0x00000000UL                                        /**< Mode th_79p4mV for RAC_TXRFPKD              */
#define _RAC_TXRFPKD_TXSELRFPKDREF_tb_84p1mV                              0x00000001UL                                        /**< Mode tb_84p1mV for RAC_TXRFPKD              */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_89p1mV                              0x00000002UL                                        /**< Mode th_89p1mV for RAC_TXRFPKD              */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_94p4mV                              0x00000003UL                                        /**< Mode th_94p4mV for RAC_TXRFPKD              */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_100mV                               0x00000004UL                                        /**< Mode th_100mV for RAC_TXRFPKD               */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_105p9mV                             0x00000005UL                                        /**< Mode th_105p9mV for RAC_TXRFPKD             */
#define _RAC_TXRFPKD_TXSELRFPKDREF_tth_112p2mV                            0x00000006UL                                        /**< Mode tth_112p2mV for RAC_TXRFPKD            */
#define _RAC_TXRFPKD_TXSELRFPKDREF_th_118p9mV                             0x00000007UL                                        /**< Mode th_118p9mV for RAC_TXRFPKD             */
#define RAC_TXRFPKD_TXSELRFPKDREF_DEFAULT                                 (_RAC_TXRFPKD_TXSELRFPKDREF_DEFAULT << 2)           /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_79p4mV                               (_RAC_TXRFPKD_TXSELRFPKDREF_th_79p4mV << 2)         /**< Shifted mode th_79p4mV for RAC_TXRFPKD      */
#define RAC_TXRFPKD_TXSELRFPKDREF_tb_84p1mV                               (_RAC_TXRFPKD_TXSELRFPKDREF_tb_84p1mV << 2)         /**< Shifted mode tb_84p1mV for RAC_TXRFPKD      */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_89p1mV                               (_RAC_TXRFPKD_TXSELRFPKDREF_th_89p1mV << 2)         /**< Shifted mode th_89p1mV for RAC_TXRFPKD      */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_94p4mV                               (_RAC_TXRFPKD_TXSELRFPKDREF_th_94p4mV << 2)         /**< Shifted mode th_94p4mV for RAC_TXRFPKD      */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_100mV                                (_RAC_TXRFPKD_TXSELRFPKDREF_th_100mV << 2)          /**< Shifted mode th_100mV for RAC_TXRFPKD       */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_105p9mV                              (_RAC_TXRFPKD_TXSELRFPKDREF_th_105p9mV << 2)        /**< Shifted mode th_105p9mV for RAC_TXRFPKD     */
#define RAC_TXRFPKD_TXSELRFPKDREF_tth_112p2mV                             (_RAC_TXRFPKD_TXSELRFPKDREF_tth_112p2mV << 2)       /**< Shifted mode tth_112p2mV for RAC_TXRFPKD    */
#define RAC_TXRFPKD_TXSELRFPKDREF_th_118p9mV                              (_RAC_TXRFPKD_TXSELRFPKDREF_th_118p9mV << 2)        /**< Shifted mode th_118p9mV for RAC_TXRFPKD     */
#define RAC_TXRFPKD_TXRFPKDOUTMODE                                        (0x1UL << 8)                                        /**< TXRFPKDOUTMODE                              */
#define _RAC_TXRFPKD_TXRFPKDOUTMODE_SHIFT                                 8                                                   /**< Shift value for RAC_TXRFPKDOUTMODE          */
#define _RAC_TXRFPKD_TXRFPKDOUTMODE_MASK                                  0x100UL                                             /**< Bit mask for RAC_TXRFPKDOUTMODE             */
#define _RAC_TXRFPKD_TXRFPKDOUTMODE_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXRFPKDOUTMODE_output_unlatched                      0x00000000UL                                        /**< Mode output_unlatched for RAC_TXRFPKD       */
#define _RAC_TXRFPKD_TXRFPKDOUTMODE_output_latched                        0x00000001UL                                        /**< Mode output_latched for RAC_TXRFPKD         */
#define RAC_TXRFPKD_TXRFPKDOUTMODE_DEFAULT                                (_RAC_TXRFPKD_TXRFPKDOUTMODE_DEFAULT << 8)          /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXRFPKDOUTMODE_output_unlatched                       (_RAC_TXRFPKD_TXRFPKDOUTMODE_output_unlatched << 8) /**< Shifted mode output_unlatched for RAC_TXRFPKD*/
#define RAC_TXRFPKD_TXRFPKDOUTMODE_output_latched                         (_RAC_TXRFPKD_TXRFPKDOUTMODE_output_latched << 8)   /**< Shifted mode output_latched for RAC_TXRFPKD */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_SHIFT                                 9                                                   /**< Shift value for RAC_TXRFPKDCALMODE          */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_MASK                                  0x600UL                                             /**< Bit mask for RAC_TXRFPKDCALMODE             */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid1                          0x00000000UL                                        /**< Mode RFbias_vmid1 for RAC_TXRFPKD           */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid2                          0x00000001UL                                        /**< Mode RFbias_vmid2 for RAC_TXRFPKD           */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thH_thL                        0x00000002UL                                        /**< Mode RFbias_thH_thL for RAC_TXRFPKD         */
#define _RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thL_thH                        0x00000003UL                                        /**< Mode RFbias_thL_thH for RAC_TXRFPKD         */
#define RAC_TXRFPKD_TXRFPKDCALMODE_DEFAULT                                (_RAC_TXRFPKD_TXRFPKDCALMODE_DEFAULT << 9)          /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid1                           (_RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid1 << 9)     /**< Shifted mode RFbias_vmid1 for RAC_TXRFPKD   */
#define RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid2                           (_RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_vmid2 << 9)     /**< Shifted mode RFbias_vmid2 for RAC_TXRFPKD   */
#define RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thH_thL                         (_RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thH_thL << 9)   /**< Shifted mode RFbias_thH_thL for RAC_TXRFPKD */
#define RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thL_thH                         (_RAC_TXRFPKD_TXRFPKDCALMODE_RFbias_thL_thH << 9)   /**< Shifted mode RFbias_thL_thH for RAC_TXRFPKD */
#define _RAC_TXRFPKD_TXRFPKDCALCODE_SHIFT                                 12                                                  /**< Shift value for RAC_TXRFPKDCALCODE          */
#define _RAC_TXRFPKD_TXRFPKDCALCODE_MASK                                  0x1F000UL                                           /**< Bit mask for RAC_TXRFPKDCALCODE             */
#define _RAC_TXRFPKD_TXRFPKDCALCODE_DEFAULT                               0x00000010UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXRFPKDCALCODE_tbd0                                  0x00000000UL                                        /**< Mode tbd0 for RAC_TXRFPKD                   */
#define _RAC_TXRFPKD_TXRFPKDCALCODE_tbd1                                  0x00000001UL                                        /**< Mode tbd1 for RAC_TXRFPKD                   */
#define RAC_TXRFPKD_TXRFPKDCALCODE_DEFAULT                                (_RAC_TXRFPKD_TXRFPKDCALCODE_DEFAULT << 12)         /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXRFPKDCALCODE_tbd0                                   (_RAC_TXRFPKD_TXRFPKDCALCODE_tbd0 << 12)            /**< Shifted mode tbd0 for RAC_TXRFPKD           */
#define RAC_TXRFPKD_TXRFPKDCALCODE_tbd1                                   (_RAC_TXRFPKD_TXRFPKDCALCODE_tbd1 << 12)            /**< Shifted mode tbd1 for RAC_TXRFPKD           */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_SHIFT                                  20                                                  /**< Shift value for RAC_TXRFPKDCAPATT           */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_MASK                                   0x700000UL                                          /**< Bit mask for RAC_TXRFPKDCAPATT              */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_TXRFPKD                */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_att_15dB                               0x00000000UL                                        /**< Mode att_15dB for RAC_TXRFPKD               */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_att_18dB                               0x00000001UL                                        /**< Mode att_18dB for RAC_TXRFPKD               */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_att_21dB                               0x00000003UL                                        /**< Mode att_21dB for RAC_TXRFPKD               */
#define _RAC_TXRFPKD_TXRFPKDCAPATT_tbd_24dB                               0x00000007UL                                        /**< Mode tbd_24dB for RAC_TXRFPKD               */
#define RAC_TXRFPKD_TXRFPKDCAPATT_DEFAULT                                 (_RAC_TXRFPKD_TXRFPKDCAPATT_DEFAULT << 20)          /**< Shifted mode DEFAULT for RAC_TXRFPKD        */
#define RAC_TXRFPKD_TXRFPKDCAPATT_att_15dB                                (_RAC_TXRFPKD_TXRFPKDCAPATT_att_15dB << 20)         /**< Shifted mode att_15dB for RAC_TXRFPKD       */
#define RAC_TXRFPKD_TXRFPKDCAPATT_att_18dB                                (_RAC_TXRFPKD_TXRFPKDCAPATT_att_18dB << 20)         /**< Shifted mode att_18dB for RAC_TXRFPKD       */
#define RAC_TXRFPKD_TXRFPKDCAPATT_att_21dB                                (_RAC_TXRFPKD_TXRFPKDCAPATT_att_21dB << 20)         /**< Shifted mode att_21dB for RAC_TXRFPKD       */
#define RAC_TXRFPKD_TXRFPKDCAPATT_tbd_24dB                                (_RAC_TXRFPKD_TXRFPKDCAPATT_tbd_24dB << 20)         /**< Shifted mode tbd_24dB for RAC_TXRFPKD       */

/* Bit fields for RAC TXSTATUS */
#define _RAC_TXSTATUS_RESETVALUE                                          0x00000000UL                            /**< Default value for RAC_TXSTATUS              */
#define _RAC_TXSTATUS_MASK                                                0x00000001UL                            /**< Mask for RAC_TXSTATUS                       */
#define RAC_TXSTATUS_TXRFPKDOUT                                           (0x1UL << 0)                            /**< TXRFPKDOUT                                  */
#define _RAC_TXSTATUS_TXRFPKDOUT_SHIFT                                    0                                       /**< Shift value for RAC_TXRFPKDOUT              */
#define _RAC_TXSTATUS_TXRFPKDOUT_MASK                                     0x1UL                                   /**< Bit mask for RAC_TXRFPKDOUT                 */
#define _RAC_TXSTATUS_TXRFPKDOUT_DEFAULT                                  0x00000000UL                            /**< Mode DEFAULT for RAC_TXSTATUS               */
#define _RAC_TXSTATUS_TXRFPKDOUT_tbd0                                     0x00000000UL                            /**< Mode tbd0 for RAC_TXSTATUS                  */
#define _RAC_TXSTATUS_TXRFPKDOUT_tbd1                                     0x00000001UL                            /**< Mode tbd1 for RAC_TXSTATUS                  */
#define RAC_TXSTATUS_TXRFPKDOUT_DEFAULT                                   (_RAC_TXSTATUS_TXRFPKDOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXSTATUS       */
#define RAC_TXSTATUS_TXRFPKDOUT_tbd0                                      (_RAC_TXSTATUS_TXRFPKDOUT_tbd0 << 0)    /**< Shifted mode tbd0 for RAC_TXSTATUS          */
#define RAC_TXSTATUS_TXRFPKDOUT_tbd1                                      (_RAC_TXSTATUS_TXRFPKDOUT_tbd1 << 0)    /**< Shifted mode tbd1 for RAC_TXSTATUS          */

