SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXOFDM */
#define _RAC_TXOFDM_RESETVALUE                                            0x00200008UL                                  /**< Default value for RAC_TXOFDM                */
#define _RAC_TXOFDM_MASK                                                  0x03BFB7FBUL                                  /**< Mask for RAC_TXOFDM                         */
#define RAC_TXOFDM_TXENBBDIGREG                                           (0x1UL << 0)                                  /**< TXENBBDIGREG                                */
#define _RAC_TXOFDM_TXENBBDIGREG_SHIFT                                    0                                             /**< Shift value for RAC_TXENBBDIGREG            */
#define _RAC_TXOFDM_TXENBBDIGREG_MASK                                     0x1UL                                         /**< Bit mask for RAC_TXENBBDIGREG               */
#define _RAC_TXOFDM_TXENBBDIGREG_DEFAULT                                  0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBDIGREG_disabled                                 0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBDIGREG_enabled                                  0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBDIGREG_DEFAULT                                   (_RAC_TXOFDM_TXENBBDIGREG_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDIGREG_disabled                                  (_RAC_TXOFDM_TXENBBDIGREG_disabled << 0)      /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBDIGREG_enabled                                   (_RAC_TXOFDM_TXENBBDIGREG_enabled << 0)       /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBREG                                              (0x1UL << 1)                                  /**< TXENBBREG                                   */
#define _RAC_TXOFDM_TXENBBREG_SHIFT                                       1                                             /**< Shift value for RAC_TXENBBREG               */
#define _RAC_TXOFDM_TXENBBREG_MASK                                        0x2UL                                         /**< Bit mask for RAC_TXENBBREG                  */
#define _RAC_TXOFDM_TXENBBREG_DEFAULT                                     0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBREG_disabled                                    0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBREG_enabled                                     0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBREG_DEFAULT                                      (_RAC_TXOFDM_TXENBBREG_DEFAULT << 1)          /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBREG_disabled                                     (_RAC_TXOFDM_TXENBBREG_disabled << 1)         /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBREG_enabled                                      (_RAC_TXOFDM_TXENBBREG_enabled << 1)          /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBREGBLEED                                         (0x1UL << 3)                                  /**< TXENBBREGBLEED                              */
#define _RAC_TXOFDM_TXENBBREGBLEED_SHIFT                                  3                                             /**< Shift value for RAC_TXENBBREGBLEED          */
#define _RAC_TXOFDM_TXENBBREGBLEED_MASK                                   0x8UL                                         /**< Bit mask for RAC_TXENBBREGBLEED             */
#define _RAC_TXOFDM_TXENBBREGBLEED_DEFAULT                                0x00000001UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBREGBLEED_bleedoff                               0x00000000UL                                  /**< Mode bleedoff for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBREGBLEED_bleedon                                0x00000001UL                                  /**< Mode bleedon for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBREGBLEED_DEFAULT                                 (_RAC_TXOFDM_TXENBBREGBLEED_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBREGBLEED_bleedoff                                (_RAC_TXOFDM_TXENBBREGBLEED_bleedoff << 3)    /**< Shifted mode bleedoff for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBREGBLEED_bleedon                                 (_RAC_TXOFDM_TXENBBREGBLEED_bleedon << 3)     /**< Shifted mode bleedon for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUF0                                               (0x1UL << 4)                                  /**< TXENBUF0                                    */
#define _RAC_TXOFDM_TXENBUF0_SHIFT                                        4                                             /**< Shift value for RAC_TXENBUF0                */
#define _RAC_TXOFDM_TXENBUF0_MASK                                         0x10UL                                        /**< Bit mask for RAC_TXENBUF0                   */
#define _RAC_TXOFDM_TXENBUF0_DEFAULT                                      0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUF0_disable                                      0x00000000UL                                  /**< Mode disable for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUF0_enable                                       0x00000001UL                                  /**< Mode enable for RAC_TXOFDM                  */
#define RAC_TXOFDM_TXENBUF0_DEFAULT                                       (_RAC_TXOFDM_TXENBUF0_DEFAULT << 4)           /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUF0_disable                                       (_RAC_TXOFDM_TXENBUF0_disable << 4)           /**< Shifted mode disable for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUF0_enable                                        (_RAC_TXOFDM_TXENBUF0_enable << 4)            /**< Shifted mode enable for RAC_TXOFDM          */
#define RAC_TXOFDM_TXENBUF1                                               (0x1UL << 5)                                  /**< TXENBUF1                                    */
#define _RAC_TXOFDM_TXENBUF1_SHIFT                                        5                                             /**< Shift value for RAC_TXENBUF1                */
#define _RAC_TXOFDM_TXENBUF1_MASK                                         0x20UL                                        /**< Bit mask for RAC_TXENBUF1                   */
#define _RAC_TXOFDM_TXENBUF1_DEFAULT                                      0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUF1_disable                                      0x00000000UL                                  /**< Mode disable for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUF1_enable                                       0x00000001UL                                  /**< Mode enable for RAC_TXOFDM                  */
#define RAC_TXOFDM_TXENBUF1_DEFAULT                                       (_RAC_TXOFDM_TXENBUF1_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUF1_disable                                       (_RAC_TXOFDM_TXENBUF1_disable << 5)           /**< Shifted mode disable for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUF1_enable                                        (_RAC_TXOFDM_TXENBUF1_enable << 5)            /**< Shifted mode enable for RAC_TXOFDM          */
#define RAC_TXOFDM_TXENBBDACI                                             (0x1UL << 6)                                  /**< TXENBBDACI                                  */
#define _RAC_TXOFDM_TXENBBDACI_SHIFT                                      6                                             /**< Shift value for RAC_TXENBBDACI              */
#define _RAC_TXOFDM_TXENBBDACI_MASK                                       0x40UL                                        /**< Bit mask for RAC_TXENBBDACI                 */
#define _RAC_TXOFDM_TXENBBDACI_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBDACI_disabled                                   0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBDACI_enabled                                    0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBDACI_DEFAULT                                     (_RAC_TXOFDM_TXENBBDACI_DEFAULT << 6)         /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDACI_disabled                                    (_RAC_TXOFDM_TXENBBDACI_disabled << 6)        /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBDACI_enabled                                     (_RAC_TXOFDM_TXENBBDACI_enabled << 6)         /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDACQ                                             (0x1UL << 7)                                  /**< TXENBBDACQ                                  */
#define _RAC_TXOFDM_TXENBBDACQ_SHIFT                                      7                                             /**< Shift value for RAC_TXENBBDACQ              */
#define _RAC_TXOFDM_TXENBBDACQ_MASK                                       0x80UL                                        /**< Bit mask for RAC_TXENBBDACQ                 */
#define _RAC_TXOFDM_TXENBBDACQ_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBDACQ_disabled                                   0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBDACQ_enabled                                    0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBDACQ_DEFAULT                                     (_RAC_TXOFDM_TXENBBDACQ_DEFAULT << 7)         /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDACQ_disabled                                    (_RAC_TXOFDM_TXENBBDACQ_disabled << 7)        /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBDACQ_enabled                                     (_RAC_TXOFDM_TXENBBDACQ_enabled << 7)         /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIX                                                (0x1UL << 8)                                  /**< TXENMIX                                     */
#define _RAC_TXOFDM_TXENMIX_SHIFT                                         8                                             /**< Shift value for RAC_TXENMIX                 */
#define _RAC_TXOFDM_TXENMIX_MASK                                          0x100UL                                       /**< Bit mask for RAC_TXENMIX                    */
#define _RAC_TXOFDM_TXENMIX_DEFAULT                                       0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENMIX_disable                                       0x00000000UL                                  /**< Mode disable for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENMIX_enable                                        0x00000001UL                                  /**< Mode enable for RAC_TXOFDM                  */
#define RAC_TXOFDM_TXENMIX_DEFAULT                                        (_RAC_TXOFDM_TXENMIX_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIX_disable                                        (_RAC_TXOFDM_TXENMIX_disable << 8)            /**< Shifted mode disable for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIX_enable                                         (_RAC_TXOFDM_TXENMIX_enable << 8)             /**< Shifted mode enable for RAC_TXOFDM          */
#define RAC_TXOFDM_TXENBUFREG                                             (0x1UL << 9)                                  /**< TXENBUFREG                                  */
#define _RAC_TXOFDM_TXENBUFREG_SHIFT                                      9                                             /**< Shift value for RAC_TXENBUFREG              */
#define _RAC_TXOFDM_TXENBUFREG_MASK                                       0x200UL                                       /**< Bit mask for RAC_TXENBUFREG                 */
#define _RAC_TXOFDM_TXENBUFREG_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUFREG_disabled                                   0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBUFREG_enabled                                    0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBUFREG_DEFAULT                                     (_RAC_TXOFDM_TXENBUFREG_DEFAULT << 9)         /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUFREG_disabled                                    (_RAC_TXOFDM_TXENBUFREG_disabled << 9)        /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBUFREG_enabled                                     (_RAC_TXOFDM_TXENBUFREG_enabled << 9)         /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUFREGBLEED                                        (0x1UL << 10)                                 /**< TXENBUFREGBLEED                             */
#define _RAC_TXOFDM_TXENBUFREGBLEED_SHIFT                                 10                                            /**< Shift value for RAC_TXENBUFREGBLEED         */
#define _RAC_TXOFDM_TXENBUFREGBLEED_MASK                                  0x400UL                                       /**< Bit mask for RAC_TXENBUFREGBLEED            */
#define _RAC_TXOFDM_TXENBUFREGBLEED_DEFAULT                               0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBUFREGBLEED_disabled                              0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBUFREGBLEED_enabled                               0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBUFREGBLEED_DEFAULT                                (_RAC_TXOFDM_TXENBUFREGBLEED_DEFAULT << 10)   /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBUFREGBLEED_disabled                               (_RAC_TXOFDM_TXENBUFREGBLEED_disabled << 10)  /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBUFREGBLEED_enabled                                (_RAC_TXOFDM_TXENBUFREGBLEED_enabled << 10)   /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIXRLOAD                                           (0x1UL << 12)                                 /**< TXENMIXRLOAD                                */
#define _RAC_TXOFDM_TXENMIXRLOAD_SHIFT                                    12                                            /**< Shift value for RAC_TXENMIXRLOAD            */
#define _RAC_TXOFDM_TXENMIXRLOAD_MASK                                     0x1000UL                                      /**< Bit mask for RAC_TXENMIXRLOAD               */
#define _RAC_TXOFDM_TXENMIXRLOAD_DEFAULT                                  0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENMIXRLOAD_disable                                  0x00000000UL                                  /**< Mode disable for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENMIXRLOAD_enable                                   0x00000001UL                                  /**< Mode enable for RAC_TXOFDM                  */
#define RAC_TXOFDM_TXENMIXRLOAD_DEFAULT                                   (_RAC_TXOFDM_TXENMIXRLOAD_DEFAULT << 12)      /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIXRLOAD_disable                                   (_RAC_TXOFDM_TXENMIXRLOAD_disable << 12)      /**< Shifted mode disable for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENMIXRLOAD_enable                                    (_RAC_TXOFDM_TXENMIXRLOAD_enable << 12)       /**< Shifted mode enable for RAC_TXOFDM          */
#define RAC_TXOFDM_TXENPAFASTSTARTUP                                      (0x1UL << 13)                                 /**< TXENPAFASTSTARTUP                           */
#define _RAC_TXOFDM_TXENPAFASTSTARTUP_SHIFT                               13                                            /**< Shift value for RAC_TXENPAFASTSTARTUP       */
#define _RAC_TXOFDM_TXENPAFASTSTARTUP_MASK                                0x2000UL                                      /**< Bit mask for RAC_TXENPAFASTSTARTUP          */
#define _RAC_TXOFDM_TXENPAFASTSTARTUP_DEFAULT                             0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENPAFASTSTARTUP_disable                             0x00000000UL                                  /**< Mode disable for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENPAFASTSTARTUP_enable                              0x00000001UL                                  /**< Mode enable for RAC_TXOFDM                  */
#define RAC_TXOFDM_TXENPAFASTSTARTUP_DEFAULT                              (_RAC_TXOFDM_TXENPAFASTSTARTUP_DEFAULT << 13) /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENPAFASTSTARTUP_disable                              (_RAC_TXOFDM_TXENPAFASTSTARTUP_disable << 13) /**< Shifted mode disable for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENPAFASTSTARTUP_enable                               (_RAC_TXOFDM_TXENPAFASTSTARTUP_enable << 13)  /**< Shifted mode enable for RAC_TXOFDM          */
#define RAC_TXOFDM_TXENSH                                                 (0x1UL << 15)                                 /**< TXENSH                                      */
#define _RAC_TXOFDM_TXENSH_SHIFT                                          15                                            /**< Shift value for RAC_TXENSH                  */
#define _RAC_TXOFDM_TXENSH_MASK                                           0x8000UL                                      /**< Bit mask for RAC_TXENSH                     */
#define _RAC_TXOFDM_TXENSH_DEFAULT                                        0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENSH_disabled                                       0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENSH_enabled                                        0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENSH_DEFAULT                                         (_RAC_TXOFDM_TXENSH_DEFAULT << 15)            /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENSH_disabled                                        (_RAC_TXOFDM_TXENSH_disabled << 15)           /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENSH_enabled                                         (_RAC_TXOFDM_TXENSH_enabled << 15)            /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENSHINBUF                                            (0x1UL << 16)                                 /**< TXENSHINBUF                                 */
#define _RAC_TXOFDM_TXENSHINBUF_SHIFT                                     16                                            /**< Shift value for RAC_TXENSHINBUF             */
#define _RAC_TXOFDM_TXENSHINBUF_MASK                                      0x10000UL                                     /**< Bit mask for RAC_TXENSHINBUF                */
#define _RAC_TXOFDM_TXENSHINBUF_DEFAULT                                   0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENSHINBUF_disabled                                  0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENSHINBUF_enabled                                   0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENSHINBUF_DEFAULT                                    (_RAC_TXOFDM_TXENSHINBUF_DEFAULT << 16)       /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENSHINBUF_disabled                                   (_RAC_TXOFDM_TXENSHINBUF_disabled << 16)      /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENSHINBUF_enabled                                    (_RAC_TXOFDM_TXENSHINBUF_enabled << 16)       /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENSHUGB                                              (0x1UL << 17)                                 /**< TXENSHUGB                                   */
#define _RAC_TXOFDM_TXENSHUGB_SHIFT                                       17                                            /**< Shift value for RAC_TXENSHUGB               */
#define _RAC_TXOFDM_TXENSHUGB_MASK                                        0x20000UL                                     /**< Bit mask for RAC_TXENSHUGB                  */
#define _RAC_TXOFDM_TXENSHUGB_DEFAULT                                     0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENSHUGB_disabled                                    0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENSHUGB_enabled                                     0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENSHUGB_DEFAULT                                      (_RAC_TXOFDM_TXENSHUGB_DEFAULT << 17)         /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENSHUGB_disabled                                     (_RAC_TXOFDM_TXENSHUGB_disabled << 17)        /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENSHUGB_enabled                                      (_RAC_TXOFDM_TXENSHUGB_enabled << 17)         /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENFILI                                               (0x1UL << 18)                                 /**< TXENFILI                                    */
#define _RAC_TXOFDM_TXENFILI_SHIFT                                        18                                            /**< Shift value for RAC_TXENFILI                */
