SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
#define _RAC_TXOFDM_TXENFILI_MASK                                         0x40000UL                                     /**< Bit mask for RAC_TXENFILI                   */
#define _RAC_TXOFDM_TXENFILI_DEFAULT                                      0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENFILI_disabled                                     0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENFILI_enabled                                      0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENFILI_DEFAULT                                       (_RAC_TXOFDM_TXENFILI_DEFAULT << 18)          /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENFILI_disabled                                      (_RAC_TXOFDM_TXENFILI_disabled << 18)         /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENFILI_enabled                                       (_RAC_TXOFDM_TXENFILI_enabled << 18)          /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENFILQ                                               (0x1UL << 19)                                 /**< TXENFILQ                                    */
#define _RAC_TXOFDM_TXENFILQ_SHIFT                                        19                                            /**< Shift value for RAC_TXENFILQ                */
#define _RAC_TXOFDM_TXENFILQ_MASK                                         0x80000UL                                     /**< Bit mask for RAC_TXENFILQ                   */
#define _RAC_TXOFDM_TXENFILQ_DEFAULT                                      0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENFILQ_disabled                                     0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENFILQ_enabled                                      0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENFILQ_DEFAULT                                       (_RAC_TXOFDM_TXENFILQ_DEFAULT << 19)          /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENFILQ_disabled                                      (_RAC_TXOFDM_TXENFILQ_disabled << 19)         /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENFILQ_enabled                                       (_RAC_TXOFDM_TXENFILQ_enabled << 19)          /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDATA                                             (0x1UL << 20)                                 /**< TXENBBDATA                                  */
#define _RAC_TXOFDM_TXENBBDATA_SHIFT                                      20                                            /**< Shift value for RAC_TXENBBDATA              */
#define _RAC_TXOFDM_TXENBBDATA_MASK                                       0x100000UL                                    /**< Bit mask for RAC_TXENBBDATA                 */
#define _RAC_TXOFDM_TXENBBDATA_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENBBDATA_disabled                                   0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENBBDATA_enabled                                    0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENBBDATA_DEFAULT                                     (_RAC_TXOFDM_TXENBBDATA_DEFAULT << 20)        /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENBBDATA_disabled                                    (_RAC_TXOFDM_TXENBBDATA_disabled << 20)       /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENBBDATA_enabled                                     (_RAC_TXOFDM_TXENBBDATA_enabled << 20)        /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENPACMOS                                             (0x1UL << 21)                                 /**< TXENPACMOS                                  */
#define _RAC_TXOFDM_TXENPACMOS_SHIFT                                      21                                            /**< Shift value for RAC_TXENPACMOS              */
#define _RAC_TXOFDM_TXENPACMOS_MASK                                       0x200000UL                                    /**< Bit mask for RAC_TXENPACMOS                 */
#define _RAC_TXOFDM_TXENPACMOS_DEFAULT                                    0x00000001UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENPACMOS_opendrain                                  0x00000000UL                                  /**< Mode opendrain for RAC_TXOFDM               */
#define _RAC_TXOFDM_TXENPACMOS_cmos                                       0x00000001UL                                  /**< Mode cmos for RAC_TXOFDM                    */
#define RAC_TXOFDM_TXENPACMOS_DEFAULT                                     (_RAC_TXOFDM_TXENPACMOS_DEFAULT << 21)        /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENPACMOS_opendrain                                   (_RAC_TXOFDM_TXENPACMOS_opendrain << 21)      /**< Shifted mode opendrain for RAC_TXOFDM       */
#define RAC_TXOFDM_TXENPACMOS_cmos                                        (_RAC_TXOFDM_TXENPACMOS_cmos << 21)           /**< Shifted mode cmos for RAC_TXOFDM            */
#define RAC_TXOFDM_TXENTXBIAS                                             (0x1UL << 23)                                 /**< TXENTXBIAS                                  */
#define _RAC_TXOFDM_TXENTXBIAS_SHIFT                                      23                                            /**< Shift value for RAC_TXENTXBIAS              */
#define _RAC_TXOFDM_TXENTXBIAS_MASK                                       0x800000UL                                    /**< Bit mask for RAC_TXENTXBIAS                 */
#define _RAC_TXOFDM_TXENTXBIAS_DEFAULT                                    0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXENTXBIAS_disabled                                   0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXENTXBIAS_enabled                                    0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXENTXBIAS_DEFAULT                                     (_RAC_TXOFDM_TXENTXBIAS_DEFAULT << 23)        /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXENTXBIAS_disabled                                    (_RAC_TXOFDM_TXENTXBIAS_disabled << 23)       /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXENTXBIAS_enabled                                     (_RAC_TXOFDM_TXENTXBIAS_enabled << 23)        /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXRESETSHCLKDIV                                        (0x1UL << 24)                                 /**< TXRESETSHCLKDIV                             */
#define _RAC_TXOFDM_TXRESETSHCLKDIV_SHIFT                                 24                                            /**< Shift value for RAC_TXRESETSHCLKDIV         */
#define _RAC_TXOFDM_TXRESETSHCLKDIV_MASK                                  0x1000000UL                                   /**< Bit mask for RAC_TXRESETSHCLKDIV            */
#define _RAC_TXOFDM_TXRESETSHCLKDIV_DEFAULT                               0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXRESETSHCLKDIV_disabled                              0x00000000UL                                  /**< Mode disabled for RAC_TXOFDM                */
#define _RAC_TXOFDM_TXRESETSHCLKDIV_enabled                               0x00000001UL                                  /**< Mode enabled for RAC_TXOFDM                 */
#define RAC_TXOFDM_TXRESETSHCLKDIV_DEFAULT                                (_RAC_TXOFDM_TXRESETSHCLKDIV_DEFAULT << 24)   /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXRESETSHCLKDIV_disabled                               (_RAC_TXOFDM_TXRESETSHCLKDIV_disabled << 24)  /**< Shifted mode disabled for RAC_TXOFDM        */
#define RAC_TXOFDM_TXRESETSHCLKDIV_enabled                                (_RAC_TXOFDM_TXRESETSHCLKDIV_enabled << 24)   /**< Shifted mode enabled for RAC_TXOFDM         */
#define RAC_TXOFDM_TXSELPABIASMODE                                        (0x1UL << 25)                                 /**< TXSELPABIASMODE                             */
#define _RAC_TXOFDM_TXSELPABIASMODE_SHIFT                                 25                                            /**< Shift value for RAC_TXSELPABIASMODE         */
#define _RAC_TXOFDM_TXSELPABIASMODE_MASK                                  0x2000000UL                                   /**< Bit mask for RAC_TXSELPABIASMODE            */
#define _RAC_TXOFDM_TXSELPABIASMODE_DEFAULT                               0x00000000UL                                  /**< Mode DEFAULT for RAC_TXOFDM                 */
#define _RAC_TXOFDM_TXSELPABIASMODE_ofdm                                  0x00000000UL                                  /**< Mode ofdm for RAC_TXOFDM                    */
#define _RAC_TXOFDM_TXSELPABIASMODE_fsk                                   0x00000001UL                                  /**< Mode fsk for RAC_TXOFDM                     */
#define RAC_TXOFDM_TXSELPABIASMODE_DEFAULT                                (_RAC_TXOFDM_TXSELPABIASMODE_DEFAULT << 25)   /**< Shifted mode DEFAULT for RAC_TXOFDM         */
#define RAC_TXOFDM_TXSELPABIASMODE_ofdm                                   (_RAC_TXOFDM_TXSELPABIASMODE_ofdm << 25)      /**< Shifted mode ofdm for RAC_TXOFDM            */
#define RAC_TXOFDM_TXSELPABIASMODE_fsk                                    (_RAC_TXOFDM_TXSELPABIASMODE_fsk << 25)       /**< Shifted mode fsk for RAC_TXOFDM             */

