SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXMIX */
#define _RAC_TXMIX_RESETVALUE                                             0x00001100UL                                      /**< Default value for RAC_TXMIX                 */
#define _RAC_TXMIX_MASK                                                   0x1FFFFFFFUL                                      /**< Mask for RAC_TXMIX                          */
#define _RAC_TXMIX_TXSELMIXCTUNE_SHIFT                                    0                                                 /**< Shift value for RAC_TXSELMIXCTUNE           */
#define _RAC_TXMIX_TXSELMIXCTUNE_MASK                                     0x3FUL                                            /**< Bit mask for RAC_TXSELMIXCTUNE              */
#define _RAC_TXMIX_TXSELMIXCTUNE_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELMIXCTUNE_tbd0                                     0x00000000UL                                      /**< Mode tbd0 for RAC_TXMIX                     */
#define _RAC_TXMIX_TXSELMIXCTUNE_tbd1                                     0x00000001UL                                      /**< Mode tbd1 for RAC_TXMIX                     */
#define RAC_TXMIX_TXSELMIXCTUNE_DEFAULT                                   (_RAC_TXMIX_TXSELMIXCTUNE_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELMIXCTUNE_tbd0                                      (_RAC_TXMIX_TXSELMIXCTUNE_tbd0 << 0)              /**< Shifted mode tbd0 for RAC_TXMIX             */
#define RAC_TXMIX_TXSELMIXCTUNE_tbd1                                      (_RAC_TXMIX_TXSELMIXCTUNE_tbd1 << 0)              /**< Shifted mode tbd1 for RAC_TXMIX             */
#define _RAC_TXMIX_TXSELMIXGMSLICEI_SHIFT                                 6                                                 /**< Shift value for RAC_TXSELMIXGMSLICEI        */
#define _RAC_TXMIX_TXSELMIXGMSLICEI_MASK                                  0x3C0UL                                           /**< Bit mask for RAC_TXSELMIXGMSLICEI           */
#define _RAC_TXMIX_TXSELMIXGMSLICEI_DEFAULT                               0x00000004UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELMIXGMSLICEI_tbd0                                  0x00000000UL                                      /**< Mode tbd0 for RAC_TXMIX                     */
#define _RAC_TXMIX_TXSELMIXGMSLICEI_tbd1                                  0x00000001UL                                      /**< Mode tbd1 for RAC_TXMIX                     */
#define RAC_TXMIX_TXSELMIXGMSLICEI_DEFAULT                                (_RAC_TXMIX_TXSELMIXGMSLICEI_DEFAULT << 6)        /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELMIXGMSLICEI_tbd0                                   (_RAC_TXMIX_TXSELMIXGMSLICEI_tbd0 << 6)           /**< Shifted mode tbd0 for RAC_TXMIX             */
#define RAC_TXMIX_TXSELMIXGMSLICEI_tbd1                                   (_RAC_TXMIX_TXSELMIXGMSLICEI_tbd1 << 6)           /**< Shifted mode tbd1 for RAC_TXMIX             */
#define _RAC_TXMIX_TXSELMIXGMSLICEQ_SHIFT                                 10                                                /**< Shift value for RAC_TXSELMIXGMSLICEQ        */
#define _RAC_TXMIX_TXSELMIXGMSLICEQ_MASK                                  0x3C00UL                                          /**< Bit mask for RAC_TXSELMIXGMSLICEQ           */
#define _RAC_TXMIX_TXSELMIXGMSLICEQ_DEFAULT                               0x00000004UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELMIXGMSLICEQ_tbd0                                  0x00000000UL                                      /**< Mode tbd0 for RAC_TXMIX                     */
#define _RAC_TXMIX_TXSELMIXGMSLICEQ_tbd1                                  0x00000001UL                                      /**< Mode tbd1 for RAC_TXMIX                     */
#define RAC_TXMIX_TXSELMIXGMSLICEQ_DEFAULT                                (_RAC_TXMIX_TXSELMIXGMSLICEQ_DEFAULT << 10)       /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELMIXGMSLICEQ_tbd0                                   (_RAC_TXMIX_TXSELMIXGMSLICEQ_tbd0 << 10)          /**< Shifted mode tbd0 for RAC_TXMIX             */
#define RAC_TXMIX_TXSELMIXGMSLICEQ_tbd1                                   (_RAC_TXMIX_TXSELMIXGMSLICEQ_tbd1 << 10)          /**< Shifted mode tbd1 for RAC_TXMIX             */
#define _RAC_TXMIX_TXSELMIXRLOAD_SHIFT                                    14                                                /**< Shift value for RAC_TXSELMIXRLOAD           */
#define _RAC_TXMIX_TXSELMIXRLOAD_MASK                                     0x1C000UL                                         /**< Bit mask for RAC_TXSELMIXRLOAD              */
#define _RAC_TXMIX_TXSELMIXRLOAD_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELMIXRLOAD_off                                      0x00000000UL                                      /**< Mode off for RAC_TXMIX                      */
#define _RAC_TXMIX_TXSELMIXRLOAD_r5p00K                                   0x00000001UL                                      /**< Mode r5p00K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r2p50K                                   0x00000002UL                                      /**< Mode r2p50K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r1p67K                                   0x00000003UL                                      /**< Mode r1p67K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r1p25K                                   0x00000004UL                                      /**< Mode r1p25K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r1p00K                                   0x00000005UL                                      /**< Mode r1p00K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r0p83K                                   0x00000006UL                                      /**< Mode r0p83K for RAC_TXMIX                   */
#define _RAC_TXMIX_TXSELMIXRLOAD_r0p71K                                   0x00000007UL                                      /**< Mode r0p71K for RAC_TXMIX                   */
#define RAC_TXMIX_TXSELMIXRLOAD_DEFAULT                                   (_RAC_TXMIX_TXSELMIXRLOAD_DEFAULT << 14)          /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELMIXRLOAD_off                                       (_RAC_TXMIX_TXSELMIXRLOAD_off << 14)              /**< Shifted mode off for RAC_TXMIX              */
#define RAC_TXMIX_TXSELMIXRLOAD_r5p00K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r5p00K << 14)           /**< Shifted mode r5p00K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r2p50K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r2p50K << 14)           /**< Shifted mode r2p50K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r1p67K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r1p67K << 14)           /**< Shifted mode r1p67K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r1p25K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r1p25K << 14)           /**< Shifted mode r1p25K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r1p00K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r1p00K << 14)           /**< Shifted mode r1p00K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r0p83K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r0p83K << 14)           /**< Shifted mode r0p83K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXRLOAD_r0p71K                                    (_RAC_TXMIX_TXSELMIXRLOAD_r0p71K << 14)           /**< Shifted mode r0p71K for RAC_TXMIX           */
#define RAC_TXMIX_TXSELMIXBAND                                            (0x1UL << 17)                                     /**< TXSELMIXBAND                                */
#define _RAC_TXMIX_TXSELMIXBAND_SHIFT                                     17                                                /**< Shift value for RAC_TXSELMIXBAND            */
#define _RAC_TXMIX_TXSELMIXBAND_MASK                                      0x20000UL                                         /**< Bit mask for RAC_TXSELMIXBAND               */
#define _RAC_TXMIX_TXSELMIXBAND_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELMIXBAND_low                                       0x00000000UL                                      /**< Mode low for RAC_TXMIX                      */
#define _RAC_TXMIX_TXSELMIXBAND_high                                      0x00000001UL                                      /**< Mode high for RAC_TXMIX                     */
#define RAC_TXMIX_TXSELMIXBAND_DEFAULT                                    (_RAC_TXMIX_TXSELMIXBAND_DEFAULT << 17)           /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELMIXBAND_low                                        (_RAC_TXMIX_TXSELMIXBAND_low << 17)               /**< Shifted mode low for RAC_TXMIX              */
#define RAC_TXMIX_TXSELMIXBAND_high                                       (_RAC_TXMIX_TXSELMIXBAND_high << 17)              /**< Shifted mode high for RAC_TXMIX             */
#define _RAC_TXMIX_TXSELMIXRDEG_SHIFT                                     18                                                /**< Shift value for RAC_TXSELMIXRDEG            */
#define _RAC_TXMIX_TXSELMIXRDEG_MASK                                      0x1C0000UL                                        /**< Bit mask for RAC_TXSELMIXRDEG               */
#define _RAC_TXMIX_TXSELMIXRDEG_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define RAC_TXMIX_TXSELMIXRDEG_DEFAULT                                    (_RAC_TXMIX_TXSELMIXRDEG_DEFAULT << 18)           /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXMIXCAPPULLDOWN                                        (0x1UL << 21)                                     /**< TXMIXCAPPULLDOWN                            */
#define _RAC_TXMIX_TXMIXCAPPULLDOWN_SHIFT                                 21                                                /**< Shift value for RAC_TXMIXCAPPULLDOWN        */
#define _RAC_TXMIX_TXMIXCAPPULLDOWN_MASK                                  0x200000UL                                        /**< Bit mask for RAC_TXMIXCAPPULLDOWN           */
#define _RAC_TXMIX_TXMIXCAPPULLDOWN_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_supply                         0x00000000UL                                      /**< Mode cap_to_supply for RAC_TXMIX            */
#define _RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_ground                         0x00000001UL                                      /**< Mode cap_to_ground for RAC_TXMIX            */
#define RAC_TXMIX_TXMIXCAPPULLDOWN_DEFAULT                                (_RAC_TXMIX_TXMIXCAPPULLDOWN_DEFAULT << 21)       /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_supply                          (_RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_supply << 21) /**< Shifted mode cap_to_supply for RAC_TXMIX    */
#define RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_ground                          (_RAC_TXMIX_TXMIXCAPPULLDOWN_cap_to_ground << 21) /**< Shifted mode cap_to_ground for RAC_TXMIX    */
#define RAC_TXMIX_TXSELSHINPUT                                            (0x1UL << 22)                                     /**< TXSELSHINPUT                                */
#define _RAC_TXMIX_TXSELSHINPUT_SHIFT                                     22                                                /**< Shift value for RAC_TXSELSHINPUT            */
#define _RAC_TXMIX_TXSELSHINPUT_MASK                                      0x400000UL                                        /**< Bit mask for RAC_TXSELSHINPUT               */
#define _RAC_TXMIX_TXSELSHINPUT_DEFAULT                                   0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHINPUT_input_hp                                  0x00000000UL                                      /**< Mode input_hp for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHINPUT_input_lp                                  0x00000001UL                                      /**< Mode input_lp for RAC_TXMIX                 */
#define RAC_TXMIX_TXSELSHINPUT_DEFAULT                                    (_RAC_TXMIX_TXSELSHINPUT_DEFAULT << 22)           /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHINPUT_input_hp                                   (_RAC_TXMIX_TXSELSHINPUT_input_hp << 22)          /**< Shifted mode input_hp for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHINPUT_input_lp                                   (_RAC_TXMIX_TXSELSHINPUT_input_lp << 22)          /**< Shifted mode input_lp for RAC_TXMIX         */
#define _RAC_TXMIX_TXSELSHCAPATTN_SHIFT                                   23                                                /**< Shift value for RAC_TXSELSHCAPATTN          */
#define _RAC_TXMIX_TXSELSHCAPATTN_MASK                                    0x3800000UL                                       /**< Bit mask for RAC_TXSELSHCAPATTN             */
#define _RAC_TXMIX_TXSELSHCAPATTN_DEFAULT                                 0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_7dB                                 0x00000000UL                                      /**< Mode Att_7dB for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_11dB                                0x00000001UL                                      /**< Mode Att_11dB for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_15dB                                0x00000002UL                                      /**< Mode Att_15dB for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_18dB                                0x00000003UL                                      /**< Mode Att_18dB for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_22dB                                0x00000004UL                                      /**< Mode Att_22dB for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_1                              0x00000005UL                                      /**< Mode Att_25dB_1 for RAC_TXMIX               */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_2                              0x00000006UL                                      /**< Mode Att_25dB_2 for RAC_TXMIX               */
#define _RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_3                              0x00000007UL                                      /**< Mode Att_25dB_3 for RAC_TXMIX               */
#define RAC_TXMIX_TXSELSHCAPATTN_DEFAULT                                  (_RAC_TXMIX_TXSELSHCAPATTN_DEFAULT << 23)         /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_7dB                                  (_RAC_TXMIX_TXSELSHCAPATTN_Att_7dB << 23)         /**< Shifted mode Att_7dB for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_11dB                                 (_RAC_TXMIX_TXSELSHCAPATTN_Att_11dB << 23)        /**< Shifted mode Att_11dB for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_15dB                                 (_RAC_TXMIX_TXSELSHCAPATTN_Att_15dB << 23)        /**< Shifted mode Att_15dB for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_18dB                                 (_RAC_TXMIX_TXSELSHCAPATTN_Att_18dB << 23)        /**< Shifted mode Att_18dB for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_22dB                                 (_RAC_TXMIX_TXSELSHCAPATTN_Att_22dB << 23)        /**< Shifted mode Att_22dB for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_1                               (_RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_1 << 23)      /**< Shifted mode Att_25dB_1 for RAC_TXMIX       */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_2                               (_RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_2 << 23)      /**< Shifted mode Att_25dB_2 for RAC_TXMIX       */
#define RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_3                               (_RAC_TXMIX_TXSELSHCAPATTN_Att_25dB_3 << 23)      /**< Shifted mode Att_25dB_3 for RAC_TXMIX       */
#define _RAC_TXMIX_TXSELSHCLKDIV_SHIFT                                    26                                                /**< Shift value for RAC_TXSELSHCLKDIV           */
#define _RAC_TXMIX_TXSELSHCLKDIV_MASK                                     0xC000000UL                                       /**< Bit mask for RAC_TXSELSHCLKDIV              */
#define _RAC_TXMIX_TXSELSHCLKDIV_DEFAULT                                  0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHCLKDIV_FS_40MHz                                 0x00000000UL                                      /**< Mode FS_40MHz for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCLKDIV_FS_20MHz                                 0x00000001UL                                      /**< Mode FS_20MHz for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHCLKDIV_FS_5MHz                                  0x00000002UL                                      /**< Mode FS_5MHz for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHCLKDIV_FS_2p5MHz                                0x00000003UL                                      /**< Mode FS_2p5MHz for RAC_TXMIX                */
#define RAC_TXMIX_TXSELSHCLKDIV_DEFAULT                                   (_RAC_TXMIX_TXSELSHCLKDIV_DEFAULT << 26)          /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHCLKDIV_FS_40MHz                                  (_RAC_TXMIX_TXSELSHCLKDIV_FS_40MHz << 26)         /**< Shifted mode FS_40MHz for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCLKDIV_FS_20MHz                                  (_RAC_TXMIX_TXSELSHCLKDIV_FS_20MHz << 26)         /**< Shifted mode FS_20MHz for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHCLKDIV_FS_5MHz                                   (_RAC_TXMIX_TXSELSHCLKDIV_FS_5MHz << 26)          /**< Shifted mode FS_5MHz for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHCLKDIV_FS_2p5MHz                                 (_RAC_TXMIX_TXSELSHCLKDIV_FS_2p5MHz << 26)        /**< Shifted mode FS_2p5MHz for RAC_TXMIX        */
#define RAC_TXMIX_TXSELSHINBUFATTN                                        (0x1UL << 28)                                     /**< TXSELSHINBUFATTN                            */
#define _RAC_TXMIX_TXSELSHINBUFATTN_SHIFT                                 28                                                /**< Shift value for RAC_TXSELSHINBUFATTN        */
#define _RAC_TXMIX_TXSELSHINBUFATTN_MASK                                  0x10000000UL                                      /**< Bit mask for RAC_TXSELSHINBUFATTN           */
#define _RAC_TXMIX_TXSELSHINBUFATTN_DEFAULT                               0x00000000UL                                      /**< Mode DEFAULT for RAC_TXMIX                  */
#define _RAC_TXMIX_TXSELSHINBUFATTN_attn_6dB                              0x00000000UL                                      /**< Mode attn_6dB for RAC_TXMIX                 */
#define _RAC_TXMIX_TXSELSHINBUFATTN_attn_10dB                             0x00000001UL                                      /**< Mode attn_10dB for RAC_TXMIX                */
#define RAC_TXMIX_TXSELSHINBUFATTN_DEFAULT                                (_RAC_TXMIX_TXSELSHINBUFATTN_DEFAULT << 28)       /**< Shifted mode DEFAULT for RAC_TXMIX          */
#define RAC_TXMIX_TXSELSHINBUFATTN_attn_6dB                               (_RAC_TXMIX_TXSELSHINBUFATTN_attn_6dB << 28)      /**< Shifted mode attn_6dB for RAC_TXMIX         */
#define RAC_TXMIX_TXSELSHINBUFATTN_attn_10dB                              (_RAC_TXMIX_TXSELSHINBUFATTN_attn_10dB << 28)     /**< Shifted mode attn_10dB for RAC_TXMIX        */

