SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXITC */
#define _RAC_TXITC_RESETVALUE                                             0x00000040UL                               /**< Default value for RAC_TXITC                 */
#define _RAC_TXITC_MASK                                                   0x000000F3UL                               /**< Mask for RAC_TXITC                          */
#define RAC_TXITC_TXSELITCDAC                                             (0x1UL << 0)                               /**< TXSELITCDAC                                 */
#define _RAC_TXITC_TXSELITCDAC_SHIFT                                      0                                          /**< Shift value for RAC_TXSELITCDAC             */
#define _RAC_TXITC_TXSELITCDAC_MASK                                       0x1UL                                      /**< Bit mask for RAC_TXSELITCDAC                */
#define _RAC_TXITC_TXSELITCDAC_DEFAULT                                    0x00000000UL                               /**< Mode DEFAULT for RAC_TXITC                  */
#define _RAC_TXITC_TXSELITCDAC_wo_tempco                                  0x00000000UL                               /**< Mode wo_tempco for RAC_TXITC                */
#define _RAC_TXITC_TXSELITCDAC_wi_tempco                                  0x00000001UL                               /**< Mode wi_tempco for RAC_TXITC                */
#define RAC_TXITC_TXSELITCDAC_DEFAULT                                     (_RAC_TXITC_TXSELITCDAC_DEFAULT << 0)      /**< Shifted mode DEFAULT for RAC_TXITC          */
#define RAC_TXITC_TXSELITCDAC_wo_tempco                                   (_RAC_TXITC_TXSELITCDAC_wo_tempco << 0)    /**< Shifted mode wo_tempco for RAC_TXITC        */
#define RAC_TXITC_TXSELITCDAC_wi_tempco                                   (_RAC_TXITC_TXSELITCDAC_wi_tempco << 0)    /**< Shifted mode wi_tempco for RAC_TXITC        */
#define RAC_TXITC_TXSELITCPA                                              (0x1UL << 1)                               /**< TXSELITCPA                                  */
#define _RAC_TXITC_TXSELITCPA_SHIFT                                       1                                          /**< Shift value for RAC_TXSELITCPA              */
#define _RAC_TXITC_TXSELITCPA_MASK                                        0x2UL                                      /**< Bit mask for RAC_TXSELITCPA                 */
#define _RAC_TXITC_TXSELITCPA_DEFAULT                                     0x00000000UL                               /**< Mode DEFAULT for RAC_TXITC                  */
#define _RAC_TXITC_TXSELITCPA_wo_tempco                                   0x00000000UL                               /**< Mode wo_tempco for RAC_TXITC                */
#define _RAC_TXITC_TXSELITCPA_wi_tempco                                   0x00000001UL                               /**< Mode wi_tempco for RAC_TXITC                */
#define RAC_TXITC_TXSELITCPA_DEFAULT                                      (_RAC_TXITC_TXSELITCPA_DEFAULT << 1)       /**< Shifted mode DEFAULT for RAC_TXITC          */
#define RAC_TXITC_TXSELITCPA_wo_tempco                                    (_RAC_TXITC_TXSELITCPA_wo_tempco << 1)     /**< Shifted mode wo_tempco for RAC_TXITC        */
#define RAC_TXITC_TXSELITCPA_wi_tempco                                    (_RAC_TXITC_TXSELITCPA_wi_tempco << 1)     /**< Shifted mode wi_tempco for RAC_TXITC        */
#define _RAC_TXITC_TXSELITCDACLEVEL_SHIFT                                 4                                          /**< Shift value for RAC_TXSELITCDACLEVEL        */
#define _RAC_TXITC_TXSELITCDACLEVEL_MASK                                  0x30UL                                     /**< Bit mask for RAC_TXSELITCDACLEVEL           */
#define _RAC_TXITC_TXSELITCDACLEVEL_DEFAULT                               0x00000000UL                               /**< Mode DEFAULT for RAC_TXITC                  */
#define _RAC_TXITC_TXSELITCDACLEVEL_tbd_0                                 0x00000000UL                               /**< Mode tbd_0 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCDACLEVEL_tbd_1                                 0x00000001UL                               /**< Mode tbd_1 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCDACLEVEL_tbd_2                                 0x00000002UL                               /**< Mode tbd_2 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCDACLEVEL_tbd_3                                 0x00000003UL                               /**< Mode tbd_3 for RAC_TXITC                    */
#define RAC_TXITC_TXSELITCDACLEVEL_DEFAULT                                (_RAC_TXITC_TXSELITCDACLEVEL_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_TXITC          */
#define RAC_TXITC_TXSELITCDACLEVEL_tbd_0                                  (_RAC_TXITC_TXSELITCDACLEVEL_tbd_0 << 4)   /**< Shifted mode tbd_0 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCDACLEVEL_tbd_1                                  (_RAC_TXITC_TXSELITCDACLEVEL_tbd_1 << 4)   /**< Shifted mode tbd_1 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCDACLEVEL_tbd_2                                  (_RAC_TXITC_TXSELITCDACLEVEL_tbd_2 << 4)   /**< Shifted mode tbd_2 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCDACLEVEL_tbd_3                                  (_RAC_TXITC_TXSELITCDACLEVEL_tbd_3 << 4)   /**< Shifted mode tbd_3 for RAC_TXITC            */
#define _RAC_TXITC_TXSELITCPALEVEL_SHIFT                                  6                                          /**< Shift value for RAC_TXSELITCPALEVEL         */
#define _RAC_TXITC_TXSELITCPALEVEL_MASK                                   0xC0UL                                     /**< Bit mask for RAC_TXSELITCPALEVEL            */
#define _RAC_TXITC_TXSELITCPALEVEL_DEFAULT                                0x00000001UL                               /**< Mode DEFAULT for RAC_TXITC                  */
#define _RAC_TXITC_TXSELITCPALEVEL_t3350                                  0x00000000UL                               /**< Mode t3350 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCPALEVEL_t2800                                  0x00000001UL                               /**< Mode t2800 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCPALEVEL_t2400                                  0x00000002UL                               /**< Mode t2400 for RAC_TXITC                    */
#define _RAC_TXITC_TXSELITCPALEVEL_t2000                                  0x00000003UL                               /**< Mode t2000 for RAC_TXITC                    */
#define RAC_TXITC_TXSELITCPALEVEL_DEFAULT                                 (_RAC_TXITC_TXSELITCPALEVEL_DEFAULT << 6)  /**< Shifted mode DEFAULT for RAC_TXITC          */
#define RAC_TXITC_TXSELITCPALEVEL_t3350                                   (_RAC_TXITC_TXSELITCPALEVEL_t3350 << 6)    /**< Shifted mode t3350 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCPALEVEL_t2800                                   (_RAC_TXITC_TXSELITCPALEVEL_t2800 << 6)    /**< Shifted mode t2800 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCPALEVEL_t2400                                   (_RAC_TXITC_TXSELITCPALEVEL_t2400 << 6)    /**< Shifted mode t2400 for RAC_TXITC            */
#define RAC_TXITC_TXSELITCPALEVEL_t2000                                   (_RAC_TXITC_TXSELITCPALEVEL_t2000 << 6)    /**< Shifted mode t2000 for RAC_TXITC            */

/* Bit fields for RAC TXCALITC */
#define _RAC_TXCALITC_RESETVALUE                                          0x03C20830UL                                 /**< Default value for RAC_TXCALITC              */
#define _RAC_TXCALITC_MASK                                                0x07CF7DF3UL                                 /**< Mask for RAC_TXCALITC                       */
#define RAC_TXCALITC_TXCALENITCDAC                                        (0x1UL << 0)                                 /**< TXCALENITCDAC                               */
#define _RAC_TXCALITC_TXCALENITCDAC_SHIFT                                 0                                            /**< Shift value for RAC_TXCALENITCDAC           */
#define _RAC_TXCALITC_TXCALENITCDAC_MASK                                  0x1UL                                        /**< Bit mask for RAC_TXCALENITCDAC              */
#define _RAC_TXCALITC_TXCALENITCDAC_DEFAULT                               0x00000000UL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define _RAC_TXCALITC_TXCALENITCDAC_disabled                              0x00000000UL                                 /**< Mode disabled for RAC_TXCALITC              */
#define _RAC_TXCALITC_TXCALENITCDAC_enabled                               0x00000001UL                                 /**< Mode enabled for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALENITCDAC_DEFAULT                                (_RAC_TXCALITC_TXCALENITCDAC_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_TXCALITC       */
#define RAC_TXCALITC_TXCALENITCDAC_disabled                               (_RAC_TXCALITC_TXCALENITCDAC_disabled << 0)  /**< Shifted mode disabled for RAC_TXCALITC      */
#define RAC_TXCALITC_TXCALENITCDAC_enabled                                (_RAC_TXCALITC_TXCALENITCDAC_enabled << 0)   /**< Shifted mode enabled for RAC_TXCALITC       */
#define RAC_TXCALITC_TXCALENITCPA                                         (0x1UL << 1)                                 /**< TXCALENITCPA                                */
#define _RAC_TXCALITC_TXCALENITCPA_SHIFT                                  1                                            /**< Shift value for RAC_TXCALENITCPA            */
#define _RAC_TXCALITC_TXCALENITCPA_MASK                                   0x2UL                                        /**< Bit mask for RAC_TXCALENITCPA               */
#define _RAC_TXCALITC_TXCALENITCPA_DEFAULT                                0x00000000UL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define _RAC_TXCALITC_TXCALENITCPA_disabled                               0x00000000UL                                 /**< Mode disabled for RAC_TXCALITC              */
#define _RAC_TXCALITC_TXCALENITCPA_enabled                                0x00000001UL                                 /**< Mode enabled for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALENITCPA_DEFAULT                                 (_RAC_TXCALITC_TXCALENITCPA_DEFAULT << 1)    /**< Shifted mode DEFAULT for RAC_TXCALITC       */
#define RAC_TXCALITC_TXCALENITCPA_disabled                                (_RAC_TXCALITC_TXCALENITCPA_disabled << 1)   /**< Shifted mode disabled for RAC_TXCALITC      */
#define RAC_TXCALITC_TXCALENITCPA_enabled                                 (_RAC_TXCALITC_TXCALENITCPA_enabled << 1)    /**< Shifted mode enabled for RAC_TXCALITC       */
#define _RAC_TXCALITC_TXCALITCDACIB_SHIFT                                 4                                            /**< Shift value for RAC_TXCALITCDACIB           */
#define _RAC_TXCALITC_TXCALITCDACIB_MASK                                  0x1F0UL                                      /**< Bit mask for RAC_TXCALITCDACIB              */
#define _RAC_TXCALITC_TXCALITCDACIB_DEFAULT                               0x00000003UL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALITCDACIB_DEFAULT                                (_RAC_TXCALITC_TXCALITCDACIB_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_TXCALITC       */
#define _RAC_TXCALITC_TXCALITCPAIB_SHIFT                                  10                                           /**< Shift value for RAC_TXCALITCPAIB            */
#define _RAC_TXCALITC_TXCALITCPAIB_MASK                                   0x7C00UL                                     /**< Bit mask for RAC_TXCALITCPAIB               */
#define _RAC_TXCALITC_TXCALITCPAIB_DEFAULT                                0x00000002UL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALITCPAIB_DEFAULT                                 (_RAC_TXCALITC_TXCALITCPAIB_DEFAULT << 10)   /**< Shifted mode DEFAULT for RAC_TXCALITC       */
#define _RAC_TXCALITC_TXCALITCCOREIB_SHIFT                                16                                           /**< Shift value for RAC_TXCALITCCOREIB          */
#define _RAC_TXCALITC_TXCALITCCOREIB_MASK                                 0xF0000UL                                    /**< Bit mask for RAC_TXCALITCCOREIB             */
#define _RAC_TXCALITC_TXCALITCCOREIB_DEFAULT                              0x00000002UL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALITCCOREIB_DEFAULT                               (_RAC_TXCALITC_TXCALITCCOREIB_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_TXCALITC       */
#define _RAC_TXCALITC_TXCALITCCORETC_SHIFT                                22                                           /**< Shift value for RAC_TXCALITCCORETC          */
#define _RAC_TXCALITC_TXCALITCCORETC_MASK                                 0x7C00000UL                                  /**< Bit mask for RAC_TXCALITCCORETC             */
#define _RAC_TXCALITC_TXCALITCCORETC_DEFAULT                              0x0000000FUL                                 /**< Mode DEFAULT for RAC_TXCALITC               */
#define RAC_TXCALITC_TXCALITCCORETC_DEFAULT                               (_RAC_TXCALITC_TXCALITCCORETC_DEFAULT << 22) /**< Shifted mode DEFAULT for RAC_TXCALITC       */

/* Bit fields for RAC TXPKDCTRL */
#define _RAC_TXPKDCTRL_RESETVALUE                                         0x00000000UL                              /**< Default value for RAC_TXPKDCTRL             */
#define _RAC_TXPKDCTRL_MASK                                               0x0001FFF7UL                              /**< Mask for RAC_TXPKDCTRL                      */
#define _RAC_TXPKDCTRL_TXPKDCLKDIV_SHIFT                                  0                                         /**< Shift value for RAC_TXPKDCLKDIV             */
#define _RAC_TXPKDCTRL_TXPKDCLKDIV_MASK                                   0x7UL                                     /**< Bit mask for RAC_TXPKDCLKDIV                */
#define _RAC_TXPKDCTRL_TXPKDCLKDIV_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for RAC_TXPKDCTRL              */
#define RAC_TXPKDCTRL_TXPKDCLKDIV_DEFAULT                                 (_RAC_TXPKDCTRL_TXPKDCLKDIV_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXPKDCTRL      */
#define _RAC_TXPKDCTRL_TXPKDCNTLEN_SHIFT                                  4                                         /**< Shift value for RAC_TXPKDCNTLEN             */
#define _RAC_TXPKDCTRL_TXPKDCNTLEN_MASK                                   0x1FFF0UL                                 /**< Bit mask for RAC_TXPKDCNTLEN                */
#define _RAC_TXPKDCTRL_TXPKDCNTLEN_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for RAC_TXPKDCTRL              */
#define RAC_TXPKDCTRL_TXPKDCNTLEN_DEFAULT                                 (_RAC_TXPKDCTRL_TXPKDCNTLEN_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_TXPKDCTRL      */

