SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC TXPKDCMD */
#define _RAC_TXPKDCMD_RESETVALUE                                          0x00000000UL                            /**< Default value for RAC_TXPKDCMD              */
#define _RAC_TXPKDCMD_MASK                                                0x00000007UL                            /**< Mask for RAC_TXPKDCMD                       */
#define RAC_TXPKDCMD_TXPKDSTART                                           (0x1UL << 0)                            /**< Start counters                              */
#define _RAC_TXPKDCMD_TXPKDSTART_SHIFT                                    0                                       /**< Shift value for RAC_TXPKDSTART              */
#define _RAC_TXPKDCMD_TXPKDSTART_MASK                                     0x1UL                                   /**< Bit mask for RAC_TXPKDSTART                 */
#define _RAC_TXPKDCMD_TXPKDSTART_DEFAULT                                  0x00000000UL                            /**< Mode DEFAULT for RAC_TXPKDCMD               */
#define RAC_TXPKDCMD_TXPKDSTART_DEFAULT                                   (_RAC_TXPKDCMD_TXPKDSTART_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXPKDCMD       */
#define RAC_TXPKDCMD_TXPKDSTOP                                            (0x1UL << 1)                            /**< Stop counters                               */
#define _RAC_TXPKDCMD_TXPKDSTOP_SHIFT                                     1                                       /**< Shift value for RAC_TXPKDSTOP               */
#define _RAC_TXPKDCMD_TXPKDSTOP_MASK                                      0x2UL                                   /**< Bit mask for RAC_TXPKDSTOP                  */
#define _RAC_TXPKDCMD_TXPKDSTOP_DEFAULT                                   0x00000000UL                            /**< Mode DEFAULT for RAC_TXPKDCMD               */
#define RAC_TXPKDCMD_TXPKDSTOP_DEFAULT                                    (_RAC_TXPKDCMD_TXPKDSTOP_DEFAULT << 1)  /**< Shifted mode DEFAULT for RAC_TXPKDCMD       */
#define RAC_TXPKDCMD_TXPKDCLR                                             (0x1UL << 2)                            /**< Clear counters                              */
#define _RAC_TXPKDCMD_TXPKDCLR_SHIFT                                      2                                       /**< Shift value for RAC_TXPKDCLR                */
#define _RAC_TXPKDCMD_TXPKDCLR_MASK                                       0x4UL                                   /**< Bit mask for RAC_TXPKDCLR                   */
#define _RAC_TXPKDCMD_TXPKDCLR_DEFAULT                                    0x00000000UL                            /**< Mode DEFAULT for RAC_TXPKDCMD               */
#define RAC_TXPKDCMD_TXPKDCLR_DEFAULT                                     (_RAC_TXPKDCMD_TXPKDCLR_DEFAULT << 2)   /**< Shifted mode DEFAULT for RAC_TXPKDCMD       */

/* Bit fields for RAC TXPKDSTATUS */
#define _RAC_TXPKDSTATUS_RESETVALUE                                       0x00000000UL                              /**< Default value for RAC_TXPKDSTATUS           */
#define _RAC_TXPKDSTATUS_MASK                                             0x0001FFF1UL                              /**< Mask for RAC_TXPKDSTATUS                    */
#define RAC_TXPKDSTATUS_TXPKDDONE                                         (0x1UL << 0)                              /**< Counters matched compare value              */
#define _RAC_TXPKDSTATUS_TXPKDDONE_SHIFT                                  0                                         /**< Shift value for RAC_TXPKDDONE               */
#define _RAC_TXPKDSTATUS_TXPKDDONE_MASK                                   0x1UL                                     /**< Bit mask for RAC_TXPKDDONE                  */
#define _RAC_TXPKDSTATUS_TXPKDDONE_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for RAC_TXPKDSTATUS            */
#define RAC_TXPKDSTATUS_TXPKDDONE_DEFAULT                                 (_RAC_TXPKDSTATUS_TXPKDDONE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_TXPKDSTATUS    */
#define _RAC_TXPKDSTATUS_TXPKDCNT_SHIFT                                   4                                         /**< Shift value for RAC_TXPKDCNT                */
#define _RAC_TXPKDSTATUS_TXPKDCNT_MASK                                    0x1FFF0UL                                 /**< Bit mask for RAC_TXPKDCNT                   */
#define _RAC_TXPKDSTATUS_TXPKDCNT_DEFAULT                                 0x00000000UL                              /**< Mode DEFAULT for RAC_TXPKDSTATUS            */
#define RAC_TXPKDSTATUS_TXPKDCNT_DEFAULT                                  (_RAC_TXPKDSTATUS_TXPKDCNT_DEFAULT << 4)  /**< Shifted mode DEFAULT for RAC_TXPKDSTATUS    */

/* Bit fields for RAC RADIOCLKCTRL */
#define _RAC_RADIOCLKCTRL_RESETVALUE                                      0x00000101UL                                    /**< Default value for RAC_RADIOCLKCTRL          */
#define _RAC_RADIOCLKCTRL_MASK                                            0x00000111UL                                    /**< Mask for RAC_RADIOCLKCTRL                   */
#define RAC_RADIOCLKCTRL_CLKSRWUHSPRESC                                   (0x1UL << 0)                                    /**< Ultra High Speed Prescaler                  */
#define _RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_SHIFT                            0                                               /**< Shift value for RAC_CLKSRWUHSPRESC          */
#define _RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_MASK                             0x1UL                                           /**< Bit mask for RAC_CLKSRWUHSPRESC             */
#define _RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DEFAULT                          0x00000001UL                                    /**< Mode DEFAULT for RAC_RADIOCLKCTRL           */
#define _RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV1                             0x00000000UL                                    /**< Mode DIV1 for RAC_RADIOCLKCTRL              */
#define _RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV2                             0x00000001UL                                    /**< Mode DIV2 for RAC_RADIOCLKCTRL              */
#define RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DEFAULT                           (_RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_RADIOCLKCTRL   */
#define RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV1                              (_RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV1 << 0)    /**< Shifted mode DIV1 for RAC_RADIOCLKCTRL      */
#define RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV2                              (_RAC_RADIOCLKCTRL_CLKSRWUHSPRESC_DIV2 << 0)    /**< Shifted mode DIV2 for RAC_RADIOCLKCTRL      */
#define RAC_RADIOCLKCTRL_CLKSRWHSPRESC                                    (0x1UL << 4)                                    /**< High Speed Prescaler                        */
#define _RAC_RADIOCLKCTRL_CLKSRWHSPRESC_SHIFT                             4                                               /**< Shift value for RAC_CLKSRWHSPRESC           */
#define _RAC_RADIOCLKCTRL_CLKSRWHSPRESC_MASK                              0x10UL                                          /**< Bit mask for RAC_CLKSRWHSPRESC              */
#define _RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DEFAULT                           0x00000000UL                                    /**< Mode DEFAULT for RAC_RADIOCLKCTRL           */
#define _RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV1                              0x00000000UL                                    /**< Mode DIV1 for RAC_RADIOCLKCTRL              */
#define _RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV2                              0x00000001UL                                    /**< Mode DIV2 for RAC_RADIOCLKCTRL              */
#define RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DEFAULT                            (_RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DEFAULT << 4)  /**< Shifted mode DEFAULT for RAC_RADIOCLKCTRL   */
#define RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV1                               (_RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV1 << 4)     /**< Shifted mode DIV1 for RAC_RADIOCLKCTRL      */
#define RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV2                               (_RAC_RADIOCLKCTRL_CLKSRWHSPRESC_DIV2 << 4)     /**< Shifted mode DIV2 for RAC_RADIOCLKCTRL      */
#define RAC_RADIOCLKCTRL_CLKSRWLSPRESC                                    (0x1UL << 8)                                    /**< Low Speed Prescaler                         */
#define _RAC_RADIOCLKCTRL_CLKSRWLSPRESC_SHIFT                             8                                               /**< Shift value for RAC_CLKSRWLSPRESC           */
#define _RAC_RADIOCLKCTRL_CLKSRWLSPRESC_MASK                              0x100UL                                         /**< Bit mask for RAC_CLKSRWLSPRESC              */
#define _RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DEFAULT                           0x00000001UL                                    /**< Mode DEFAULT for RAC_RADIOCLKCTRL           */
#define _RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV1                              0x00000000UL                                    /**< Mode DIV1 for RAC_RADIOCLKCTRL              */
#define _RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV2                              0x00000001UL                                    /**< Mode DIV2 for RAC_RADIOCLKCTRL              */
#define RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DEFAULT                            (_RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DEFAULT << 8)  /**< Shifted mode DEFAULT for RAC_RADIOCLKCTRL   */
#define RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV1                               (_RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV1 << 8)     /**< Shifted mode DIV1 for RAC_RADIOCLKCTRL      */
#define RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV2                               (_RAC_RADIOCLKCTRL_CLKSRWLSPRESC_DIV2 << 8)     /**< Shifted mode DIV2 for RAC_RADIOCLKCTRL      */

/* Bit fields for RAC SCRATCH0 */
#define _RAC_SCRATCH0_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH0              */
#define _RAC_SCRATCH0_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH0                       */
#define _RAC_SCRATCH0_SCRATCH0_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH0                */
#define _RAC_SCRATCH0_SCRATCH0_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH0                   */
#define _RAC_SCRATCH0_SCRATCH0_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH0               */
#define RAC_SCRATCH0_SCRATCH0_DEFAULT                                     (_RAC_SCRATCH0_SCRATCH0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH0       */

/* Bit fields for RAC SCRATCH1 */
#define _RAC_SCRATCH1_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH1              */
#define _RAC_SCRATCH1_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH1                       */
#define _RAC_SCRATCH1_SCRATCH1_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH1                */
#define _RAC_SCRATCH1_SCRATCH1_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH1                   */
#define _RAC_SCRATCH1_SCRATCH1_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH1               */
#define RAC_SCRATCH1_SCRATCH1_DEFAULT                                     (_RAC_SCRATCH1_SCRATCH1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH1       */

