SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC SCRATCH2 */
#define _RAC_SCRATCH2_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH2              */
#define _RAC_SCRATCH2_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH2                       */
#define _RAC_SCRATCH2_SCRATCH2_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH2                */
#define _RAC_SCRATCH2_SCRATCH2_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH2                   */
#define _RAC_SCRATCH2_SCRATCH2_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH2               */
#define RAC_SCRATCH2_SCRATCH2_DEFAULT                                     (_RAC_SCRATCH2_SCRATCH2_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH2       */

/* Bit fields for RAC SCRATCH3 */
#define _RAC_SCRATCH3_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH3              */
#define _RAC_SCRATCH3_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH3                       */
#define _RAC_SCRATCH3_SCRATCH3_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH3                */
#define _RAC_SCRATCH3_SCRATCH3_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH3                   */
#define _RAC_SCRATCH3_SCRATCH3_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH3               */
#define RAC_SCRATCH3_SCRATCH3_DEFAULT                                     (_RAC_SCRATCH3_SCRATCH3_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH3       */

/* Bit fields for RAC SCRATCH4 */
#define _RAC_SCRATCH4_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH4              */
#define _RAC_SCRATCH4_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH4                       */
#define _RAC_SCRATCH4_SCRATCH4_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH4                */
#define _RAC_SCRATCH4_SCRATCH4_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH4                   */
#define _RAC_SCRATCH4_SCRATCH4_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH4               */
#define RAC_SCRATCH4_SCRATCH4_DEFAULT                                     (_RAC_SCRATCH4_SCRATCH4_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH4       */

/* Bit fields for RAC SCRATCH5 */
#define _RAC_SCRATCH5_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH5              */
#define _RAC_SCRATCH5_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH5                       */
#define _RAC_SCRATCH5_SCRATCH5_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH5                */
#define _RAC_SCRATCH5_SCRATCH5_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH5                   */
#define _RAC_SCRATCH5_SCRATCH5_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH5               */
#define RAC_SCRATCH5_SCRATCH5_DEFAULT                                     (_RAC_SCRATCH5_SCRATCH5_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH5       */

/* Bit fields for RAC SCRATCH6 */
#define _RAC_SCRATCH6_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH6              */
#define _RAC_SCRATCH6_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH6                       */
#define _RAC_SCRATCH6_SCRATCH6_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH6                */
#define _RAC_SCRATCH6_SCRATCH6_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH6                   */
#define _RAC_SCRATCH6_SCRATCH6_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH6               */
#define RAC_SCRATCH6_SCRATCH6_DEFAULT                                     (_RAC_SCRATCH6_SCRATCH6_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH6       */

/* Bit fields for RAC SCRATCH7 */
#define _RAC_SCRATCH7_RESETVALUE                                          0x00000000UL                          /**< Default value for RAC_SCRATCH7              */
#define _RAC_SCRATCH7_MASK                                                0xFFFFFFFFUL                          /**< Mask for RAC_SCRATCH7                       */
#define _RAC_SCRATCH7_SCRATCH7_SHIFT                                      0                                     /**< Shift value for RAC_SCRATCH7                */
#define _RAC_SCRATCH7_SCRATCH7_MASK                                       0xFFFFFFFFUL                          /**< Bit mask for RAC_SCRATCH7                   */
#define _RAC_SCRATCH7_SCRATCH7_DEFAULT                                    0x00000000UL                          /**< Mode DEFAULT for RAC_SCRATCH7               */
#define RAC_SCRATCH7_SCRATCH7_DEFAULT                                     (_RAC_SCRATCH7_SCRATCH7_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SCRATCH7       */

/* Bit fields for RAC SOFTMCTRL */
#define _RAC_SOFTMCTRL_RESETVALUE                                         0x00000000UL                                   /**< Default value for RAC_SOFTMCTRL             */
#define _RAC_SOFTMCTRL_MASK                                               0x00000DFFUL                                   /**< Mask for RAC_SOFTMCTRL                      */
#define RAC_SOFTMCTRL_TXPATHEN                                            (0x1UL << 0)                                   /**< Soft modem TX data path enable              */
#define _RAC_SOFTMCTRL_TXPATHEN_SHIFT                                     0                                              /**< Shift value for RAC_TXPATHEN                */
#define _RAC_SOFTMCTRL_TXPATHEN_MASK                                      0x1UL                                          /**< Bit mask for RAC_TXPATHEN                   */
#define _RAC_SOFTMCTRL_TXPATHEN_DEFAULT                                   0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_TXPATHEN_DEFAULT                                    (_RAC_SOFTMCTRL_TXPATHEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_RXPATHEN                                            (0x1UL << 1)                                   /**< Soft modem RX data path enable              */
#define _RAC_SOFTMCTRL_RXPATHEN_SHIFT                                     1                                              /**< Shift value for RAC_RXPATHEN                */
#define _RAC_SOFTMCTRL_RXPATHEN_MASK                                      0x2UL                                          /**< Bit mask for RAC_RXPATHEN                   */
#define _RAC_SOFTMCTRL_RXPATHEN_DEFAULT                                   0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_RXPATHEN_DEFAULT                                    (_RAC_SOFTMCTRL_RXPATHEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_FRCPATHEN                                           (0x1UL << 2)                                   /**< Soft modem FRC data path enable             */
#define _RAC_SOFTMCTRL_FRCPATHEN_SHIFT                                    2                                              /**< Shift value for RAC_FRCPATHEN               */
#define _RAC_SOFTMCTRL_FRCPATHEN_MASK                                     0x4UL                                          /**< Bit mask for RAC_FRCPATHEN                  */
#define _RAC_SOFTMCTRL_FRCPATHEN_DEFAULT                                  0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_FRCPATHEN_DEFAULT                                   (_RAC_SOFTMCTRL_FRCPATHEN_DEFAULT << 2)        /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_CLKEN                                               (0x1UL << 3)                                   /**< soft modem clock enable                     */
#define _RAC_SOFTMCTRL_CLKEN_SHIFT                                        3                                              /**< Shift value for RAC_CLKEN                   */
#define _RAC_SOFTMCTRL_CLKEN_MASK                                         0x8UL                                          /**< Bit mask for RAC_CLKEN                      */
#define _RAC_SOFTMCTRL_CLKEN_DEFAULT                                      0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_CLKEN_DEFAULT                                       (_RAC_SOFTMCTRL_CLKEN_DEFAULT << 3)            /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_CLKRUNNING                                          (0x1UL << 4)                                   /**< soft modem clock running                    */
#define _RAC_SOFTMCTRL_CLKRUNNING_SHIFT                                   4                                              /**< Shift value for RAC_CLKRUNNING              */
#define _RAC_SOFTMCTRL_CLKRUNNING_MASK                                    0x10UL                                         /**< Bit mask for RAC_CLKRUNNING                 */
#define _RAC_SOFTMCTRL_CLKRUNNING_DEFAULT                                 0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_CLKRUNNING_DEFAULT                                  (_RAC_SOFTMCTRL_CLKRUNNING_DEFAULT << 4)       /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_TXMODSEL                                            (0x1UL << 5)                                   /**< softm to srw modulator path enable          */
#define _RAC_SOFTMCTRL_TXMODSEL_SHIFT                                     5                                              /**< Shift value for RAC_TXMODSEL                */
#define _RAC_SOFTMCTRL_TXMODSEL_MASK                                      0x20UL                                         /**< Bit mask for RAC_TXMODSEL                   */
#define _RAC_SOFTMCTRL_TXMODSEL_DEFAULT                                   0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_TXMODSEL_DEFAULT                                    (_RAC_SOFTMCTRL_TXMODSEL_DEFAULT << 5)         /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_ANTSELSRCSEL                                        (0x1UL << 6)                                   /**< softm to control antsel                     */
#define _RAC_SOFTMCTRL_ANTSELSRCSEL_SHIFT                                 6                                              /**< Shift value for RAC_ANTSELSRCSEL            */
#define _RAC_SOFTMCTRL_ANTSELSRCSEL_MASK                                  0x40UL                                         /**< Bit mask for RAC_ANTSELSRCSEL               */
#define _RAC_SOFTMCTRL_ANTSELSRCSEL_DEFAULT                               0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_ANTSELSRCSEL_DEFAULT                                (_RAC_SOFTMCTRL_ANTSELSRCSEL_DEFAULT << 6)     /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_FRCEN                                               (0x1UL << 7)                                   /**< Soft modem FRC enable                       */
#define _RAC_SOFTMCTRL_FRCEN_SHIFT                                        7                                              /**< Shift value for RAC_FRCEN                   */
#define _RAC_SOFTMCTRL_FRCEN_MASK                                         0x80UL                                         /**< Bit mask for RAC_FRCEN                      */
#define _RAC_SOFTMCTRL_FRCEN_DEFAULT                                      0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_FRCEN_DEFAULT                                       (_RAC_SOFTMCTRL_FRCEN_DEFAULT << 7)            /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_DISLEGACYPATH                                       (0x1UL << 8)                                   /**< Disable FRC enable legacy path              */
#define _RAC_SOFTMCTRL_DISLEGACYPATH_SHIFT                                8                                              /**< Shift value for RAC_DISLEGACYPATH           */
#define _RAC_SOFTMCTRL_DISLEGACYPATH_MASK                                 0x100UL                                        /**< Bit mask for RAC_DISLEGACYPATH              */
#define _RAC_SOFTMCTRL_DISLEGACYPATH_DEFAULT                              0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_DISLEGACYPATH_DEFAULT                               (_RAC_SOFTMCTRL_DISLEGACYPATH_DEFAULT << 8)    /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_TXDACDISABLECLK                                     (0x1UL << 10)                                  /**< Disable TX DAC clock to TXFRONT             */
#define _RAC_SOFTMCTRL_TXDACDISABLECLK_SHIFT                              10                                             /**< Shift value for RAC_TXDACDISABLECLK         */
#define _RAC_SOFTMCTRL_TXDACDISABLECLK_MASK                               0x400UL                                        /**< Bit mask for RAC_TXDACDISABLECLK            */
#define _RAC_SOFTMCTRL_TXDACDISABLECLK_DEFAULT                            0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_TXDACDISABLECLK_DEFAULT                             (_RAC_SOFTMCTRL_TXDACDISABLECLK_DEFAULT << 10) /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */
#define RAC_SOFTMCTRL_TXDACINVERTCLK                                      (0x1UL << 11)                                  /**< Invert TX DAC clock to TXFRONT              */
#define _RAC_SOFTMCTRL_TXDACINVERTCLK_SHIFT                               11                                             /**< Shift value for RAC_TXDACINVERTCLK          */
#define _RAC_SOFTMCTRL_TXDACINVERTCLK_MASK                                0x800UL                                        /**< Bit mask for RAC_TXDACINVERTCLK             */
#define _RAC_SOFTMCTRL_TXDACINVERTCLK_DEFAULT                             0x00000000UL                                   /**< Mode DEFAULT for RAC_SOFTMCTRL              */
#define RAC_SOFTMCTRL_TXDACINVERTCLK_DEFAULT                              (_RAC_SOFTMCTRL_TXDACINVERTCLK_DEFAULT << 11)  /**< Shifted mode DEFAULT for RAC_SOFTMCTRL      */

/* Bit fields for RAC SFMIF */
#define _RAC_SFMIF_RESETVALUE                                             0x00000000UL                               /**< Default value for RAC_SFMIF                 */
#define _RAC_SFMIF_MASK                                                   0x00FF000FUL                               /**< Mask for RAC_SFMIF                          */
#define RAC_SFMIF_STATECHANGESFMIF                                        (0x1UL << 0)                               /**< Radio State Change                          */
#define _RAC_SFMIF_STATECHANGESFMIF_SHIFT                                 0                                          /**< Shift value for RAC_STATECHANGESFMIF        */
#define _RAC_SFMIF_STATECHANGESFMIF_MASK                                  0x1UL                                      /**< Bit mask for RAC_STATECHANGESFMIF           */
#define _RAC_SFMIF_STATECHANGESFMIF_DEFAULT                               0x00000000UL                               /**< Mode DEFAULT for RAC_SFMIF                  */
#define RAC_SFMIF_STATECHANGESFMIF_DEFAULT                                (_RAC_SFMIF_STATECHANGESFMIF_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SFMIF          */
#define RAC_SFMIF_STIMCMPEVSFMIF                                          (0x1UL << 1)                               /**< STIMER Compare Event                        */
#define _RAC_SFMIF_STIMCMPEVSFMIF_SHIFT                                   1                                          /**< Shift value for RAC_STIMCMPEVSFMIF          */
#define _RAC_SFMIF_STIMCMPEVSFMIF_MASK                                    0x2UL                                      /**< Bit mask for RAC_STIMCMPEVSFMIF             */
#define _RAC_SFMIF_STIMCMPEVSFMIF_DEFAULT                                 0x00000000UL                               /**< Mode DEFAULT for RAC_SFMIF                  */
#define RAC_SFMIF_STIMCMPEVSFMIF_DEFAULT                                  (_RAC_SFMIF_STIMCMPEVSFMIF_DEFAULT << 1)   /**< Shifted mode DEFAULT for RAC_SFMIF          */
#define RAC_SFMIF_SEQLOCKUPSFMIF                                          (0x1UL << 2)                               /**< SEQ locked up                               */
#define _RAC_SFMIF_SEQLOCKUPSFMIF_SHIFT                                   2                                          /**< Shift value for RAC_SEQLOCKUPSFMIF          */
#define _RAC_SFMIF_SEQLOCKUPSFMIF_MASK                                    0x4UL                                      /**< Bit mask for RAC_SEQLOCKUPSFMIF             */
#define _RAC_SFMIF_SEQLOCKUPSFMIF_DEFAULT                                 0x00000000UL                               /**< Mode DEFAULT for RAC_SFMIF                  */
#define RAC_SFMIF_SEQLOCKUPSFMIF_DEFAULT                                  (_RAC_SFMIF_SEQLOCKUPSFMIF_DEFAULT << 2)   /**< Shifted mode DEFAULT for RAC_SFMIF          */
#define RAC_SFMIF_SEQRESETREQSFMIF                                        (0x1UL << 3)                               /**< SEQ reset request                           */
#define _RAC_SFMIF_SEQRESETREQSFMIF_SHIFT                                 3                                          /**< Shift value for RAC_SEQRESETREQSFMIF        */
#define _RAC_SFMIF_SEQRESETREQSFMIF_MASK                                  0x8UL                                      /**< Bit mask for RAC_SEQRESETREQSFMIF           */
#define _RAC_SFMIF_SEQRESETREQSFMIF_DEFAULT                               0x00000000UL                               /**< Mode DEFAULT for RAC_SFMIF                  */
#define RAC_SFMIF_SEQRESETREQSFMIF_DEFAULT                                (_RAC_SFMIF_SEQRESETREQSFMIF_DEFAULT << 3) /**< Shifted mode DEFAULT for RAC_SFMIF          */
#define _RAC_SFMIF_SEQSFMIF_SHIFT                                         16                                         /**< Shift value for RAC_SEQSFMIF                */
#define _RAC_SFMIF_SEQSFMIF_MASK                                          0xFF0000UL                                 /**< Bit mask for RAC_SEQSFMIF                   */
#define _RAC_SFMIF_SEQSFMIF_DEFAULT                                       0x00000000UL                               /**< Mode DEFAULT for RAC_SFMIF                  */
#define RAC_SFMIF_SEQSFMIF_DEFAULT                                        (_RAC_SFMIF_SEQSFMIF_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_SFMIF          */

