SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_rac.h
/* Bit fields for RAC SFMIEN */
#define _RAC_SFMIEN_RESETVALUE                                            0x00000000UL                                 /**< Default value for RAC_SFMIEN                */
#define _RAC_SFMIEN_MASK                                                  0x00FF000FUL                                 /**< Mask for RAC_SFMIEN                         */
#define RAC_SFMIEN_STATECHANGESFMIEN                                      (0x1UL << 0)                                 /**< Radio State Change Interrupt Enable         */
#define _RAC_SFMIEN_STATECHANGESFMIEN_SHIFT                               0                                            /**< Shift value for RAC_STATECHANGESFMIEN       */
#define _RAC_SFMIEN_STATECHANGESFMIEN_MASK                                0x1UL                                        /**< Bit mask for RAC_STATECHANGESFMIEN          */
#define _RAC_SFMIEN_STATECHANGESFMIEN_DEFAULT                             0x00000000UL                                 /**< Mode DEFAULT for RAC_SFMIEN                 */
#define RAC_SFMIEN_STATECHANGESFMIEN_DEFAULT                              (_RAC_SFMIEN_STATECHANGESFMIEN_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_SFMIEN         */
#define RAC_SFMIEN_STIMCMPEVSFMIEN                                        (0x1UL << 1)                                 /**< STIMER Compare Event Interrupt Enable       */
#define _RAC_SFMIEN_STIMCMPEVSFMIEN_SHIFT                                 1                                            /**< Shift value for RAC_STIMCMPEVSFMIEN         */
#define _RAC_SFMIEN_STIMCMPEVSFMIEN_MASK                                  0x2UL                                        /**< Bit mask for RAC_STIMCMPEVSFMIEN            */
#define _RAC_SFMIEN_STIMCMPEVSFMIEN_DEFAULT                               0x00000000UL                                 /**< Mode DEFAULT for RAC_SFMIEN                 */
#define RAC_SFMIEN_STIMCMPEVSFMIEN_DEFAULT                                (_RAC_SFMIEN_STIMCMPEVSFMIEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for RAC_SFMIEN         */
#define RAC_SFMIEN_SEQLOCKUPSFMIEN                                        (0x1UL << 2)                                 /**< SEQ locked up Interrupt Enable              */
#define _RAC_SFMIEN_SEQLOCKUPSFMIEN_SHIFT                                 2                                            /**< Shift value for RAC_SEQLOCKUPSFMIEN         */
#define _RAC_SFMIEN_SEQLOCKUPSFMIEN_MASK                                  0x4UL                                        /**< Bit mask for RAC_SEQLOCKUPSFMIEN            */
#define _RAC_SFMIEN_SEQLOCKUPSFMIEN_DEFAULT                               0x00000000UL                                 /**< Mode DEFAULT for RAC_SFMIEN                 */
#define RAC_SFMIEN_SEQLOCKUPSFMIEN_DEFAULT                                (_RAC_SFMIEN_SEQLOCKUPSFMIEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for RAC_SFMIEN         */
#define RAC_SFMIEN_SEQRESETREQSFMIEN                                      (0x1UL << 3)                                 /**< SEQ reset request Interrupt Enable          */
#define _RAC_SFMIEN_SEQRESETREQSFMIEN_SHIFT                               3                                            /**< Shift value for RAC_SEQRESETREQSFMIEN       */
#define _RAC_SFMIEN_SEQRESETREQSFMIEN_MASK                                0x8UL                                        /**< Bit mask for RAC_SEQRESETREQSFMIEN          */
#define _RAC_SFMIEN_SEQRESETREQSFMIEN_DEFAULT                             0x00000000UL                                 /**< Mode DEFAULT for RAC_SFMIEN                 */
#define RAC_SFMIEN_SEQRESETREQSFMIEN_DEFAULT                              (_RAC_SFMIEN_SEQRESETREQSFMIEN_DEFAULT << 3) /**< Shifted mode DEFAULT for RAC_SFMIEN         */
#define _RAC_SFMIEN_SEQSFMIEN_SHIFT                                       16                                           /**< Shift value for RAC_SEQSFMIEN               */
#define _RAC_SFMIEN_SEQSFMIEN_MASK                                        0xFF0000UL                                   /**< Bit mask for RAC_SEQSFMIEN                  */
#define _RAC_SFMIEN_SEQSFMIEN_DEFAULT                                     0x00000000UL                                 /**< Mode DEFAULT for RAC_SFMIEN                 */
#define RAC_SFMIEN_SEQSFMIEN_DEFAULT                                      (_RAC_SFMIEN_SEQSFMIEN_DEFAULT << 16)        /**< Shifted mode DEFAULT for RAC_SFMIEN         */

/* Bit fields for RAC THMSW */
#define _RAC_THMSW_RESETVALUE                                             0x00000000UL                          /**< Default value for RAC_THMSW                 */
#define _RAC_THMSW_MASK                                                   0x00000003UL                          /**< Mask for RAC_THMSW                          */
#define RAC_THMSW_EN                                                      (0x1UL << 0)                          /**< Enable Switch                               */
#define _RAC_THMSW_EN_SHIFT                                               0                                     /**< Shift value for RAC_EN                      */
#define _RAC_THMSW_EN_MASK                                                0x1UL                                 /**< Bit mask for RAC_EN                         */
#define _RAC_THMSW_EN_DEFAULT                                             0x00000000UL                          /**< Mode DEFAULT for RAC_THMSW                  */
#define _RAC_THMSW_EN_Disabled                                            0x00000000UL                          /**< Mode Disabled for RAC_THMSW                 */
#define _RAC_THMSW_EN_Enabled                                             0x00000001UL                          /**< Mode Enabled for RAC_THMSW                  */
#define RAC_THMSW_EN_DEFAULT                                              (_RAC_THMSW_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_THMSW          */
#define RAC_THMSW_EN_Disabled                                             (_RAC_THMSW_EN_Disabled << 0)         /**< Shifted mode Disabled for RAC_THMSW         */
#define RAC_THMSW_EN_Enabled                                              (_RAC_THMSW_EN_Enabled << 0)          /**< Shifted mode Enabled for RAC_THMSW          */
#define RAC_THMSW_HALFSWITCH                                              (0x1UL << 1)                          /**< Halfswitch Mode enable                      */
#define _RAC_THMSW_HALFSWITCH_SHIFT                                       1                                     /**< Shift value for RAC_HALFSWITCH              */
#define _RAC_THMSW_HALFSWITCH_MASK                                        0x2UL                                 /**< Bit mask for RAC_HALFSWITCH                 */
#define _RAC_THMSW_HALFSWITCH_DEFAULT                                     0x00000000UL                          /**< Mode DEFAULT for RAC_THMSW                  */
#define _RAC_THMSW_HALFSWITCH_Disabled                                    0x00000000UL                          /**< Mode Disabled for RAC_THMSW                 */
#define _RAC_THMSW_HALFSWITCH_Enabled                                     0x00000001UL                          /**< Mode Enabled for RAC_THMSW                  */
#define RAC_THMSW_HALFSWITCH_DEFAULT                                      (_RAC_THMSW_HALFSWITCH_DEFAULT << 1)  /**< Shifted mode DEFAULT for RAC_THMSW          */
#define RAC_THMSW_HALFSWITCH_Disabled                                     (_RAC_THMSW_HALFSWITCH_Disabled << 1) /**< Shifted mode Disabled for RAC_THMSW         */
#define RAC_THMSW_HALFSWITCH_Enabled                                      (_RAC_THMSW_HALFSWITCH_Enabled << 1)  /**< Shifted mode Enabled for RAC_THMSW          */

/** @} End of group EFR32FG25_RAC_BitFields */
/** @} End of group EFR32FG25_RAC */
/** @} End of group Parts */

#endif /* EFR32FG25_RAC_H */
